#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ОсновнаяОрганизация = БухгалтерскийУчетПереопределяемый.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(Запись.Организация) Тогда
			Запись.Организация = ОсновнаяОрганизация;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДатаСоздания = ТекущаяДатаСеанса();
	
	Для каждого СтрокаНабора Из ЭтотОбъект Цикл
		
		Если ПустаяСтрока(СтрокаНабора.НаименованиеСокращенное) Тогда
			СтрокаНабора.НаименованиеСокращенное = СтрокаНабора.Наименование;
		КонецЕсли;
		Если СтрокаНабора.ДатаСоздания = '00010101' Тогда
			СтрокаНабора.ДатаСоздания = ДатаСоздания;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
