#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ВремяДокументаПоУмолчанию() Экспорт
	
	Возврат Новый Структура("Часы, Минуты", 21, 0);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

Функция ПолучитьСоответствиеВидовСчетаФактурыФормам() Экспорт

	ФормыСчетовФактур = Новый Соответствие;
	ФормыСчетовФактур.Вставить(Перечисления.ВидСчетаФактурыПолученного.НаПоступление, "ФормаДокументаНаПоступление");
	ФормыСчетовФактур.Вставить(Перечисления.ВидСчетаФактурыПолученного.НаАванс, "ФормаДокументаНаАванс");
	ФормыСчетовФактур.Вставить(Перечисления.ВидСчетаФактурыПолученного.НаАвансКомитента, "ФормаДокументаНаАванс");
	ФормыСчетовФактур.Вставить(Перечисления.ВидСчетаФактурыПолученного.Корректировочный, "ФормаПодбора");
	
	// Исправление счета-фактуры
	ФормыСчетовФактур.Вставить(Перечисления.ВидСчетаФактурыПолученного.ПустаяСсылка(), "ФормаПодбора");
	
	Возврат ФормыСчетовФактур;

КонецФункции 

Функция ПолучитьКодВидаОперации(СтруктураПараметров) Экспорт
	
	Дата                     = СтруктураПараметров.Дата;
	ВидСчетаФактуры          = СтруктураПараметров.ВидСчетаФактуры;
	Исправление              = СтруктураПараметров.Исправление;
	СчетФактураБезНДС        = СтруктураПараметров.СчетФактураБезНДС;
	ВерсияКодовВидовОпераций = УчетНДСКлиентСервер.ВерсияКодовВидовОпераций(Дата);
	ВозвратЧерезКомиссионера = Ложь;
	
	Если ТипЗнч(СтруктураПараметров) = Тип("ДокументОбъект.СчетФактураПолученный") Тогда
		КодВидаОперацииОснования = Неопределено;
		ДокументыОснования       = СтруктураПараметров.ДокументыОснования.Выгрузить(,"ДокументОснование");
		ОбработчикОбновления     = Истина;
	Иначе
		КодВидаОперацииОснования = СтруктураПараметров.КодВидаОперацииОснования;
		ДокументыОснования       = СтруктураПараметров.ДокументыОснования;
		ОбработчикОбновления     = Ложь;
		Если СтруктураПараметров.Свойство("ВозвратЧерезКомиссионера") Тогда
			ВозвратЧерезКомиссионера = СтруктураПараметров.ВозвратЧерезКомиссионера;
		КонецЕсли;
	КонецЕсли;
	
	КодВидаОперации = "";
	
	Если НЕ УчетНДСПереопределяемый.ИспользуетсяПостановлениеНДС1137(Дата) Тогда
		Возврат КодВидаОперации;
	КонецЕсли;
	
	Если НЕ ОбработчикОбновления
		И СтруктураПараметров.Свойство("НДСПоСтавкам4и2")
		И СтруктураПараметров.НДСПоСтавкам4и2 
		И ВерсияКодовВидовОпераций < 3 Тогда
		
		Возврат "99";
		
	КонецЕсли;
	
	Если Исправление ИЛИ ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.Корректировочный Тогда
		// Код операции наследуется из исправляемого (корректируемого) счета-фактуры
		Если ЗначениеЗаполнено(КодВидаОперацииОснования) Тогда
			Возврат УчетНДС.АктуальныйКодВидаОперации(КодВидаОперацииОснования, ВерсияКодовВидовОпераций);
		КонецЕсли;
	КонецЕсли;
	
	Если ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.НаПоступление Тогда
		
		МассивКомиссияПоЗакупке = Новый Массив;

		Для Каждого СтрокаТабличнойЧасти ИЗ ДокументыОснования Цикл
			
			ТипОснования = ТипЗнч(СтрокаТабличнойЧасти.ДокументОснование);
			
			Если ТипОснования = Тип("ДокументСсылка.ОтражениеНДСКВычету")
				И ВерсияКодовВидовОпераций > 1 Тогда
				// Код операции указывается в документе
				КодВидаОперацииИзДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
					СтрокаТабличнойЧасти.ДокументОснование, "КодВидаОперации");
				КодВидаОперации = УчетНДС.АктуальныйКодВидаОперации(КодВидаОперацииИзДокумента, ВерсияКодовВидовОпераций);
				Прервать;
			ИначеЕсли ВерсияКодовВидовОпераций = 3 Тогда
				// По умолчанию код "01", но необходимо проверить случай "смешанной" закупки (код 15),
				// которая может быть оформлена документом "Поступление товаров услуг".
				КодВидаОперации = "01";
				Если ТипОснования = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
					МассивКомиссияПоЗакупке.Добавить(СтрокаТабличнойЧасти.ДокументОснование);
				Иначе
					МассивКомиссияПоЗакупке.Очистить();
					Прервать;
				КонецЕсли;
			// Коды операций до 1 июля 2016 года.
			ИначеЕсли ТипОснования = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")
				ИЛИ ВозвратЧерезКомиссионера Тогда
				КодВидаОперации = "03";
			ИначеЕсли ТипОснования = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
				КодВидаОперации = "04";
			ИначеЕсли ТипОснования = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
				МассивКомиссияПоЗакупке.Добавить(СтрокаТабличнойЧасти.ДокументОснование);
			КонецЕсли;
			
		КонецЦикла;
		
		Если МассивКомиссияПоЗакупке.Количество() > 0 Тогда
			
			СчетаУчетаКомиссионногоТовара = Новый Массив;
			СчетаУчетаКомиссионногоТовара.Добавить(ПланыСчетов.Хозрасчетный.ТМЦпринятыеНаОтветственноеХранение);
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("ДокументыОснования", МассивКомиссияПоЗакупке);
			Запрос.УстановитьПараметр("СчетаУчетаКомиссионногоТовара", СчетаУчетаКомиссионногоТовара);
			
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ПоступлениеТоваровУслугТовары.Ссылка КАК Ссылка,
			|	МАКСИМУМ(1) КАК ЕстьКомиссионныеТоварыИУслуги,
			|	МАКСИМУМ(0) КАК ЕстьСобственныеТоварыИУслуги
			|ПОМЕСТИТЬ ТоварыПоТипам
			|ИЗ
			|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
			|ГДЕ
			|	ПоступлениеТоваровУслугТовары.Ссылка В(&ДокументыОснования)
			|	И ПоступлениеТоваровУслугТовары.СчетУчета В(&СчетаУчетаКомиссионногоТовара)
			|	И ПоступлениеТоваровУслугТовары.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
			|
			|СГРУППИРОВАТЬ ПО
			|	ПоступлениеТоваровУслугТовары.Ссылка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПоступлениеТоваровУслугТовары.Ссылка,
			|	МАКСИМУМ(0),
			|	МАКСИМУМ(1)
			|ИЗ
			|	Документ.ПоступлениеТоваровУслуг.Товары КАК ПоступлениеТоваровУслугТовары
			|ГДЕ
			|	ПоступлениеТоваровУслугТовары.Ссылка В(&ДокументыОснования)
			|	И НЕ(ПоступлениеТоваровУслугТовары.СчетУчета В (&СчетаУчетаКомиссионногоТовара)
			|				И ПоступлениеТоваровУслугТовары.Контрагент <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
			|
			|СГРУППИРОВАТЬ ПО
			|	ПоступлениеТоваровУслугТовары.Ссылка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПоступлениеТоваровУслугУслуги.Ссылка,
			|	МАКСИМУМ(0),
			|	МАКСИМУМ(1)
			|ИЗ
			|	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
			|ГДЕ
			|	ПоступлениеТоваровУслугУслуги.Ссылка В(&ДокументыОснования)
			|
			|СГРУППИРОВАТЬ ПО
			|	ПоступлениеТоваровУслугУслуги.Ссылка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка,
			|	МАКСИМУМ(1),
			|	МАКСИМУМ(0)
			|ИЗ
			|	Документ.ПоступлениеТоваровУслуг.АгентскиеУслуги КАК ПоступлениеТоваровУслугАгентскиеУслуги
			|ГДЕ
			|	ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка В(&ДокументыОснования)
			|
			|СГРУППИРОВАТЬ ПО
			|	ПоступлениеТоваровУслугАгентскиеУслуги.Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ЕСТЬNULL(ТоварыПоТипам.ЕстьКомиссионныеТоварыИУслуги, 0) КАК ЕстьКомиссионныеТоварыИУслуги,
			|	ЕСТЬNULL(ТоварыПоТипам.ЕстьСобственныеТоварыИУслуги, 0) КАК ЕстьСобственныеТоварыИУслуги
			|ИЗ
			|	ТоварыПоТипам КАК ТоварыПоТипам
			|ИТОГИ
			|	МАКСИМУМ(ЕстьКомиссионныеТоварыИУслуги),
			|	МАКСИМУМ(ЕстьСобственныеТоварыИУслуги)
			|ПО
			|	ОБЩИЕ";
			
			Результат = Запрос.Выполнить();
			Если НЕ Результат.Пустой() Тогда
				Выборка = Результат.Выбрать();
				Если Выборка.Следующий() Тогда
					Если Выборка.ЕстьСобственныеТоварыИУслуги > 0
						И Выборка.ЕстьКомиссионныеТоварыИУслуги > 0 Тогда
						КодВидаОперации = ?(ВерсияКодовВидовОпераций < 3, "01;04", "15");
					ИначеЕсли ВерсияКодовВидовОпераций < 3 И Выборка.ЕстьКомиссионныеТоварыИУслуги > 0 Тогда 
						КодВидаОперации = "04";
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ВерсияКодовВидовОпераций = 3 Тогда 
		Если ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.НаАванс
			ИЛИ ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.НаАвансКомитента Тогда
			КодВидаОперации = "02";
		КонецЕсли;
	// Коды операций до 1 июля 2016 года
	ИначеЕсли ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.НаАванс Тогда
		Если ДокументыОснования.Количество() > 0
			И ТипЗнч(ДокументыОснования[0].ДокументОснование) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
			КодВидаОперации = "05";
		Иначе
			КодВидаОперации = "02";
		КонецЕсли;
	ИначеЕсли ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.НаАвансКомитента Тогда
		КодВидаОперации = "05";
	Иначе
		Для Каждого СтрокаТабличнойЧасти ИЗ ДокументыОснования Цикл
			Если ТипЗнч(СтрокаТабличнойЧасти.ДокументОснование) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
				КодВидаОперации = "04";
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(КодВидаОперации) Тогда
		КодВидаОперации = "01";
	КонецЕсли;
	
	Возврат КодВидаОперации;
	
КонецФункции

Функция ПолучитьПорядокОтраженияВычетаПоУмолчанию(СтруктураПараметров) Экспорт
	
	НДСПредъявленКВычету = Ложь;
	
	Если УчетНДСКлиентСервер.Версия(СтруктураПараметров.Дата) > 1 Тогда
		
		Если СтруктураПараметров.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.НаПоступление Тогда
			
			СчетФактураКомитента = (ТипЗнч(СтруктураПараметров.ДокументОснование) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах"));
			
			Если НЕ СтруктураПараметров.Исправление И НЕ СчетФактураКомитента Тогда
				Если НЕ УчетнаяПолитика.РаздельныйУчетНДС(СтруктураПараметров.Организация, СтруктураПараметров.Дата)
					И НЕ ЕстьСписаниеНДСПоОснованию(СтруктураПараметров) 
					И (СчетФактураПолученВКварталеПоступленияЦенностей(СтруктураПараметров)
					ИЛИ СтруктураПараметров.Дата < '20150101') Тогда
					НДСПредъявленКВычету = Истина;
				КонецЕсли;
			КонецЕсли;
			
		ИначеЕсли СтруктураПараметров.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.НаАванс Тогда
			
			НДСПредъявленКВычету = Истина;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат НДСПредъявленКВычету;
	
КонецФункции

Функция ЕстьСписаниеНДСПоОснованию(СтруктураПараметров)
	
	Если СтруктураПараметров.ДокументОснование  = Неопределено Тогда 
		Возврат Ложь;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	
	ДатаОснования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураПараметров.ДокументОснование, "Дата");
	Запрос.УстановитьПараметр("Организация",				СтруктураПараметров.Организация);
	Запрос.УстановитьПараметр("СчетФактура",				СтруктураПараметров.ДокументОснование);
	Запрос.УстановитьПараметр("НачалоНалоговогоПериода",	НачалоКвартала(ДатаОснования));
	Запрос.УстановитьПараметр("КонецНалоговогоПериода",		КонецКвартала(ДатаОснования));
	
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЕстьСписание
	|ИЗ
	|	РегистрНакопления.НДСПредъявленный КАК НДСПредъявленный
	|ГДЕ
	|	НДСПредъявленный.Организация = &Организация
	|	И НДСПредъявленный.СчетФактура = &СчетФактура
	|	И НДСПредъявленный.Событие = ЗНАЧЕНИЕ(Перечисление.СобытияПоНДСПокупки.НДСсписанНаРасходы)
	|	И НДСПредъявленный.Период >= &НачалоНалоговогоПериода
	|	И НДСПредъявленный.Период <= &КонецНалоговогоПериода";
				   
	Результат	= Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
 	
КонецФункции

Функция СчетФактураПолученВКварталеПоступленияЦенностей(СтруктураПараметров)
	
	Если СтруктураПараметров.ДокументОснование  = Неопределено Тогда 
		Возврат Истина;
	КонецЕсли;	
	
	ДатаОснования = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтруктураПараметров.ДокументОснование, "Дата");
	
	Возврат КонецКвартала(СтруктураПараметров.Дата) = КонецКвартала(ДатаОснования);
	 	
КонецФункции

// Получаем порядок исправления счетов-фактур, 
//устанавливаем значение Истина для счетов-фактур, требующих создания корректировки
Функция ПолучитьСоответствиеВидовСчетаФактурыПорядкуИсправления() Экспорт

	ПорядокИсправления = Новый Соответствие;
	
	ПорядокИсправления.Вставить(Перечисления.ВидСчетаФактурыПолученного.НаПоступление,    Истина);
	ПорядокИсправления.Вставить(Перечисления.ВидСчетаФактурыПолученного.Корректировочный, Истина);
	ПорядокИсправления.Вставить(Перечисления.ВидСчетаФактурыПолученного.НаАванс,          Ложь);
	ПорядокИсправления.Вставить(Перечисления.ВидСчетаФактурыПолученного.НаАвансКомитента, Ложь);
	
	Возврат ПорядокИсправления;

КонецФункции

Функция ПолучитьПредставлениеДокумента(ДокументСсылка, ВидСчетаФактуры) Экспорт
			
	ТекстПредставлениеКраткое	= "";
	ТекстПредставление 			= "";
	ТекстОсновноеПредставление	= "";
	
	Корректировочный = Ложь;
			
	Если ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.НаПоступление Тогда 
		ТекстОсновноеПредставление = НСтр("ru = 'Счет-фактура полученный на поступление'");	
	ИначеЕсли ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.НаАванс Тогда 
		ТекстОсновноеПредставление = НСтр("ru = 'Счет-фактура полученный на аванс'");
	ИначеЕсли ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.НаАвансКомитента Тогда
		ТекстОсновноеПредставление = НСтр("ru = 'Счет-фактура полученный на аванс комитента на закупку'");
	ИначеЕсли ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.Корректировочный Тогда
		Корректировочный = Истина;
		ТекстОсновноеПредставление = НСтр("ru = 'Корректировочный счет-фактура полученный'");
	КонецЕсли;	
			
	Если ЗначениеЗаполнено(ДокументСсылка) И ОбщегоНазначения.СсылкаСуществует(ДокументСсылка) Тогда
		
		РеквизитыСчетаФактуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка, "ВидСчетаФактуры, Исправление, НомерИсправления, ДатаИсправления, 
			|НомерВходящегоДокумента, ДатаВходящегоДокумента, БланкСтрогойОтчетности");
			
		РеквизитыСчетаФактуры.Вставить("Корректировочный", Корректировочный);
		
		СтруктураПредставленияПоРеквизитам = ПолучитьПредставлениеПоРеквизитам(РеквизитыСчетаФактуры, ТекстОсновноеПредставление);	
		ТекстПредставлениеКраткое 	= СтруктураПредставленияПоРеквизитам.ТекстПредставлениеКраткое;
		ТекстПредставление 			= СтруктураПредставленияПоРеквизитам.ТекстПредставление;
		
	Иначе
		ТекстПредставление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 (создание)'"), ТекстОсновноеПредставление);
	КонецЕсли;
	
	СтруктураПредставления = Новый Структура;
	СтруктураПредставления.Вставить("СчетФактураКраткоеПредставление", ТекстПредставлениеКраткое);
	СтруктураПредставления.Вставить("СчетФактураПредставление", ТекстПредставление);
	
	Возврат СтруктураПредставления;
	
КонецФункции

Функция ПолучитьПредставлениеПоРеквизитам(РеквизитыСчетаФактуры = Неопределено, ТекстОсновноеПредставление = "") Экспорт 
	
	СтруктураПредставленияПоРеквизитам = Новый Структура;
	
	Если РеквизитыСчетаФактуры = Неопределено Тогда 
		ТекстПредставлениеКраткое 	= "";
		ТекстПредставление 			= "";
	Иначе
		Если РеквизитыСчетаФактуры.БланкСтрогойОтчетности Тогда
			ТекстОсновноеПредставление = НСтр("ru = 'Счет-фактура (бланк строгой отчетности)'");
		КонецЕсли; 	
		
		Если РеквизитыСчетаФактуры.Исправление Тогда
			ТекстПредставлениеКраткое = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 (испр. %2) от %3'"),
			РеквизитыСчетаФактуры.НомерВходящегоДокумента, РеквизитыСчетаФактуры.НомерИсправления, Формат(РеквизитыСчетаФактуры.ДатаИсправления,"ДЛФ=Д"));
			ТекстПредставление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 %2'"), ТекстОсновноеПредставление, ТекстПредставлениеКраткое);
		Иначе
			ТекстПредставлениеКраткое = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 от %2'"),
			РеквизитыСчетаФактуры.НомерВходящегоДокумента, Формат(РеквизитыСчетаФактуры.ДатаВходящегоДокумента,"ДЛФ=Д"));
			ТекстПредставление = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 %2'"), ТекстОсновноеПредставление, ТекстПредставлениеКраткое);	
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПредставленияПоРеквизитам.Вставить("ТекстПредставлениеКраткое", ТекстПредставлениеКраткое);
	СтруктураПредставленияПоРеквизитам.Вставить("ТекстПредставление", ТекстПредставление);

	Возврат СтруктураПредставленияПоРеквизитам;
	
КонецФункции

Функция ПолучитьРеквизитыИсходногоСчетаФактурыДляКорректировки(ДокументОснование, СчетФактура, ПолучатьПредставление = Ложь) Экспорт
	
	Если СчетФактура.ВидСчетаФактуры <> Перечисления.ВидСчетаФактурыПолученного.Корректировочный Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ОтчетКомитентуОПродажах") Тогда
		
		ПараметрыПоиска = Новый Структура("Организация,
			|ИННКонтрагента,
			|СчетФактураВыданный,
			|НомерСчетаФактуры,
			|ДатаСчетаФактуры,
			|НомерИсправленияСчетаФактуры,
			|ДатаИсправленияСчетаФактуры,
			|НомерКорректировочногоСчетаФактуры,
			|ДатаКорректировочногоСчетаФактуры,
			|НомерИсправленияКорректировочногоСчетаФактуры,
			|ДатаИсправленияКорректировочногоСчетаФактуры");
		
		РеквизитыСФ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СчетФактура, "Организация, Контрагент.ИНН, НомерИсходногоДокумента, ДатаИсходногоДокумента");
		
		ПараметрыПоиска.Вставить("Организация", РеквизитыСФ.Организация);
		ПараметрыПоиска.Вставить("ИННКонтрагента", РеквизитыСФ.КонтрагентИНН);
		ПараметрыПоиска.Вставить("СчетФактураВыданный", Ложь);
		ПараметрыПоиска.Вставить("НомерСчетаФактуры", РеквизитыСФ.НомерИсходногоДокумента);
		ПараметрыПоиска.Вставить("ДатаСчетаФактуры", РеквизитыСФ.ДатаИсходногоДокумента);
		ПараметрыПоиска.Вставить("ДатаИсправленияСчетаФактуры", '00010101');
		ПараметрыПоиска.Вставить("ДатаКорректировочногоСчетаФактуры", '00010101');
		ПараметрыПоиска.Вставить("ДатаИсправленияКорректировочногоСчетаФактуры", '00010101');
		
		ИсходныйСчетФактура = УчетНДС.НайтиСчетФактуруПоРеквизитам(ПараметрыПоиска);
		
		Если ИсходныйСчетФактура <> Неопределено Тогда 
			
			РеквизитыСчетаФактуры = Новый Структура("СчетФактура, СчетФактураПредставление, СчетФактураКраткоеПредставление");
			ПредставлениеДокумента = ПолучитьПредставлениеДокумента(ИсходныйСчетФактура, СчетФактура.ВидСчетаФактуры);
			РеквизитыСчетаФактуры.Вставить("СчетФактура", ИсходныйСчетФактура);
			РеквизитыСчетаФактуры.Вставить("СчетФактураПредставление", ПредставлениеДокумента.СчетФактураПредставление);
			РеквизитыСчетаФактуры.Вставить("СчетФактураКраткоеПредставление", ПредставлениеДокумента.СчетФактураКраткоеПредставление);
			
			Возврат РеквизитыСчетаФактуры;
			
		Иначе
			Возврат Неопределено;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДокументОснование) <> Тип("ДокументСсылка.КорректировкаПоступления") Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	ДокументПоступления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументОснование, "ДокументПоступления");
	
	Если ДокументПоступления <> Неопределено Тогда 
		Если СчетФактура.Исправление ИЛИ СчетФактура.ИсправлениеСобственнойОшибки Тогда
			
			ИсходныйДокументПоступления = УчетНДСПереопределяемый.ПолучитьИсправляемыйДокументПоступления(ДокументОснование);
			
			Если ТипЗнч(ИсходныйДокументПоступления) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
				ИсходныйДокументПоступления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсходныйДокументПоступления, "ДокументПоступления");
			КонецЕсли;
			
		Иначе
			ИсходныйДокументПоступления = ДокументПоступления;
		КонецЕсли;
		
		РеквизитыИсходногоСчетаФактуры = ПолучитьРеквизитыСчетаФактурыПолученного(ИсходныйДокументПоступления, ПолучатьПредставление);
	Иначе
		РеквизитыИсходногоСчетаФактуры = Неопределено;
	КонецЕсли;
	
	Возврат РеквизитыИсходногоСчетаФактуры;
	
КонецФункции

Функция ПолучитьРеквизитыСчетаФактурыПолученного(ДокументОснование, ПолучатьПредставление) Экспорт
	
	РеквизитыСчетаФактуры = Новый Структура(
		"СчетФактура, СчетФактураПредставление, СчетФактураКраткоеПредставление, НомерСчетаФактуры, ДатаСчетаФактуры,
		|Исправление, НомерИсправления, ДатаИсправления, НомерИсходногоДокумента, ДатаИсходногоДокумента,
		|УчитыватьИсправлениеИсходногоДокумента, НомерИсправленияИсходногоДокумента, ДатаИсправленияИсходногоДокумента");
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("ДокументОснование", ДокументОснование);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДокументыОснования.Ссылка КАК Ссылка,
	|	ДокументыОснования.НомерИсходногоДокумента,
	|	ДокументыОснования.ДатаИсходногоДокумента,
	|	ДокументыОснования.УчитыватьИсправлениеИсходногоДокумента,
	|	ДокументыОснования.НомерИсправленияИсходногоДокумента,
	|	ДокументыОснования.ДатаИсправленияИсходногоДокумента
	|ПОМЕСТИТЬ ВТ_СчетФактураПолученныйДокументыОснования
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК ДокументыОснования
	|ГДЕ
	|	ДокументыОснования.ДокументОснование = &ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДокументыОснования.Ссылка,
	|	ДокументыОснования.НомерИсходногоДокумента,
	|	ДокументыОснования.ДатаИсходногоДокумента,
	|	ДокументыОснования.УчитыватьИсправлениеИсходногоДокумента,
	|	ДокументыОснования.НомерИсправленияИсходногоДокумента,
	|	ДокументыОснования.ДатаИсправленияИсходногоДокумента
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК ДокументыОснования
	|ГДЕ
	|	ДокументыОснования.Ссылка = &ДокументОснование
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КорректируемыйСчетФактура.Ссылка КАК СчетФактура,
	|	КорректируемыйСчетФактура.НомерВходящегоДокумента КАК НомерСчетаФактуры,
	|	КорректируемыйСчетФактура.ДатаВходящегоДокумента КАК ДатаСчетаФактуры,
	|	КорректируемыйСчетФактура.Исправление,
	|	ВЫБОР
	|		КОГДА КорректируемыйСчетФактура.Исправление
	|			ТОГДА КорректируемыйСчетФактура.НомерИсправления
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НомерИсправления,
	|	ВЫБОР
	|		КОГДА КорректируемыйСчетФактура.Исправление
	|			ТОГДА КорректируемыйСчетФактура.ДатаИсправления
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаИсправления,
	|	ВЫБОР
	|		КОГДА КорректируемыйСчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|			ТОГДА КорректируемыеОснования.НомерИсходногоДокумента
	|		ИНАЧЕ КорректируемыйСчетФактура.НомерИсходногоДокумента
	|	КОНЕЦ КАК НомерИсходногоДокумента,
	|	ВЫБОР
	|		КОГДА КорректируемыйСчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|			ТОГДА КорректируемыеОснования.ДатаИсходногоДокумента
	|		ИНАЧЕ КорректируемыйСчетФактура.ДатаИсходногоДокумента
	|	КОНЕЦ КАК ДатаИсходногоДокумента,
	|	ВЫБОР
	|		КОГДА КорректируемыйСчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|			ТОГДА КорректируемыеОснования.УчитыватьИсправлениеИсходногоДокумента
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК УчитыватьИсправлениеИсходногоДокумента,
	|	ВЫБОР
	|		КОГДА КорректируемыйСчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|			ТОГДА КорректируемыеОснования.НомерИсправленияИсходногоДокумента
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НомерИсправленияИсходногоДокумента,
	|	ВЫБОР
	|		КОГДА КорректируемыйСчетФактура.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|			ТОГДА КорректируемыеОснования.ДатаИсправленияИсходногоДокумента
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаИсправленияИсходногоДокумента,
	|	КорректируемыйСчетФактура.ВидСчетаФактуры
	|ИЗ
	|	ВТ_СчетФактураПолученныйДокументыОснования КАК КорректируемыеОснования
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК КорректируемыйСчетФактура
	|		ПО КорректируемыеОснования.Ссылка = КорректируемыйСчетФактура.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО (КорректируемыйСчетФактура.Ссылка = ДанныеПервичныхДокументов.Документ)
	|			И (КорректируемыйСчетФактура.Организация = ДанныеПервичныхДокументов.Организация)
	|ГДЕ
	|	НЕ ДанныеПервичныхДокументов.Документ ЕСТЬ NULL 
	|
	|УПОРЯДОЧИТЬ ПО
	|	КорректируемыйСчетФактура.ПометкаУдаления,
	|	КорректируемыйСчетФактура.Проведен УБЫВ,
	|	КорректируемыйСчетФактура.Дата";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(РеквизитыСчетаФактуры, Выборка);
		Если ПолучатьПредставление Тогда
			ПредставлениеДокумента = ПолучитьПредставлениеДокумента(Выборка.СчетФактура, Выборка.ВидСчетаФактуры);
			ЗаполнитьЗначенияСвойств(РеквизитыСчетаФактуры, ПредставлениеДокумента);
		КонецЕсли;
		Возврат РеквизитыСчетаФактуры;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции

Функция РеквизитыНеРедактируемыеВГрупповойОбработке() Экспорт
	
	МассивРеквизитов = Новый Массив();
	МассивРеквизитов.Добавить("УдалитьУчитыватьИсправлениеИсходногоДокумента");
	МассивРеквизитов.Добавить("УдалитьНомерИсправленияИсходногоДокумента");
	МассивРеквизитов.Добавить("УдалитьДатаИсправленияИсходногоДокумента");
	МассивРеквизитов.Добавить("УдалитьКорректировочныйСчетФактура");
	МассивРеквизитов.Добавить("УдалитьНаАванс");
	
	Возврат МассивРеквизитов;
	
КонецФункции

Функция ТекстЗапросаСчетаФактурыВыданныеПоИсправлениюСобственнойОшибки() Экспорт
	
	Возврат "ВЫБРАТЬ
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.Ссылка,
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.НомерСтроки,
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.Покупатель,
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.СчетФактура КАК СчетФактура,
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.Субкомиссионер,
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.Сумма,
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.НДС,
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.СуммаУвеличение,
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.СуммаУменьшение,
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.СуммаНДСУвеличение,
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.СуммаНДСУменьшение
	|ИЗ
	|	Документ.СчетФактураПолученный.СчетаФактурыВыданныеПокупателям КАК СчетФактураПолученныйСчетаФактурыВыданныеПокупателям
	|ГДЕ
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.Ссылка = &Ссылка";

КонецФункции

Функция ТекстЗапросаПродавцыПоИсправляемомуСчетуФактуре() Экспорт
	
	Возврат "ВЫБРАТЬ
	|	Продавцы.Продавец КАК Продавец,
	|	ВЫБОР
	|		КОГДА Продавцы.ИННПродавца = """"
	|			ТОГДА Контрагенты.ИНН
	|		ИНАЧЕ Продавцы.ИННПродавца
	|	КОНЕЦ КАК ИННПродавца,
	|	ВЫБОР
	|		КОГДА Продавцы.ИННПродавца = """"
	|			ТОГДА Контрагенты.ИНН
	|		ИНАЧЕ Продавцы.ИННПродавца
	|	КОНЕЦ КАК ИННПродавцаДоИзменения,
	|	ВЫБОР
	|		КОГДА Контрагенты.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
	|			ТОГДА ВЫБОР
	|					КОГДА Продавцы.КПППродавца = """"
	|						ТОГДА Контрагенты.КПП
	|					ИНАЧЕ Продавцы.КПППродавца
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КПППродавца,
	|	ВЫБОР
	|		КОГДА Контрагенты.ЮридическоеФизическоеЛицо = ЗНАЧЕНИЕ(Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо)
	|			ТОГДА ВЫБОР
	|					КОГДА Продавцы.КПППродавца = """"
	|						ТОГДА Контрагенты.КПП
	|					ИНАЧЕ Продавцы.КПППродавца
	|				КОНЕЦ
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КПППродавцаДоИзменения
	|ИЗ
	|	Документ.СчетФактураПолученный.Продавцы КАК Продавцы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО Продавцы.Продавец = Контрагенты.Ссылка
	|ГДЕ
	|	Продавцы.Ссылка = &СчетФактураИсправляемый
	|
	|УПОРЯДОЧИТЬ ПО
	|	Продавцы.НомерСтроки";
	
КонецФункции

#Область СчетФактураНаПредварительнуюОплату

Функция ПодготовитьПараметрыЗаполненияАванс(ДокументОснование, ДокументСсылка, ДоговорКонтрагента = Неопределено, Отказ) Экспорт

	РеквизитыОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОснование, "Организация, Дата");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование",		ДокументОснование);
	Запрос.УстановитьПараметр("ДокументСсылка",			?(ЗначениеЗаполнено(ДокументСсылка), ДокументСсылка, Неопределено));
	Запрос.УстановитьПараметр("ВалютаРеглУчета",		ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета());
	
	НомераТаблиц = Новый Структура;
	Запрос.Текст = Документы[ДокументОснование.Метаданные().Имя].ТекстЗапросаСчетФактураПолученныйНаАвансРасшифровкаПлатежа(НомераТаблиц)
		+ ТекстЗапросаСуммыАвансовПоВзаиморасчетам(НомераТаблиц)
		+ ТекстЗапросаДанныеПлатежа(НомераТаблиц);
	
	Результат = Запрос.ВыполнитьПакет();

	Если ПроведениеСервер.ИспользуетсяОтложенноеПроведение(РеквизитыОснования.Организация, РеквизитыОснования.Дата) Тогда
		// При использовании отложенного проведения проверим дату актуальности отложенных расчетов.
		ДоговорыПлатежа = Результат[НомераТаблиц.ДоговорыПлатежа].Выгрузить().ВыгрузитьКолонку("ДоговорКонтрагента");
		Если ДоговорыПлатежа.Количество() > 0 Тогда
			МоментАктуальностиОтложенныхРасчетов = УчетВзаиморасчетовОтложенноеПроведение.МоментАктуальностиОтложенныхРасчетов(
				РеквизитыОснования.Организация,
				РеквизитыОснования.Дата,
				,
				ДоговорыПлатежа);
			Если МоментАктуальностиОтложенныхРасчетов <> Неопределено
				И МоментАктуальностиОтложенныхРасчетов.Дата <= РеквизитыОснования.Дата Тогда
				ПараметрыЗаполнения = Новый Структура();
				ПараметрыЗаполнения.Вставить("МоментАктуальностиОтложенныхРасчетов", МоментАктуальностиОтложенныхРасчетов);
				
				Отказ = Истина;
				Возврат ПараметрыЗаполнения;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	СуммыАвансов = Результат[НомераТаблиц.СуммыАвансов].Выгрузить();
	Если СуммыАвансов.Количество() = 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Не обнаружены данные об авансах по документу %1.'"),
			ДокументОснование);
			
		ПараметрыЗаполнения = Новый Структура();
		ПараметрыЗаполнения.Вставить("ТекстСообщения", ТекстСообщения);
			
		Отказ = Истина;
		Возврат ПараметрыЗаполнения;
	КонецЕсли;
	
	РасшифровкаПлатежа = Результат[НомераТаблиц.РасшифровкаПлатежа].Выгрузить();
	Если РасшифровкаПлатежа.Количество() = 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Не обнаружены авансы по документу %1, на которые не выставлены счета-фактуры на аванс.'"),
			ДокументОснование);
		Отказ = Истина;
		Возврат ТекстСообщения;
	КонецЕсли;
			
	// Распределяем рублевые суммы авансов по ставкам НДС из расшифровки платежа
	АвансыПоСчетамНаОплату = РасшифровкаПлатежа.СкопироватьКолонки();
	ОтборСтрокПлатежа = Новый Структура("Контрагент,ДоговорКонтрагента");
	Для каждого СтрокаАванса Из СуммыАвансов Цикл
		ЗаполнитьЗначенияСвойств(ОтборСтрокПлатежа, СтрокаАванса);
		ПлатежиСАвансом = РасшифровкаПлатежа.Скопировать(ОтборСтрокПлатежа);
		ОбщегоНазначенияБПВызовСервера.РаспределитьСуммуПоКолонкеТаблицы(СтрокаАванса.Сумма, ПлатежиСАвансом, "Сумма");
		ОбщегоНазначенияБПВызовСервера.ЗагрузитьВТаблицуЗначений(ПлатежиСАвансом, АвансыПоСчетамНаОплату);
	КонецЦикла;
	АвансыПоСчетамНаОплату.Свернуть(
		"Дата,ДокументОснование,Организация,Контрагент,ДоговорКонтрагента,СтавкаНДС", 
		"Сумма, СуммаНДС");
		
	Для каждого СтрокаАванса Из АвансыПоСчетамНаОплату Цикл 
		СтрокаАванса.СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(СтрокаАванса.Сумма, Истина, УчетНДСВызовСервераПовтИсп.ПолучитьСтавкуНДС(СтрокаАванса.СтавкаНДС));	
	КонецЦикла;		
		
	// Удаляем строки со ставками "Без НДС" и 0% - счета-фактуры на такие авансы не выписываются
	АвансыБезНДС = АвансыПоСчетамНаОплату.НайтиСтроки(Новый Структура("СтавкаНДС", Перечисления.СтавкиНДС.БезНДС));
	Для каждого СтрокаБезНДС Из АвансыБезНДС Цикл
		АвансыПоСчетамНаОплату.Удалить(СтрокаБезНДС);
	КонецЦикла;
	Авансы0 = АвансыПоСчетамНаОплату.НайтиСтроки(Новый Структура("СтавкаНДС", Перечисления.СтавкиНДС.НДС0));
	Для каждого Строка0 Из Авансы0 Цикл
		АвансыПоСчетамНаОплату.Удалить(Строка0);
	КонецЦикла;
	Если АвансыПоСчетамНаОплату.Количество() = 0 Тогда
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru='Не обнаружены авансы по документу %1 по ставкам НДС, 
			|на которые требуется регистрировать счет-фактуру на аванс.'"),
			ДокументОснование);
		Отказ = Истина;
		Возврат ТекстСообщения;
	КонецЕсли;
	
	
	Реквизиты = Новый Структура("Дата,ДокументОснование,Организация,Контрагент,ДоговорКонтрагента");
	ЗаполнитьЗначенияСвойств(Реквизиты, АвансыПоСчетамНаОплату[0]);
	
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Реквизиты", Реквизиты);
	ПараметрыЗаполнения.Вставить("Авансы",    АвансыПоСчетамНаОплату);
	
	Возврат ПараметрыЗаполнения;
	
КонецФункции

Функция ТекстЗапросаСуммыАвансовПоВзаиморасчетам(НомераТаблиц)
	
	// Временная таблица авансов по результатам проведения документа
	НомераТаблиц.Вставить("ВТ_СуммыАвансов", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Проводки.СубконтоДт1 КАК Контрагент,
	|	Проводки.СубконтоДт2 КАК ДоговорКонтрагента,
	|	Проводки.СчетДт КАК СчетАвансов,
	|	СУММА(Проводки.Сумма) КАК Сумма
	|ПОМЕСТИТЬ СуммыАвансов
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный.ДвиженияССубконто(
	|			,
	|			,
	|			Регистратор = &ДокументОснование
	|				И ВидСубконтоДт1 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Контрагенты)
	|				И ВидСубконтоДт2 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Договоры)
	|				И ВидСубконтоДт3 = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.ДокументыРасчетовСКонтрагентами)
	|				И СубконтоДт3 = &ДокументОснование,
	|			,
	|			) КАК Проводки
	|
	|СГРУППИРОВАТЬ ПО
	|	Проводки.СубконтоДт1,
	|	Проводки.СубконтоДт2,
	|	Проводки.СчетДт";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаДанныеПлатежа(НомераТаблиц)
	
	// Таблица договоров из ВТ РасшифровкаПлатежа для отложенного проведения 
	НомераТаблиц.Вставить("ДоговорыПлатежа", НомераТаблиц.Количество());
	
	// Временная таблица контрагентов документа аванса
	НомераТаблиц.Вставить("ВТ_КонтрагентыПлатежа", НомераТаблиц.Количество());
	
	// Временная таблица контрагентов из ВТ_КонтрагентыПлатежа,
	// содержит контрагента, по которому есть аванс, но не был получен СФ на аванс
	НомераТаблиц.Вставить("ВТ_КонтрагентыСчетаФактуры", НомераТаблиц.Количество());
	
	// Суммы авансов из ВТ СуммыАвансов с отбором по контрагенту
	НомераТаблиц.Вставить("СуммыАвансов", НомераТаблиц.Количество());
	
	// Расшифровка платежа документа из ВТ РасшифровкаПлатежа 
	// с отбором по контрагенту
	НомераТаблиц.Вставить("РасшифровкаПлатежа", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасшифровкаПлатежа.ДоговорКонтрагента КАК ДоговорКонтрагента
	|ИЗ
	|	РасшифровкаПлатежа КАК РасшифровкаПлатежа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РасшифровкаПлатежа.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ КонтрагентыПлатежа
	|ИЗ
	|	РасшифровкаПлатежа КАК РасшифровкаПлатежа
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтрагентыПлатежа.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ КонтрагентыСчетаФактуры
	|ИЗ
	|	КонтрагентыПлатежа КАК КонтрагентыПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СуммыАвансов КАК СуммыАвансов
	|		ПО КонтрагентыПлатежа.Контрагент = СуммыАвансов.Контрагент
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактура
	|		ПО (СчетФактура.ДокументОснование = &ДокументОснование)
	|			И (СчетФактура.Ссылка <> &ДокументСсылка)
	|			И (СчетФактура.ПометкаУдаления = ЛОЖЬ)
	|			И (СчетФактура.ВидСчетаФактуры В (ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс), ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАвансКомитента)))
	|			И КонтрагентыПлатежа.Контрагент = СчетФактура.Контрагент
	|ГДЕ
	|	СчетФактура.Ссылка ЕСТЬ NULL 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СуммыАвансов.Контрагент КАК Контрагент,
	|	СуммыАвансов.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	СуммыАвансов.СчетАвансов КАК СчетАвансов,
	|	СуммыАвансов.Сумма КАК Сумма
	|ИЗ
	|	СуммыАвансов КАК СуммыАвансов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КонтрагентыСчетаФактуры КАК КонтрагентыСчетаФактуры
	|		ПО (КонтрагентыСчетаФактуры.Контрагент = СуммыАвансов.Контрагент)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасшифровкаПлатежа.Дата КАК Дата,
	|	РасшифровкаПлатежа.ДокументОснование КАК ДокументОснование,
	|	РасшифровкаПлатежа.Организация КАК Организация,
	|	РасшифровкаПлатежа.Контрагент КАК Контрагент,
	|	РасшифровкаПлатежа.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	РасшифровкаПлатежа.СчетАвансов КАК СчетАвансов,
	|	ВЫБОР
	|		КОГДА РасшифровкаПлатежа.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС18_118)
	|		КОГДА РасшифровкаПлатежа.СтавкаНДС = ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтавкиНДС.НДС10_110)
	|		ИНАЧЕ РасшифровкаПлатежа.СтавкаНДС
	|	КОНЕЦ КАК СтавкаНДС,
	|	РасшифровкаПлатежа.Сумма КАК Сумма,
	|	РасшифровкаПлатежа.СуммаНДС КАК СуммаНДС
	|ИЗ
	|	РасшифровкаПлатежа КАК РасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КонтрагентыСчетаФактуры КАК КонтрагентыСчетаФактуры
	|		ПО РасшифровкаПлатежа.Контрагент = КонтрагентыСчетаФактуры.Контрагент";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

#КонецОбласти

#Область ПараметрыПроведения

Функция ПодготовитьПараметрыПроведения(ДокументСсылка, Отказ) Экспорт

	ПараметрыПроведения = Новый Структура;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка,
		"Организация, Дата, ИсправляемыйСчетФактура, ИсправлениеСобственнойОшибки");
	Запрос.УстановитьПараметр("Дата",                    РеквизитыДокумента.Дата);
	Запрос.УстановитьПараметр("Организация",             РеквизитыДокумента.Организация);
	Запрос.УстановитьПараметр("ЭтоИСО",                  РеквизитыДокумента.ИсправлениеСобственнойОшибки);
	Запрос.УстановитьПараметр("ИсправляемыйСчетФактура", РеквизитыДокумента.ИсправляемыйСчетФактура);
	Запрос.УстановитьПараметр("ВалютаРеглУчета",         ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета());
	
	// Для счета-фактуры 4 квартала 2014 года отдельно определим наличие комиссионных операций.
	ЕстьКомиссия4кв2014 = Ложь;
	Если НачалоКвартала(РеквизитыДокумента.Дата) = '20141001' Тогда
		ЕстьКомиссия4кв2014 = ЕстьКомиссионныеОперацииПоСчетуФактуре4кв2014(ДокументСсылка);
	КонецЕсли;
	Запрос.УстановитьПараметр("ЕстьКомиссия4кв2014", ЕстьКомиссия4кв2014);
	
	Запрос.Текст = ТекстЗапросаРеквизитыДокумента();
	ТаблицаРеквизиты = Запрос.Выполнить().Выгрузить();
	Реквизиты = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ТаблицаРеквизиты[0]);
	
	Запрос.УстановитьПараметр("ИсправляемыйСчетФактура", Реквизиты.ИсправляемыйСчетФактура);
	ИсходныйСчетФактура = УчетНДСПереопределяемый.ПолучитьИсходныйСчетФактуру(Реквизиты.ИсправляемыйСчетФактура);
	Запрос.УстановитьПараметр("ИсходныйСчетФактура", ИсходныйСчетФактура);
	ДатаИсходногоСчетаФактуры = Дата(1,1,1);
	Если ЗначениеЗаполнено(ИсходныйСчетФактура) Тогда
		ДатаИсходногоСчетаФактуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ИсходныйСчетФактура, "Дата");
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаИсходногоСчетаФактуры", ДатаИсходногоСчетаФактуры);
	Запрос.УстановитьПараметр("ПовторноеИсправлениеСобственнойОшибки", Реквизиты.ПовторноеИсправлениеСобственнойОшибки);
	
	ТолькоСторнироватьИсходныйСчетФактуру = Истина;
	Если Реквизиты.ИсправлениеСобственнойОшибки
		И Реквизиты.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом
		И НЕ Реквизиты.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.Корректировочный
		И НЕ Реквизиты.Исправление Тогда
		ТолькоСторнироватьИсходныйСчетФактуру = Ложь;
	КонецЕсли;
	Запрос.УстановитьПараметр("ТолькоСторнироватьИсходныйСчетФактуру", ТолькоСторнироватьИсходныйСчетФактуру);
	
	Если НЕ УчетнаяПолитика.Существует(Реквизиты.Организация, Реквизиты.Период, Истина, ДокументСсылка) Тогда
		Отказ = Истина;
		Возврат ПараметрыПроведения;
	КонецЕсли;
	
	Если Реквизиты.СформированПриВводеНачальныхОстатковНДС Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Реквизиты.Вставить("ПлательщикНДС", УчетнаяПолитика.ПлательщикНДС(Реквизиты.Организация, Реквизиты.Период));
	Реквизиты.Вставить("ВерсияНДС",     УчетНДСКлиентСервер.Версия(Реквизиты.Период));
	Реквизиты.Вставить("ИспользуетсяПостановление1137", УчетНДСПереопределяемый.ИспользуетсяПостановлениеНДС1137(Реквизиты.Период));
	Реквизиты.Вставить("ВедетсяУчетНДСПоФЗ134", УчетНДС.ВедетсяУчетНДСПоФЗ134(Реквизиты.Период));
	Реквизиты.Вставить("ИностранныйСчетФактура", УчетНДС.КонтрагентРезидентТаможенногоСоюза(Реквизиты.Контрагент));
	
	НомераТаблиц = Новый Структура;
	Запрос.Текст = ТекстЗапросаНДСПоАвансамВыданным(НомераТаблиц, ПараметрыПроведения, Реквизиты)
		+ ТекстЗапросаЖурналУчетаСчетовФактур(НомераТаблиц, ПараметрыПроведения, Реквизиты)
		+ ТекстЗапросаОшибочныеРеквизитыКонтрагентов(НомераТаблиц, ПараметрыПроведения, Реквизиты);
		
	Если НЕ ПустаяСтрока(Запрос.Текст) Тогда
		Результат = Запрос.ВыполнитьПакет();
		Для каждого ИндексТаблицы Из НомераТаблиц Цикл
			ПараметрыПроведения.Вставить(ИндексТаблицы.Ключ, Результат[ИндексТаблицы.Значение].Выгрузить());
		КонецЦикла; 
	КонецЕсли;
	
	Если Реквизиты.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.НаПоступление Тогда
		ПараметрыПроведения.Вставить("РеквизитыПоступление", ТаблицаРеквизиты);
	Иначе
		ПараметрыПроведения.Вставить("РеквизитыПоступление", Неопределено);
	КонецЕсли;
		
	Если Реквизиты.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.НаАванс Тогда
		ПараметрыПроведения.Вставить("РеквизитыАванс", ТаблицаРеквизиты);
	Иначе
		ПараметрыПроведения.Вставить("РеквизитыАванс", Неопределено);
	КонецЕсли;
		
	Возврат ПараметрыПроведения;
	
КонецФункции 

Функция ТекстЗапросаРеквизитыДокумента()

	ТекстЗапроса =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ИСТИНА КАК ЕстьДвиженияВыданногоПоПолученному,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СчетФактураПолученныйОтПродавца КАК СчетФактураПолученныйОтПродавца
	|ПОМЕСТИТЬ ДвиженияВыданногоСФПоИсправляемому
	|ИЗ
	|	РегистрСведений.ЖурналУчетаСчетовФактур.СрезПоследних(
	|			&Дата,
	|			&ЭтоИСО
	|				И Организация = &Организация
	|				И СчетФактураПолученныйОтПродавца = &ИсправляемыйСчетФактура) КАК ЖурналУчетаСчетовФактурСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактураПолученныйОтПродавца
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Ссылка,
	|	Реквизиты.Дата,
	|	Реквизиты.Организация,
	|	Реквизиты.ДокументОснование,
	|	Реквизиты.ВалютаДокумента,
	|	Реквизиты.Контрагент,
	|	Реквизиты.КППКонтрагента КАК КППКонтрагента,
	|	Реквизиты.Продавец,
	|	Реквизиты.ДоговорКонтрагента,
	|	Реквизиты.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ЕСТЬNULL(ДанныеПервичныхДокументов.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДокументОснованиеДата,
	|	Реквизиты.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	Реквизиты.ДоговорКонтрагента.ВидАгентскогоДоговора КАК ВидАгентскогоДоговора,
	|	ЕСТЬNULL(Реквизиты.ДоговорКонтрагента.УчетАгентскогоНДС, ЛОЖЬ) КАК УчетАгентскогоНДС,
	|	ЕСТЬNULL(Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах, ЛОЖЬ) КАК РасчетыВУсловныхЕдиницах,
	|	Реквизиты.ВидСчетаФактуры,
	|	Реквизиты.ДатаВходящегоДокумента,
	|	Реквизиты.НомерВходящегоДокумента,
	|	Реквизиты.Исправление,
	|	Реквизиты.НомерИсправления,
	|	Реквизиты.ДатаИсправления,
	|	Реквизиты.СформированПриВводеНачальныхОстатковНДС,
	|	Реквизиты.БланкСтрогойОтчетности,
	|	Реквизиты.НДСПредъявленКВычету,
	|	Реквизиты.КодСпособаПолучения,
	|	Реквизиты.КодВидаОперации,
	|	Реквизиты.КодВидаОперацииНаУменьшение,
	|	Реквизиты.СуммаДокумента,
	|	Реквизиты.СуммаНДСДокумента,
	|	Реквизиты.СуммаУвеличение,
	|	Реквизиты.СуммаУменьшение,
	|	Реквизиты.СуммаНДСУвеличение,
	|	Реквизиты.СуммаНДСУменьшение,
	|	Реквизиты.СуммаДокументаКомиссия,
	|	Реквизиты.СуммаНДСДокументаКомиссия,
	|	Реквизиты.СуммаУвеличениеКомиссия,
	|	Реквизиты.СуммаУменьшениеКомиссия,
	|	Реквизиты.СуммаНДСУвеличениеКомиссия,
	|	Реквизиты.СуммаНДСУменьшениеКомиссия,
	|	Реквизиты.СчетФактураБезНДС,
	|	Реквизиты.Субкомиссионер,
	|	Реквизиты.СчетФактураВыданныйПокупателю,
	|	ВЫБОР
	|		КОГДА Реквизиты.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомитентом)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК РеализацияТоваровКомитента,
	|	ВЫБОР
	|		КОГДА Реквизиты.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомитентом)
	|				И Реквизиты.Дата >= ДАТАВРЕМЯ(2015, 1, 1)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СводныйСчетФактураКомитентаПо1279,
	|	ВЫБОР
	|		КОГДА Реквизиты.ДоговорКонтрагента.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СКомиссионеромНаЗакупку)
	|				И Реквизиты.Дата >= ДАТАВРЕМЯ(2015, 1, 1)
	|				И Реквизиты.СводныйКомиссионный
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СводныйСчетФактураКомиссионераПо1279,
	|	ВЫБОР
	|		КОГДА Реквизиты.ДокументОснование ССЫЛКА Документ.АвансовыйОтчет
	|				И Реквизиты.Дата >= ДАТАВРЕМЯ(2014, 10, 1)
	|			ТОГДА ЕСТЬNULL(ДанныеПервичныхДокументов.Номер, """")
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК НомерДокументаОплаты,
	|	ВЫБОР
	|		КОГДА Реквизиты.ДокументОснование ССЫЛКА Документ.АвансовыйОтчет
	|				И Реквизиты.Дата >= ДАТАВРЕМЯ(2014, 10, 1)
	|			ТОГДА ЕСТЬNULL(ДанныеПервичныхДокументов.Дата, ДАТАВРЕМЯ(1, 1, 1))
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК ДатаДокументаОплаты,
	|	Реквизиты.ИсправлениеСобственнойОшибки,
	|	Реквизиты.ИсправляемыйСчетФактура,
	|	ЕСТЬNULL(ДанныеПервичныхДокументовИсправляемыйСчетФактура.ДатаРегистратора, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаИсправляемогоСчетаФактуры,
	|	Реквизиты.ИННКонтрагента,
	|	Реквизиты.СуммаДокументаКомиссия > 0
	|		ИЛИ Реквизиты.СуммаУвеличениеКомиссия > 0
	|		ИЛИ Реквизиты.СуммаУменьшениеКомиссия > 0
	|		ИЛИ &ЕстьКомиссия4кв2014 КАК ЕстьКомиссия,
	|	ЕСТЬNULL(ДвиженияВыданногоСФПоИсправляемому.ЕстьДвиженияВыданногоПоПолученному, ЛОЖЬ) КАК ПовторноеИсправлениеСобственнойОшибки
	|ПОМЕСТИТЬ Реквизиты
	|ИЗ
	|	Документ.СчетФактураПолученный КАК Реквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО Реквизиты.Организация = ДанныеПервичныхДокументов.Организация
	|			И Реквизиты.ДокументОснование = ДанныеПервичныхДокументов.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументовИсправляемыйСчетФактура
	|		ПО Реквизиты.Организация = ДанныеПервичныхДокументовИсправляемыйСчетФактура.Организация
	|			И Реквизиты.ИсправляемыйСчетФактура = ДанныеПервичныхДокументовИсправляемыйСчетФактура.Документ
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДвиженияВыданногоСФПоИсправляемому КАК ДвиженияВыданногоСФПоИсправляемому
	|		ПО Реквизиты.ИсправляемыйСчетФактура = ДвиженияВыданногоСФПоИсправляемому.СчетФактураПолученныйОтПродавца
	|ГДЕ
	|	Реквизиты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Организация,
	|	Реквизиты.ВидСчетаФактуры,
	|	Реквизиты.СформированПриВводеНачальныхОстатковНДС,
	|	Реквизиты.ДоговорКонтрагента,
	|	Реквизиты.ДокументОснование,
	|	Реквизиты.Исправление,
	|	Реквизиты.БланкСтрогойОтчетности,
	|	Реквизиты.НДСПредъявленКВычету,
	|	Реквизиты.Контрагент,
	|	Реквизиты.СводныйСчетФактураКомитентаПо1279,
	|	Реквизиты.СводныйСчетФактураКомиссионераПо1279,
	|	Реквизиты.КодВидаОперации,
	|	Реквизиты.НомерДокументаОплаты,
	|	Реквизиты.ДатаДокументаОплаты,
	|	Реквизиты.ИсправлениеСобственнойОшибки,
	|	Реквизиты.ИсправляемыйСчетФактура,
	|	Реквизиты.ДатаИсправляемогоСчетаФактуры,
	|	Реквизиты.ЕстьКомиссия,
	|	Реквизиты.ПовторноеИсправлениеСобственнойОшибки,
	|	Реквизиты.ВидДоговора
	|ИЗ
	|	Реквизиты КАК Реквизиты";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаНДСПоАвансамВыданным(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	Если НЕ Реквизиты.ПлательщикНДС
		ИЛИ Реквизиты.ВидСчетаФактуры <> Перечисления.ВидСчетаФактурыПолученного.НаАванс Тогда
		ПараметрыПроведения.Вставить("ТаблицаАвансов", Неопределено);
		Возврат "";
	КонецЕсли;
	
	НомераТаблиц.Вставить("ТаблицаАвансов", НомераТаблиц.Количество());
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	Реквизиты.Контрагент КАК Контрагент,
	|	Реквизиты.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	Реквизиты.ДокументОснование КАК СчетФактура,
	|	ТаблицаАвансы.СтавкаНДС,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСпоАвансамИПредоплатамВыданным) КАК СчетУчетаНДС,
	|	ВЫБОР
	|		КОГДА Реквизиты.ИсправлениеСобственнойОшибки
	|				И КОНЕЦПЕРИОДА(Реквизиты.Дата, КВАРТАЛ) > КОНЕЦПЕРИОДА(&ДатаИсходногоСчетаФактуры, КВАРТАЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЗаписьДополнительногоЛиста,
	|	ВЫБОР
	|		КОГДА Реквизиты.ИсправлениеСобственнойОшибки
	|				И КОНЕЦПЕРИОДА(Реквизиты.Дата, КВАРТАЛ) > КОНЕЦПЕРИОДА(&ДатаИсходногоСчетаФактуры, КВАРТАЛ)
	|			ТОГДА НАЧАЛОПЕРИОДА(&ДатаИсходногоСчетаФактуры, КВАРТАЛ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ КАК КорректируемыйПериод,
	|	Реквизиты.Дата КАК ДатаСобытия,
	|	ВЫБОР
	|		КОГДА Реквизиты.Исправление
	|				ИЛИ Реквизиты.ИсправлениеСобственнойОшибки
	|			ТОГДА Реквизиты.Ссылка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ИсправленныйСчетФактура,
	|	СУММА(ТаблицаАвансы.СуммаНДС) КАК СуммаНДС,
	|	СУММА(ТаблицаАвансы.Сумма - ТаблицаАвансы.СуммаНДС) КАК СуммаБезНДС,
	|	ЕСТЬNULL(ДанныеПервичныхДокументов.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаДокументаОплаты,
	|	ЕСТЬNULL(ДанныеПервичныхДокументов.Номер, НЕОПРЕДЕЛЕНО) КАК НомерДокументаОплаты,
	|	ВЫБОР
	|		КОГДА Реквизиты.Дата < ДАТАВРЕМЯ(2015, 1, 1)
	|			ТОГДА """"
	|		ИНАЧЕ Реквизиты.КодВидаОперации
	|	КОНЕЦ КАК КодВидаОперации
	|ИЗ
	|	Документ.СчетФактураПолученный.Авансы КАК ТаблицаАвансы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеПервичныхДокументов КАК ДанныеПервичныхДокументов
	|		ПО (ДанныеПервичныхДокументов.Документ = Реквизиты.ДокументОснование)
	|ГДЕ
	|	ТаблицаАвансы.Ссылка = &Ссылка
	|	И НЕ Реквизиты.СводныйСчетФактураКомиссионераПо1279
	|
	|СГРУППИРОВАТЬ ПО
	|	Реквизиты.Контрагент,
	|	Реквизиты.ДоговорКонтрагента,
	|	Реквизиты.ДокументОснование,
	|	ТаблицаАвансы.СтавкаНДС,
	|	Реквизиты.Дата,
	|	ДанныеПервичныхДокументов.Дата,
	|	ДанныеПервичныхДокументов.Номер,
	|	ВЫБОР
	|		КОГДА Реквизиты.ИсправлениеСобственнойОшибки
	|				И КОНЕЦПЕРИОДА(Реквизиты.Дата, КВАРТАЛ) > КОНЕЦПЕРИОДА(&ДатаИсходногоСчетаФактуры, КВАРТАЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.ИсправлениеСобственнойОшибки
	|				И КОНЕЦПЕРИОДА(Реквизиты.Дата, КВАРТАЛ) > КОНЕЦПЕРИОДА(&ДатаИсходногоСчетаФактуры, КВАРТАЛ)
	|			ТОГДА НАЧАЛОПЕРИОДА(&ДатаИсходногоСчетаФактуры, КВАРТАЛ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.Исправление
	|				ИЛИ Реквизиты.ИсправлениеСобственнойОшибки
	|			ТОГДА Реквизиты.Ссылка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.Дата < ДАТАВРЕМЯ(2015, 1, 1)
	|			ТОГДА """"
	|		ИНАЧЕ Реквизиты.КодВидаОперации
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Реквизиты.Контрагент,
	|	Реквизиты.ДоговорКонтрагента,
	|	Реквизиты.ДокументОснование,
	|	ТаблицаАвансы.СтавкаНДС,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСпоАвансамИПредоплатамВыданным),
	|	ВЫБОР
	|		КОГДА Реквизиты.ИсправлениеСобственнойОшибки
	|				И КОНЕЦПЕРИОДА(Реквизиты.Дата, КВАРТАЛ) > КОНЕЦПЕРИОДА(&ДатаИсходногоСчетаФактуры, КВАРТАЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.ИсправлениеСобственнойОшибки
	|				И КОНЕЦПЕРИОДА(Реквизиты.Дата, КВАРТАЛ) > КОНЕЦПЕРИОДА(&ДатаИсходногоСчетаФактуры, КВАРТАЛ)
	|			ТОГДА НАЧАЛОПЕРИОДА(&ДатаИсходногоСчетаФактуры, КВАРТАЛ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ,
	|	Реквизиты.Дата,
	|	ВЫБОР
	|		КОГДА Реквизиты.Исправление
	|				ИЛИ Реквизиты.ИсправлениеСобственнойОшибки
	|			ТОГДА Реквизиты.Ссылка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	СУММА(ТаблицаАвансы.СуммаНДС),
	|	СУММА(ТаблицаАвансы.Сумма - ТаблицаАвансы.СуммаНДС),
	|	ДАТАВРЕМЯ(1, 1, 1),
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА Реквизиты.Дата < ДАТАВРЕМЯ(2015, 1, 1)
	|			ТОГДА """"
	|		ИНАЧЕ Реквизиты.КодВидаОперации
	|	КОНЕЦ
	|ИЗ
	|	Документ.СчетФактураПолученный.Авансы КАК ТаблицаАвансы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО (ИСТИНА)
	|ГДЕ
	|	ТаблицаАвансы.Ссылка = &Ссылка
	|	И Реквизиты.СводныйСчетФактураКомиссионераПо1279
	|
	|СГРУППИРОВАТЬ ПО
	|	Реквизиты.Контрагент,
	|	Реквизиты.ДоговорКонтрагента,
	|	Реквизиты.ДокументОснование,
	|	ТаблицаАвансы.СтавкаНДС,
	|	Реквизиты.Дата,
	|	ВЫБОР
	|		КОГДА Реквизиты.ИсправлениеСобственнойОшибки
	|				И КОНЕЦПЕРИОДА(Реквизиты.Дата, КВАРТАЛ) > КОНЕЦПЕРИОДА(&ДатаИсходногоСчетаФактуры, КВАРТАЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.ИсправлениеСобственнойОшибки
	|				И КОНЕЦПЕРИОДА(Реквизиты.Дата, КВАРТАЛ) > КОНЕЦПЕРИОДА(&ДатаИсходногоСчетаФактуры, КВАРТАЛ)
	|			ТОГДА НАЧАЛОПЕРИОДА(&ДатаИсходногоСчетаФактуры, КВАРТАЛ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.Исправление
	|				ИЛИ Реквизиты.ИсправлениеСобственнойОшибки
	|			ТОГДА Реквизиты.Ссылка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.Дата < ДАТАВРЕМЯ(2015, 1, 1)
	|			ТОГДА """"
	|		ИНАЧЕ Реквизиты.КодВидаОперации
	|	КОНЕЦ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Реквизиты.Контрагент,
	|	Реквизиты.ДоговорКонтрагента,
	|	Реквизиты.ДокументОснование,
	|	НЕОПРЕДЕЛЕНО,
	|	ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.НДСпоАвансамИПредоплатамВыданным),
	|	ВЫБОР
	|		КОГДА Реквизиты.ИсправлениеСобственнойОшибки
	|				И КОНЕЦПЕРИОДА(Реквизиты.Дата, КВАРТАЛ) > КОНЕЦПЕРИОДА(&ДатаИсходногоСчетаФактуры, КВАРТАЛ)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.ИсправлениеСобственнойОшибки
	|				И КОНЕЦПЕРИОДА(Реквизиты.Дата, КВАРТАЛ) > КОНЕЦПЕРИОДА(&ДатаИсходногоСчетаФактуры, КВАРТАЛ)
	|			ТОГДА НАЧАЛОПЕРИОДА(&ДатаИсходногоСчетаФактуры, КВАРТАЛ)
	|		ИНАЧЕ ДАТАВРЕМЯ(1, 1, 1)
	|	КОНЕЦ,
	|	Реквизиты.Дата,
	|	ВЫБОР
	|		КОГДА Реквизиты.Исправление
	|				ИЛИ Реквизиты.ИсправлениеСобственнойОшибки
	|			ТОГДА Реквизиты.Ссылка
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	0,
	|	0,
	|	ПлатежноРасчетныеДокументы.ДатаДокумента,
	|	ПлатежноРасчетныеДокументы.НомерДокумента,
	|	ВЫБОР
	|		КОГДА Реквизиты.Дата < ДАТАВРЕМЯ(2015, 1, 1)
	|			ТОГДА """"
	|		ИНАЧЕ Реквизиты.КодВидаОперации
	|	КОНЕЦ
	|ИЗ
	|	Документ.СчетФактураПолученный.Авансы КАК ТаблицаАвансы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный.ПлатежноРасчетныеДокументы КАК ПлатежноРасчетныеДокументы
	|		ПО (ПлатежноРасчетныеДокументы.Ссылка = ТаблицаАвансы.Ссылка)
	|ГДЕ
	|	ТаблицаАвансы.Ссылка = &Ссылка
	|	И Реквизиты.СводныйСчетФактураКомиссионераПо1279";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();

КонецФункции

Функция ТекстЗапросаЖурналУчетаСчетовФактур(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	Если (НЕ Реквизиты.ПлательщикНДС И НЕ Реквизиты.ВедетсяУчетНДСПоФЗ134)
		ИЛИ Реквизиты.ВерсияНДС = 1
		ИЛИ Реквизиты.БланкСтрогойОтчетности 
		ИЛИ Реквизиты.ИностранныйСчетФактура Тогда
		ПараметрыПроведения.Вставить("ЗаписьЖурналаПоступлениеАванс",             Неопределено);
		ПараметрыПроведения.Вставить("ЗаписьЖурналаКорректировка",                Неопределено);
		ПараметрыПроведения.Вставить("ЗаписьЖурналаИсправлениеСобственнойОшибки", Неопределено);
		Возврат "";
	КонецЕсли;
	
	ТекстЗапроса = "";
	
	Если НЕ Реквизиты.ИспользуетсяПостановление1137 Тогда
		
		ПараметрыПроведения.Вставить("ЗаписьЖурналаПоступлениеАванс", Неопределено);
		ПараметрыПроведения.Вставить("ЗаписьЖурналаКорректировка",    Неопределено);
		
	ИначеЕсли Реквизиты.СводныйСчетФактураКомитентаПо1279 Тогда
		
		Если Реквизиты.ВидСчетаФактуры <> Перечисления.ВидСчетаФактурыПолученного.Корректировочный Тогда
			
			ПараметрыПроведения.Вставить("ЗаписьЖурналаКорректировка", Неопределено);
			
			НомераТаблиц.Вставить("ВременнаяТаблицаСчетаФактурыВыданныеПокупателям", НомераТаблиц.Количество());
			НомераТаблиц.Вставить("ЗаписьЖурналаПоступлениеАванс", НомераТаблиц.Количество());
			
			ТекстЗапроса = ТекстЗапросаДляЖурналаСводныйСчетФактураКомитента();
			
		Иначе
			
			ПараметрыПроведения.Вставить("ЗаписьЖурналаПоступлениеАванс", Неопределено);
			
			НомераТаблиц.Вставить("ВременнаяТаблицаСчетаФактурыВыданныеПокупателям", НомераТаблиц.Количество());
			НомераТаблиц.Вставить("ЗаписьЖурналаКорректировка", НомераТаблиц.Количество());
			
			ТекстЗапроса = ТекстЗапросаДляЖурналаСводныйСчетФактураКомитентаКорректировочный();
			
		КонецЕсли;
	
	ИначеЕсли Реквизиты.ВидСчетаФактуры <> Перечисления.ВидСчетаФактурыПолученного.Корректировочный Тогда
		
		ПараметрыПроведения.Вставить("ЗаписьЖурналаКорректировка", Неопределено);
		
		НомераТаблиц.Вставить("ВременнаяТаблицаПродавцы",           НомераТаблиц.Количество());
		НомераТаблиц.Вставить("ВременнаяТаблицаДокументыОснования", НомераТаблиц.Количество());
		НомераТаблиц.Вставить("ВТ_РублевыеСуммыДокументовВВалюте",  НомераТаблиц.Количество());
		НомераТаблиц.Вставить("ЗаписьЖурналаПоступлениеАванс",      НомераТаблиц.Количество());
		
		ТекстЗапроса = ТекстЗапросаДляЖурнала();
		
	Иначе
		
		ПараметрыПроведения.Вставить("ЗаписьЖурналаПоступлениеАванс", Неопределено);
		
		НомераТаблиц.Вставить("ВременнаяТаблицаПродавцы",                         НомераТаблиц.Количество());
		НомераТаблиц.Вставить("ВТ_ДокументыОснования",                            НомераТаблиц.Количество());
		НомераТаблиц.Вставить("ВТ_РублевыеСуммыДокументовВВалютеПредварительная", НомераТаблиц.Количество());
		НомераТаблиц.Вставить("ВТ_РублевыеСуммыДокументовВВалюте",                НомераТаблиц.Количество());
		НомераТаблиц.Вставить("ЗаписьЖурналаКорректировка",                       НомераТаблиц.Количество());
		
		ТекстЗапроса = ТекстЗапросаДляЖурналаКорректировочный();
		
	КонецЕсли;
	
	Если Реквизиты.ИсправлениеСобственнойОшибки
		И Реквизиты.ЕстьКомиссия Тогда 
		
		НомераТаблиц.Вставить("ВТ_СчетаФактурыВыданныеПоТекущемуСФ",                 НомераТаблиц.Количество());
		НомераТаблиц.Вставить("ВТ_СчетаФактурыВыданныеПоИсправляемомуСФ",            НомераТаблиц.Количество());
		НомераТаблиц.Вставить("ВТ_СчетаФактурыВыданные",                             НомераТаблиц.Количество());
		НомераТаблиц.Вставить("ВТ_ДвиженияНоваяЗаписьПовторноеИсправление",          НомераТаблиц.Количество());
		НомераТаблиц.Вставить("ВТ_ДвиженияНоваяЗаписьПервичноеИсправление",          НомераТаблиц.Количество());
		НомераТаблиц.Вставить("ВТ_ДвиженияНоваяЗаписьВыставленныеСФПредварительная", НомераТаблиц.Количество());
		НомераТаблиц.Вставить("ВТ_ПоследнийРегистраторПоСчетуФактуреВыданному",      НомераТаблиц.Количество());
		
		НомераТаблиц.Вставить("ВТ_ДвиженияСторно",                                      НомераТаблиц.Количество());
		НомераТаблиц.Вставить("ВТ_ДвиженияНоваяЗаписьВыставленныеСФ",                   НомераТаблиц.Количество());
		НомераТаблиц.Вставить("ВТ_СуммыПоСчетамФактурамПолученным",                     НомераТаблиц.Количество());
		НомераТаблиц.Вставить("ВТ_ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным", НомераТаблиц.Количество());
		НомераТаблиц.Вставить("ЗаписьЖурналаИсправлениеСобственнойОшибки",              НомераТаблиц.Количество());
		ТекстЗапроса = ТекстЗапроса + ТекстЗапросаИсправлениеСобственнойОшибки();
		
	Иначе
		ПараметрыПроведения.Вставить("ЗаписьЖурналаИсправлениеСобственнойОшибки", Неопределено);
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаДляЖурналаСводныйСчетФактураКомитента()
	
	Возврат "ВЫБРАТЬ
	|	СУММА(СчетаФактурыВыданныеПокупателям.Сумма) КАК Сумма,
	|	СУММА(СчетаФактурыВыданныеПокупателям.НДС) КАК НДС,
	|	МИНИМУМ(СчетаФактурыВыданныеПокупателям.НомерСтроки) КАК НомерСтроки,
	|	СчетаФактурыВыданныеПокупателям.Субкомиссионер,
	|	СчетаФактурыВыданныеПокупателям.СчетФактура,
	|	СчетФактураВыданный.СчетФактураБезНДС
	|ПОМЕСТИТЬ СчетаФактурыВыданныеПокупателям
	|ИЗ
	|	Документ.СчетФактураПолученный.СчетаФактурыВыданныеПокупателям КАК СчетаФактурыВыданныеПокупателям
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО СчетаФактурыВыданныеПокупателям.СчетФактура = СчетФактураВыданный.Ссылка
	|ГДЕ
	|	СчетаФактурыВыданныеПокупателям.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетаФактурыВыданныеПокупателям.Субкомиссионер,
	|	СчетаФактурыВыданныеПокупателям.СчетФактура,
	|	СчетФактураВыданный.СчетФактураБезНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Организация,
	|	Реквизиты.Контрагент,
	|	Реквизиты.КППКонтрагента,
	|	ВЫБОР
	|		КОГДА Реквизиты.Продавец = Реквизиты.Контрагент
	|				ИЛИ Реквизиты.Продавец = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Реквизиты.Продавец
	|	КОНЕЦ КАК Продавец,
	|	Реквизиты.Ссылка КАК СчетФактура,
	|	ЗНАЧЕНИЕ(Перечисление.ЧастиЖурналаУчетаСчетовФактур.ПолученныеСчетаФактуры) КАК ЧастьЖурнала,
	|	Реквизиты.Дата КАК ДатаВыставленияПолучения,
	|	Реквизиты.КодСпособаПолучения КАК КодСпособаВыставленияПолучения,
	|	Реквизиты.КодВидаОперации КАК КодВидаОперации,
	|	Реквизиты.НомерВходящегоДокумента КАК НомерСчетаФактуры,
	|	Реквизиты.ДатаВходящегоДокумента КАК ДатаСчетаФактуры,
	|	НЕОПРЕДЕЛЕНО КАК НомерКорректировочногоСчетаФактуры,
	|	НЕОПРЕДЕЛЕНО КАК ДатаКорректировочногоСчетаФактуры,
	|	ВЫБОР
	|		КОГДА Реквизиты.Исправление
	|			ТОГДА Реквизиты.НомерИсправления
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК НомерИсправления,
	|	ВЫБОР
	|		КОГДА Реквизиты.Исправление
	|			ТОГДА Реквизиты.ДатаИсправления
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ДатаИсправления,
	|	ВЫБОР
	|		КОГДА Реквизиты.ВалютаДокумента <> &ВалютаРеглУчета
	|				И Реквизиты.РасчетыВУсловныхЕдиницах
	|			ТОГДА &ВалютаРеглУчета
	|		ИНАЧЕ Реквизиты.ВалютаДокумента
	|	КОНЕЦ КАК Валюта,
	|	СчетаФактурыВыданныеПокупателям.Сумма КАК СуммаПоСчетуФактуре,
	|	СчетаФактурыВыданныеПокупателям.Сумма КАК СуммаПоСчетуФактуреКомиссия,
	|	СчетаФактурыВыданныеПокупателям.НДС КАК СуммаНДС,
	|	СчетаФактурыВыданныеПокупателям.НДС КАК СуммаНДСКомиссия,
	|	0 КАК СуммаПоСчетуФактуреРазницаУвеличение,
	|	0 КАК СуммаПоСчетуФактуреРазницаУменьшение,
	|	0 КАК СуммаНДСРазницаУвеличение,
	|	0 КАК СуммаНДСРазницаУменьшение,
	|	0 КАК СуммаПоСчетуФактуреРазницаУвеличениеКомиссия,
	|	0 КАК СуммаПоСчетуФактуреРазницаУменьшениеКомиссия,
	|	0 КАК СуммаНДСРазницаУвеличениеКомиссия,
	|	0 КАК СуммаНДСРазницаУменьшениеКомиссия,
	|	СчетаФактурыВыданныеПокупателям.СчетФактураБезНДС КАК ПоСтавкеБезНДС,
	|	НЕОПРЕДЕЛЕНО КАК СчетФактураНеВыставляется,
	|	Реквизиты.РасчетыВУсловныхЕдиницах,
	|	НЕОПРЕДЕЛЕНО КАК НомерИсправленияКорректировочногоСчетаФактуры,
	|	НЕОПРЕДЕЛЕНО КАК ДатаИсправленияКорректировочногоСчетаФактуры,
	|	0 КАК ИндексСтроки,
	|	НЕОПРЕДЕЛЕНО КАК ДокументОснование,
	|	СчетаФактурыВыданныеПокупателям.Субкомиссионер КАК Субкомиссионер,
	|	СчетаФактурыВыданныеПокупателям.СчетФактура КАК СчетФактураВыданныйПокупателю,
	|	2 КАК КодВидаСделки,
	|	НЕОПРЕДЕЛЕНО КАК Посредник,
	|	НЕОПРЕДЕЛЕНО КАК НомерСчетаФактурыПродавца,
	|	НЕОПРЕДЕЛЕНО КАК КодВидаОперацииКомиссия,
	|	Реквизиты.КодВидаОперацииНаУменьшение КАК КодВидаОперацииНаУменьшение,
	|	Реквизиты.ИсправлениеСобственнойОшибки,
	|	Реквизиты.ИсправляемыйСчетФактура,
	|	Реквизиты.ИННКонтрагента,
	|	ЛОЖЬ КАК Сторно,
	|	ЗНАЧЕНИЕ(Документ.СчетФактураПолученный.ПустаяСсылка) КАК СчетФактураПолученныйОтПродавца,
	|	ЗНАЧЕНИЕ(Документ.счетФактураПолученный.ПустаяСсылка) КАК ИсправленныйСчетФактура,
	|	"""" КАК ИННПродавца,
	|	"""" КАК КПППродавца,
	|	"""" КАК ИННСубкомиссионера,
	|	"""" КАК КППСубкомиссионера
	|ИЗ
	|	Реквизиты КАК Реквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаФактурыВыданныеПокупателям КАК СчетаФактурыВыданныеПокупателям
	|		ПО (ИСТИНА)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИндексСтроки"
	+ ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаДляЖурналаСводныйСчетФактураКомитентаКорректировочный()
	
	Возврат "ВЫБРАТЬ
	|	СУММА(СчетаФактурыВыданныеПокупателям.Сумма) КАК Сумма,
	|	СУММА(СчетаФактурыВыданныеПокупателям.НДС) КАК НДС,
	|	МИНИМУМ(СчетаФактурыВыданныеПокупателям.НомерСтроки) КАК НомерСтроки,
	|	СчетаФактурыВыданныеПокупателям.Субкомиссионер,
	|	СчетаФактурыВыданныеПокупателям.СчетФактура,
	|	СУММА(СчетаФактурыВыданныеПокупателям.СуммаУвеличение) КАК СуммаУвеличение,
	|	СУММА(СчетаФактурыВыданныеПокупателям.СуммаУменьшение) КАК СуммаУменьшение,
	|	СУММА(СчетаФактурыВыданныеПокупателям.СуммаНДСУвеличение) КАК СуммаНДСУвеличение,
	|	СУММА(СчетаФактурыВыданныеПокупателям.СуммаНДСУменьшение) КАК СуммаНДСУменьшение,
	|	СчетаФактурыВыданныеПокупателям.Ссылка.НомерИсходногоДокумента,
	|	СчетаФактурыВыданныеПокупателям.Ссылка.ДатаИсходногоДокумента,
	|	СчетФактураВыданный.СчетФактураБезНДС
	|ПОМЕСТИТЬ СчетаФактурыВыданныеПокупателям
	|ИЗ
	|	Документ.СчетФактураПолученный.СчетаФактурыВыданныеПокупателям КАК СчетаФактурыВыданныеПокупателям
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
	|		ПО СчетаФактурыВыданныеПокупателям.СчетФактура = СчетФактураВыданный.Ссылка
	|ГДЕ
	|	СчетаФактурыВыданныеПокупателям.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетаФактурыВыданныеПокупателям.Субкомиссионер,
	|	СчетаФактурыВыданныеПокупателям.СчетФактура,
	|	СчетаФактурыВыданныеПокупателям.Ссылка.НомерИсходногоДокумента,
	|	СчетаФактурыВыданныеПокупателям.Ссылка.ДатаИсходногоДокумента,
	|	СчетФактураВыданный.СчетФактураБезНДС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Организация,
	|	Реквизиты.Контрагент,
	|	Реквизиты.КППКонтрагента,
	|	ВЫБОР
	|		КОГДА Реквизиты.Продавец = Реквизиты.Контрагент
	|				ИЛИ Реквизиты.Продавец = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Реквизиты.Продавец
	|	КОНЕЦ КАК Продавец,
	|	Реквизиты.Ссылка КАК СчетФактура,
	|	ЗНАЧЕНИЕ(Перечисление.ЧастиЖурналаУчетаСчетовФактур.ПолученныеСчетаФактуры) КАК ЧастьЖурнала,
	|	Реквизиты.Дата КАК ДатаВыставленияПолучения,
	|	Реквизиты.КодСпособаПолучения КАК КодСпособаВыставленияПолучения,
	|	Реквизиты.КодВидаОперации КАК КодВидаОперации,
	|	СчетаФактурыВыданныеПокупателям.НомерИсходногоДокумента КАК НомерСчетаФактуры,
	|	СчетаФактурыВыданныеПокупателям.ДатаИсходногоДокумента КАК ДатаСчетаФактуры,
	|	Реквизиты.НомерВходящегоДокумента КАК НомерКорректировочногоСчетаФактуры,
	|	Реквизиты.ДатаВходящегоДокумента КАК ДатаКорректировочногоСчетаФактуры,
	|	ВЫБОР
	|		КОГДА Реквизиты.Исправление
	|			ТОГДА Реквизиты.НомерИсправления
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК НомерИсправления,
	|	ВЫБОР
	|		КОГДА Реквизиты.Исправление
	|			ТОГДА Реквизиты.ДатаИсправления
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ДатаИсправления,
	|	ВЫБОР
	|		КОГДА Реквизиты.ВалютаДокумента <> &ВалютаРеглУчета
	|				И Реквизиты.РасчетыВУсловныхЕдиницах
	|			ТОГДА &ВалютаРеглУчета
	|		ИНАЧЕ Реквизиты.ВалютаДокумента
	|	КОНЕЦ КАК Валюта,
	|	0 КАК СуммаПоСчетуФактуре,
	|	0 КАК СуммаПоСчетуФактуреКомиссия,
	|	0 КАК СуммаНДС,
	|	0 КАК СуммаНДСКомиссия,
	|	СчетаФактурыВыданныеПокупателям.СуммаУвеличение КАК СуммаПоСчетуФактуреРазницаУвеличение,
	|	СчетаФактурыВыданныеПокупателям.СуммаУменьшение КАК СуммаПоСчетуФактуреРазницаУменьшение,
	|	СчетаФактурыВыданныеПокупателям.СуммаНДСУвеличение КАК СуммаНДСРазницаУвеличение,
	|	СчетаФактурыВыданныеПокупателям.СуммаНДСУменьшение КАК СуммаНДСРазницаУменьшение,
	|	СчетаФактурыВыданныеПокупателям.СуммаУвеличение КАК СуммаПоСчетуФактуреРазницаУвеличениеКомиссия,
	|	СчетаФактурыВыданныеПокупателям.СуммаУменьшение КАК СуммаПоСчетуФактуреРазницаУменьшениеКомиссия,
	|	СчетаФактурыВыданныеПокупателям.СуммаНДСУвеличение КАК СуммаНДСРазницаУвеличениеКомиссия,
	|	СчетаФактурыВыданныеПокупателям.СуммаНДСУменьшение КАК СуммаНДСРазницаУменьшениеКомиссия,
	|	СчетаФактурыВыданныеПокупателям.СчетФактураБезНДС КАК ПоСтавкеБезНДС,
	|	НЕОПРЕДЕЛЕНО КАК СчетФактураНеВыставляется,
	|	Реквизиты.РасчетыВУсловныхЕдиницах,
	|	НЕОПРЕДЕЛЕНО КАК НомерИсправленияКорректировочногоСчетаФактуры,
	|	НЕОПРЕДЕЛЕНО КАК ДатаИсправленияКорректировочногоСчетаФактуры,
	|	0 КАК ИндексСтроки,
	|	НЕОПРЕДЕЛЕНО КАК ДокументОснование,
	|	СчетаФактурыВыданныеПокупателям.Субкомиссионер КАК Субкомиссионер,
	|	СчетаФактурыВыданныеПокупателям.СчетФактура КАК СчетФактураВыданныйПокупателю,
	|	2 КАК КодВидаСделки,
	|	НЕОПРЕДЕЛЕНО КАК Посредник,
	|	НЕОПРЕДЕЛЕНО КАК НомерСчетаФактурыПродавца,
	|	НЕОПРЕДЕЛЕНО КАК КодВидаОперацииКомиссия,
	|	Реквизиты.КодВидаОперацииНаУменьшение КАК КодВидаОперацииНаУменьшение,
	|	Реквизиты.ИсправлениеСобственнойОшибки,
	|	Реквизиты.ИсправляемыйСчетФактура,
	|	Реквизиты.ИННКонтрагента,
	|	ЛОЖЬ КАК Сторно,
	|	ЗНАЧЕНИЕ(Документ.СчетФактураПолученный.ПустаяСсылка) КАК СчетФактураПолученныйОтПродавца,
	|	ЗНАЧЕНИЕ(Документ.СчетФактураПолученный.ПустаяСсылка) КАК ИсправленныйСчетФактура,
	|	"""" КАК ИННПродавца,
	|	"""" КАК КПППродавца,
	|	"""" КАК ИННСубкомиссионера,
	|	"""" КАК КППСубкомиссионера
	|ИЗ
	|	Реквизиты КАК Реквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ СчетаФактурыВыданныеПокупателям КАК СчетаФактурыВыданныеПокупателям
	|		ПО (ИСТИНА)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИндексСтроки"
	+ ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
			
КонецФункции

Функция ТекстЗапросаДляЖурналаКорректировочный()
	
	Возврат "ВЫБРАТЬ
	|	СчетФактураПолученныйПродавцы.Продавец,
	|	МИНИМУМ(СчетФактураПолученныйПродавцы.НомерСтроки) КАК НомерСтроки,
	|	СчетФактураПолученныйПродавцы.ИННПродавца,
	|	СчетФактураПолученныйПродавцы.КПППродавца
	|ПОМЕСТИТЬ ВременнаяТаблицаПродавцы
	|ИЗ
	|	Документ.СчетФактураПолученный.Продавцы КАК СчетФактураПолученныйПродавцы
	|ГДЕ
	|	СчетФактураПолученныйПродавцы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетФактураПолученныйПродавцы.Продавец,
	|	СчетФактураПолученныйПродавцы.ИННПродавца,
	|	СчетФактураПолученныйПродавцы.КПППродавца
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетФактураПолученныйДокументыОснования.ДокументОснование КАК ДокументОснование,
	|	СчетФактураПолученныйДокументыОснования.НомерИсходногоДокумента,
	|	СчетФактураПолученныйДокументыОснования.ДатаИсходногоДокумента,
	|	СчетФактураПолученныйДокументыОснования.УчитыватьИсправлениеИсходногоДокумента,
	|	СчетФактураПолученныйДокументыОснования.НомерИсправленияИсходногоДокумента,
	|	СчетФактураПолученныйДокументыОснования.ДатаИсправленияИсходногоДокумента,
	|	СчетФактураПолученныйДокументыОснования.СуммаУвеличение,
	|	СчетФактураПолученныйДокументыОснования.СуммаУменьшение,
	|	СчетФактураПолученныйДокументыОснования.СуммаНДСУвеличение,
	|	СчетФактураПолученныйДокументыОснования.СуммаНДСУменьшение,
	|	СчетФактураПолученныйДокументыОснования.НомерСтроки
	|ПОМЕСТИТЬ ВременнаяТаблицаДокументыОснования
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	|ГДЕ
	|	СчетФактураПолученныйДокументыОснования.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.Регистратор,
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента,
	|	СУММА(РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего) КАК РазницаВсегоРуб,
	|	СУММА(РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС) КАК РазницаНДСРуб
	|ПОМЕСТИТЬ РегистрСведенийРублевыеСуммыДокументовВВалютеПредварительная
	|ИЗ
	|	РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаДокументыОснования КАК ВременнаяТаблицаДокументыОснования
	|		ПО РегистрСведенийРублевыеСуммыДокументовВВалюте.Регистратор = ВременнаяТаблицаДокументыОснования.ДокументОснование
	|
	|СГРУППИРОВАТЬ ПО
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.Регистратор,
	|	РегистрСведенийРублевыеСуммыДокументовВВалюте.НомерСтрокиДокумента
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрСведенийРублевыеСуммыДокументовВВалютеПредварительная.Регистратор,
	|	СУММА(ВЫБОР
	|			КОГДА РегистрСведенийРублевыеСуммыДокументовВВалютеПредварительная.РазницаВсегоРуб < 0
	|				ТОГДА РегистрСведенийРублевыеСуммыДокументовВВалютеПредварительная.РазницаВсегоРуб * -1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаУменьшения,
	|	СУММА(ВЫБОР
	|			КОГДА РегистрСведенийРублевыеСуммыДокументовВВалютеПредварительная.РазницаВсегоРуб > 0
	|				ТОГДА РегистрСведенийРублевыеСуммыДокументовВВалютеПредварительная.РазницаВсегоРуб
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаУвеличения,
	|	СУММА(ВЫБОР
	|			КОГДА РегистрСведенийРублевыеСуммыДокументовВВалютеПредварительная.РазницаНДСРуб < 0
	|				ТОГДА РегистрСведенийРублевыеСуммыДокументовВВалютеПредварительная.РазницаНДСРуб * -1
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаНДСУменьшения,
	|	СУММА(ВЫБОР
	|			КОГДА РегистрСведенийРублевыеСуммыДокументовВВалютеПредварительная.РазницаНДСРуб > 0
	|				ТОГДА РегистрСведенийРублевыеСуммыДокументовВВалютеПредварительная.РазницаНДСРуб
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК СуммаНДСУвеличения
	|ПОМЕСТИТЬ РегистрСведенийРублевыеСуммыДокументовВВалюте
	|ИЗ
	|	РегистрСведенийРублевыеСуммыДокументовВВалютеПредварительная КАК РегистрСведенийРублевыеСуммыДокументовВВалютеПредварительная
	|
	|СГРУППИРОВАТЬ ПО
	|	РегистрСведенийРублевыеСуммыДокументовВВалютеПредварительная.Регистратор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РегистрСведенийРублевыеСуммыДокументовВВалютеПредварительная.Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Организация,
	|	Реквизиты.Контрагент,
	|	Реквизиты.КППКонтрагента,
	|	ВЫБОР
	|		КОГДА Реквизиты.Продавец = Реквизиты.Контрагент
	|				ИЛИ Реквизиты.Продавец = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Реквизиты.Продавец
	|	КОНЕЦ КАК Продавец,
	|	Реквизиты.Ссылка КАК СчетФактура,
	|	ЗНАЧЕНИЕ(Перечисление.ЧастиЖурналаУчетаСчетовФактур.ПолученныеСчетаФактуры) КАК ЧастьЖурнала,
	|	Реквизиты.Дата КАК ДатаВыставленияПолучения,
	|	Реквизиты.КодСпособаПолучения КАК КодСпособаВыставленияПолучения,
	|	Реквизиты.КодВидаОперации КАК КодВидаОперации,
	|	Основания.ДокументОснование КАК ДокументОснование,
	|	Основания.НомерИсходногоДокумента КАК НомерСчетаФактуры,
	|	Основания.ДатаИсходногоДокумента КАК ДатаСчетаФактуры,
	|	Реквизиты.НомерВходящегоДокумента КАК НомерКорректировочногоСчетаФактуры,
	|	Реквизиты.ДатаВходящегоДокумента КАК ДатаКорректировочногоСчетаФактуры,
	|	Основания.УчитыватьИсправлениеИсходногоДокумента КАК Исправление,
	|	ВЫБОР
	|		КОГДА Основания.НомерИсправленияИсходногоДокумента <> 0
	|			ТОГДА Основания.НомерИсправленияИсходногоДокумента
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК НомерИсправления,
	|	Основания.ДатаИсправленияИсходногоДокумента КАК ДатаИсправления,
	|	ВЫБОР
	|		КОГДА НЕ Реквизиты.ВалютаДокумента = &ВалютаРеглУчета
	|				И Реквизиты.РасчетыВУсловныхЕдиницах
	|			ТОГДА &ВалютаРеглУчета
	|		ИНАЧЕ Реквизиты.ВалютаДокумента
	|	КОНЕЦ КАК Валюта,
	|	0 КАК СуммаПоСчетуФактуре,
	|	0 КАК СуммаНДС,
	|	0 КАК СуммаПоСчетуФактуреКомиссия,
	|	0 КАК СуммаНДСКомиссия,
	|	ВЫБОР
	|		КОГДА Реквизиты.ВалютаДокумента = &ВалютаРеглУчета
	|				ИЛИ НЕ Реквизиты.ВалютаДокумента = &ВалютаРеглУчета
	|					И НЕ Реквизиты.РасчетыВУсловныхЕдиницах
	|			ТОГДА Основания.СуммаУвеличение
	|		ИНАЧЕ ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.СуммаУвеличения, 0)
	|	КОНЕЦ КАК СуммаПоСчетуФактуреРазницаУвеличение,
	|	ВЫБОР
	|		КОГДА Реквизиты.ВалютаДокумента = &ВалютаРеглУчета
	|				ИЛИ НЕ Реквизиты.ВалютаДокумента = &ВалютаРеглУчета
	|					И НЕ Реквизиты.РасчетыВУсловныхЕдиницах
	|			ТОГДА Основания.СуммаУменьшение
	|		ИНАЧЕ ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.СуммаУменьшения, 0)
	|	КОНЕЦ КАК СуммаПоСчетуФактуреРазницаУменьшение,
	|	ВЫБОР
	|		КОГДА Реквизиты.ВалютаДокумента = &ВалютаРеглУчета
	|				ИЛИ НЕ Реквизиты.ВалютаДокумента = &ВалютаРеглУчета
	|					И НЕ Реквизиты.РасчетыВУсловныхЕдиницах
	|			ТОГДА Основания.СуммаНДСУвеличение
	|		ИНАЧЕ ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.СуммаНДСУвеличения, 0)
	|	КОНЕЦ КАК СуммаНДСРазницаУвеличение,
	|	ВЫБОР
	|		КОГДА Реквизиты.ВалютаДокумента = &ВалютаРеглУчета
	|				ИЛИ НЕ Реквизиты.ВалютаДокумента = &ВалютаРеглУчета
	|					И НЕ Реквизиты.РасчетыВУсловныхЕдиницах
	|			ТОГДА Основания.СуммаНДСУменьшение
	|		ИНАЧЕ ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.СуммаНДСУменьшения, 0)
	|	КОНЕЦ КАК СуммаНДСРазницаУменьшение,
	|	ВЫБОР
	|		КОГДА Реквизиты.СуммаУвеличениеКомиссия = 0
	|				ИЛИ Основания.СуммаУвеличение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Реквизиты.ВалютаДокумента = &ВалютаРеглУчета
	|						ИЛИ НЕ Реквизиты.ВалютаДокумента = &ВалютаРеглУчета
	|							И НЕ Реквизиты.РасчетыВУсловныхЕдиницах
	|					ТОГДА Реквизиты.СуммаУвеличениеКомиссия
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.СуммаУвеличения, 0) = 0
	|							ТОГДА Реквизиты.СуммаУвеличениеКомиссия
	|						ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.СуммаУвеличения / Основания.СуммаУвеличение * Реквизиты.СуммаУвеличениеКомиссия
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаПоСчетуФактуреРазницаУвеличениеКомиссия,
	|	ВЫБОР
	|		КОГДА Реквизиты.СуммаНДСУвеличениеКомиссия = 0
	|				ИЛИ Основания.СуммаНДСУвеличение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Реквизиты.ВалютаДокумента = &ВалютаРеглУчета
	|						ИЛИ НЕ Реквизиты.ВалютаДокумента = &ВалютаРеглУчета
	|							И НЕ Реквизиты.РасчетыВУсловныхЕдиницах
	|					ТОГДА Реквизиты.СуммаНДСУвеличениеКомиссия
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.СуммаНДСУвеличения, 0) = 0
	|							ТОГДА Реквизиты.СуммаНДСУвеличениеКомиссия
	|						ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.СуммаНДСУвеличения / Основания.СуммаНДСУвеличение * Реквизиты.СуммаНДСУвеличениеКомиссия
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаНДСРазницаУвеличениеКомиссия,
	|	ВЫБОР
	|		КОГДА Реквизиты.СуммаНДСУменьшениеКомиссия = 0
	|				ИЛИ Основания.СуммаНДСУменьшение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Реквизиты.ВалютаДокумента = &ВалютаРеглУчета
	|						ИЛИ НЕ Реквизиты.ВалютаДокумента = &ВалютаРеглУчета
	|							И НЕ Реквизиты.РасчетыВУсловныхЕдиницах
	|					ТОГДА Реквизиты.СуммаНДСУменьшениеКомиссия
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.СуммаНДСУменьшения, 0) = 0
	|							ТОГДА Реквизиты.СуммаНДСУменьшениеКомиссия
	|						ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.СуммаНДСУменьшения / Основания.СуммаНДСУменьшение * Реквизиты.СуммаНДСУменьшениеКомиссия
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаНДСРазницаУменьшениеКомиссия,
	|	ВЫБОР
	|		КОГДА Реквизиты.СуммаУменьшениеКомиссия = 0
	|				ИЛИ Основания.СуммаУменьшение = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Реквизиты.ВалютаДокумента = &ВалютаРеглУчета
	|						ИЛИ НЕ Реквизиты.ВалютаДокумента = &ВалютаРеглУчета
	|							И НЕ Реквизиты.РасчетыВУсловныхЕдиницах
	|					ТОГДА Реквизиты.СуммаУменьшениеКомиссия
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.СуммаУменьшения, 0) = 0
	|							ТОГДА Реквизиты.СуммаУменьшениеКомиссия
	|						ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.СуммаУменьшения / Основания.СуммаУменьшение * Реквизиты.СуммаУменьшениеКомиссия
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаПоСчетуФактуреРазницаУменьшениеКомиссия,
	|	Реквизиты.СчетФактураБезНДС КАК ПоСтавкеБезНДС,
	|	НЕОПРЕДЕЛЕНО КАК СчетФактураНеВыставляется,
	|	Реквизиты.РасчетыВУсловныхЕдиницах,
	|	ВЫБОР
	|		КОГДА Реквизиты.Исправление
	|			ТОГДА Реквизиты.НомерИсправления
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК НомерИсправленияКорректировочногоСчетаФактуры,
	|	ВЫБОР
	|		КОГДА Реквизиты.Исправление
	|			ТОГДА Реквизиты.ДатаИсправления
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ДатаИсправленияКорректировочногоСчетаФактуры,
	|	НЕОПРЕДЕЛЕНО КАК ИсходныйСчетФактура,
	|	Основания.НомерСтроки - 1 КАК ИндексСтроки,
	|	ВЫБОР
	|		КОГДА Реквизиты.РеализацияТоваровКомитента
	|			ТОГДА Реквизиты.Субкомиссионер
	|		КОГДА Реквизиты.Продавец <> Реквизиты.Контрагент
	|				И Реквизиты.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И Реквизиты.ЕстьКомиссия
	|			ТОГДА Реквизиты.Контрагент
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Субкомиссионер,
	|	ВЫБОР
	|		КОГДА Реквизиты.РеализацияТоваровКомитента
	|			ТОГДА Реквизиты.СчетФактураВыданныйПокупателю
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетФактураВыданныйПокупателю,
	|	ВЫБОР
	|		КОГДА Реквизиты.РеализацияТоваровКомитента
	|			ТОГДА 2
	|		КОГДА Реквизиты.ЕстьКомиссия
	|			ТОГДА 1
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КодВидаСделки,
	|	НЕОПРЕДЕЛЕНО КАК Посредник,
	|	НЕОПРЕДЕЛЕНО КАК НомерСчетаФактурыПродавца,
	|	НЕОПРЕДЕЛЕНО КАК КодВидаОперацииКомиссия,
	|	Реквизиты.ИсправлениеСобственнойОшибки,
	|	Реквизиты.ИсправляемыйСчетФактура,
	|	Реквизиты.ИННКонтрагента,
	|	ЛОЖЬ КАК Сторно,
	|	ЗНАЧЕНИЕ(Документ.СчетФактураПолученный.ПустаяСсылка) КАК СчетФактураПолученныйОтПродавца,
	|	ЗНАЧЕНИЕ(Документ.СчетФактураПолученный.ПустаяСсылка) КАК ИсправленныйсчетФактура,
	|	ЕСТЬNULL(ВременнаяТаблицаПродавцы.ИННПродавца, """") КАК ИННПродавца,
	|	ЕСТЬNULL(ВременнаяТаблицаПродавцы.КПППродавца, """") КАК КПППродавца,
	|	ВЫБОР
	|		КОГДА Реквизиты.Продавец <> Реквизиты.Контрагент
	|				И Реквизиты.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И Реквизиты.ЕстьКомиссия
	|			ТОГДА Реквизиты.ИННКонтрагента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ИННСубкомиссионера,
	|	ВЫБОР
	|		КОГДА Реквизиты.Продавец <> Реквизиты.Контрагент
	|				И Реквизиты.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И Реквизиты.ЕстьКомиссия
	|			ТОГДА Реквизиты.КППКонтрагента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КППСубкомиссионера,
	|	Реквизиты.КодВидаОперацииНаУменьшение
	|ИЗ
	|	ВременнаяТаблицаДокументыОснования КАК Основания
	|		ЛЕВОЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|		ПО Основания.ДокументОснование = РегистрСведенийРублевыеСуммыДокументовВВалюте.Регистратор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПродавцы КАК ВременнаяТаблицаПродавцы
	|		ПО (НЕ Реквизиты.СводныйСчетФактураКомиссионераПо1279)
	|			И (Реквизиты.Дата >= ДАТАВРЕМЯ(2015, 1, 1))"
	+ ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаДляЖурнала()
	
	Возврат
	"ВЫБРАТЬ
	|	СчетФактураПолученныйПродавцы.Продавец,
	|	МИНИМУМ(СчетФактураПолученныйПродавцы.НомерСтроки) КАК НомерСтроки,
	|	СчетФактураПолученныйПродавцы.ИННПродавца,
	|	СчетФактураПолученныйПродавцы.КПППродавца
	|ПОМЕСТИТЬ ВременнаяТаблицаПродавцы
	|ИЗ
	|	Документ.СчетФактураПолученный.Продавцы КАК СчетФактураПолученныйПродавцы
	|ГДЕ
	|	СчетФактураПолученныйПродавцы.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетФактураПолученныйПродавцы.Продавец,
	|	СчетФактураПолученныйПродавцы.ИННПродавца,
	|	СчетФактураПолученныйПродавцы.КПППродавца
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетФактураПолученныйДокументыОснования.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ ВременнаяТаблицаДокументыОснования
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	|ГДЕ
	|	СчетФактураПолученныйДокументыОснования.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего) КАК РазницаВсегоРуб,
	|	СУММА(РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС) КАК РазницаНДСРуб,
	|	СУММА(РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС) КАК РазницаНалоговаяБазаНДСРуб,
	|	СУММА(ВЫБОР
	|			КОГДА РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего > 0
	|				ТОГДА РегистрСведенийРублевыеСуммыДокументовВВалюте.Всего
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК ВсегоРуб,
	|	СУММА(ВЫБОР
	|			КОГДА РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС > 0
	|				ТОГДА РегистрСведенийРублевыеСуммыДокументовВВалюте.НДС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НДСРуб,
	|	СУММА(ВЫБОР
	|			КОГДА РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС > 0
	|				ТОГДА РегистрСведенийРублевыеСуммыДокументовВВалюте.НалоговаяБазаНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ) КАК НалоговаяБазаНДСРуб
	|ПОМЕСТИТЬ РегистрСведенийРублевыеСуммыДокументовВВалюте
	|ИЗ
	|	РегистрСведений.РублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаДокументыОснования КАК ВременнаяТаблицаДокументыОснования
	|		ПО РегистрСведенийРублевыеСуммыДокументовВВалюте.Регистратор = ВременнаяТаблицаДокументыОснования.ДокументОснование
	|ГДЕ
	|	НЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.ВозвратнаяТара)
	|	И НЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.ОплатаПоставщикам)
	|	И ВЫБОР
	|			КОГДА ВременнаяТаблицаДокументыОснования.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах
	|					И РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.ПустаяСсылка)
	|				ТОГДА ИСТИНА
	|			ИНАЧЕ ВЫБОР
	|					КОГДА НЕ ВременнаяТаблицаДокументыОснования.ДокументОснование ССЫЛКА Документ.ОтчетКомиссионераОПродажах
	|						ТОГДА ВЫБОР
	|								КОГДА ВременнаяТаблицаДокументыОснования.ДокументОснование ССЫЛКА Документ.ОтчетКомитентуОПродажах
	|										И РегистрСведенийРублевыеСуммыДокументовВВалюте.ТабличнаяЧастьДокумента = ЗНАЧЕНИЕ(Перечисление.ТабличныеЧастиДокументов.ПустаяСсылка)
	|									ТОГДА ЛОЖЬ
	|								ИНАЧЕ ИСТИНА
	|							КОНЕЦ
	|					ИНАЧЕ ЛОЖЬ
	|				КОНЕЦ
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Организация,
	|	Реквизиты.Контрагент,
	|	Реквизиты.КППКонтрагента,
	|	ВЫБОР
	|		КОГДА НЕ ВременнаяТаблицаПродавцы.Продавец ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВременнаяТаблицаПродавцы.Продавец = Реквизиты.Контрагент
	|						ТОГДА НЕОПРЕДЕЛЕНО
	|					ИНАЧЕ ВременнаяТаблицаПродавцы.Продавец
	|				КОНЕЦ
	|		КОГДА Реквизиты.Продавец = Реквизиты.Контрагент
	|				ИЛИ Реквизиты.Продавец = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				ИЛИ Реквизиты.СводныйСчетФактураКомиссионераПо1279
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ Реквизиты.Продавец
	|	КОНЕЦ КАК Продавец,
	|	Реквизиты.Ссылка КАК СчетФактура,
	|	ЗНАЧЕНИЕ(Перечисление.ЧастиЖурналаУчетаСчетовФактур.ПолученныеСчетаФактуры) КАК ЧастьЖурнала,
	|	Реквизиты.Дата КАК ДатаВыставленияПолучения,
	|	Реквизиты.КодСпособаПолучения КАК КодСпособаВыставленияПолучения,
	|	Реквизиты.КодВидаОперации КАК КодВидаОперации,
	|	Реквизиты.НомерВходящегоДокумента КАК НомерСчетаФактуры,
	|	Реквизиты.ДатаВходящегоДокумента КАК ДатаСчетаФактуры,
	|	НЕОПРЕДЕЛЕНО КАК НомерКорректировочногоСчетаФактуры,
	|	НЕОПРЕДЕЛЕНО КАК ДатаКорректировочногоСчетаФактуры,
	|	ВЫБОР
	|		КОГДА Реквизиты.Исправление
	|			ТОГДА Реквизиты.НомерИсправления
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК НомерИсправления,
	|	ВЫБОР
	|		КОГДА Реквизиты.Исправление
	|			ТОГДА Реквизиты.ДатаИсправления
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ДатаИсправления,
	|	ВЫБОР
	|		КОГДА Реквизиты.ВалютаДокумента <> &ВалютаРеглУчета
	|				И Реквизиты.РасчетыВУсловныхЕдиницах
	|			ТОГДА &ВалютаРеглУчета
	|		ИНАЧЕ Реквизиты.ВалютаДокумента
	|	КОНЕЦ КАК Валюта,
	|	ВЫБОР
	|		КОГДА Реквизиты.ВалютаДокумента <> &ВалютаРеглУчета
	|				И Реквизиты.РасчетыВУсловныхЕдиницах
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРуб, 0) = 0
	|						ТОГДА Реквизиты.СуммаДокумента
	|					ИНАЧЕ ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРуб, 0)
	|				КОНЕЦ
	|		ИНАЧЕ Реквизиты.СуммаДокумента
	|	КОНЕЦ КАК СуммаПоСчетуФактуре,
	|	ВЫБОР
	|		КОГДА Реквизиты.ВалютаДокумента <> &ВалютаРеглУчета
	|				И Реквизиты.РасчетыВУсловныхЕдиницах
	|			ТОГДА ВЫБОР
	|					КОГДА ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРуб, 0) = 0
	|						ТОГДА Реквизиты.СуммаНДСДокумента
	|					ИНАЧЕ ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРуб, 0)
	|				КОНЕЦ
	|		ИНАЧЕ Реквизиты.СуммаНДСДокумента
	|	КОНЕЦ КАК СуммаНДС,
	|	ВЫБОР
	|		КОГДА Реквизиты.СуммаНДСДокумента = 0
	|				ИЛИ Реквизиты.СуммаНДСДокументаКомиссия = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Реквизиты.ВалютаДокумента = &ВалютаРеглУчета
	|						ИЛИ НЕ Реквизиты.ВалютаДокумента = &ВалютаРеглУчета
	|							И НЕ Реквизиты.РасчетыВУсловныхЕдиницах
	|					ТОГДА Реквизиты.СуммаНДСДокументаКомиссия
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРуб, 0) = 0
	|							ТОГДА Реквизиты.СуммаНДСДокументаКомиссия
	|						ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.НДСРуб / Реквизиты.СуммаНДСДокумента * Реквизиты.СуммаНДСДокументаКомиссия
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаНДСКомиссия,
	|	ВЫБОР
	|		КОГДА Реквизиты.СуммаДокумента = 0
	|				ИЛИ Реквизиты.СуммаДокументаКомиссия = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА Реквизиты.ВалютаДокумента = &ВалютаРеглУчета
	|						ИЛИ НЕ Реквизиты.ВалютаДокумента = &ВалютаРеглУчета
	|							И НЕ Реквизиты.РасчетыВУсловныхЕдиницах
	|					ТОГДА Реквизиты.СуммаДокументаКомиссия
	|				ИНАЧЕ ВЫБОР
	|						КОГДА ЕСТЬNULL(РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРуб, 0) = 0
	|							ТОГДА Реквизиты.СуммаДокументаКомиссия
	|						ИНАЧЕ РегистрСведенийРублевыеСуммыДокументовВВалюте.ВсегоРуб / Реквизиты.СуммаДокумента * Реквизиты.СуммаДокументаКомиссия
	|					КОНЕЦ
	|			КОНЕЦ
	|	КОНЕЦ КАК СуммаПоСчетуФактуреКомиссия,
	|	0 КАК СуммаПоСчетуФактуреРазницаУвеличение,
	|	0 КАК СуммаПоСчетуФактуреРазницаУменьшение,
	|	0 КАК СуммаНДСРазницаУвеличение,
	|	0 КАК СуммаНДСРазницаУменьшение,
	|	0 КАК СуммаПоСчетуФактуреРазницаУвеличениеКомиссия,
	|	0 КАК СуммаПоСчетуФактуреРазницаУменьшениеКомиссия,
	|	0 КАК СуммаНДСРазницаУвеличениеКомиссия,
	|	0 КАК СуммаНДСРазницаУменьшениеКомиссия,
	|	Реквизиты.СчетФактураБезНДС КАК ПоСтавкеБезНДС,
	|	НЕОПРЕДЕЛЕНО КАК СчетФактураНеВыставляется,
	|	Реквизиты.РасчетыВУсловныхЕдиницах,
	|	НЕОПРЕДЕЛЕНО КАК НомерИсправленияКорректировочногоСчетаФактуры,
	|	НЕОПРЕДЕЛЕНО КАК ДатаИсправленияКорректировочногоСчетаФактуры,
	|	0 КАК ИндексСтроки,
	|	НЕОПРЕДЕЛЕНО КАК ДокументОснование,
	|	ВЫБОР
	|		КОГДА Реквизиты.РеализацияТоваровКомитента
	|			ТОГДА Реквизиты.Субкомиссионер
	|		КОГДА Реквизиты.Продавец <> Реквизиты.Контрагент
	|				И Реквизиты.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И Реквизиты.ЕстьКомиссия
	|			ТОГДА Реквизиты.Контрагент
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК Субкомиссионер,
	|	ВЫБОР
	|		КОГДА Реквизиты.РеализацияТоваровКомитента
	|				И НЕ Реквизиты.ИсправлениеСобственнойОшибки
	|			ТОГДА Реквизиты.СчетФактураВыданныйПокупателю
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СчетФактураВыданныйПокупателю,
	|	ВЫБОР
	|		КОГДА Реквизиты.РеализацияТоваровКомитента
	|			ТОГДА 2
	|		КОГДА Реквизиты.ЕстьКомиссия
	|			ТОГДА 1
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК КодВидаСделки,
	|	НЕОПРЕДЕЛЕНО КАК Посредник,
	|	НЕОПРЕДЕЛЕНО КАК НомерСчетаФактурыПродавца,
	|	НЕОПРЕДЕЛЕНО КАК КодВидаОперацииКомиссия,
	|	Реквизиты.ИсправлениеСобственнойОшибки,
	|	Реквизиты.ИсправляемыйСчетФактура,
	|	Реквизиты.ИННКонтрагента,
	|	ЛОЖЬ КАК Сторно,
	|	ЗНАЧЕНИЕ(Документ.СчетФактураПолученный.ПустаяСсылка) КАК СчетФактураПолученныйОтПродавца,
	|	ЗНАЧЕНИЕ(Документ.СчетФактураПолученный.ПустаяСсылка) КАК ИсправленныйСчетФактура,
	|	ЕСТЬNULL(ВременнаяТаблицаПродавцы.ИННПродавца, """") КАК ИННПродавца,
	|	ЕСТЬNULL(ВременнаяТаблицаПродавцы.КПППродавца, """") КАК КПППродавца,
	|	ВЫБОР
	|		КОГДА Реквизиты.Продавец <> Реквизиты.Контрагент
	|				И Реквизиты.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И Реквизиты.ЕстьКомиссия
	|			ТОГДА Реквизиты.ИННКонтрагента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ИННСубкомиссионера,
	|	ВЫБОР
	|		КОГДА Реквизиты.Продавец <> Реквизиты.Контрагент
	|				И Реквизиты.Продавец <> ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|				И Реквизиты.ЕстьКомиссия
	|			ТОГДА Реквизиты.КППКонтрагента
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК КППСубкомиссионера,
	|	Реквизиты.КодВидаОперацииНаУменьшение
	|ИЗ
	|	Реквизиты КАК Реквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведенийРублевыеСуммыДокументовВВалюте КАК РегистрСведенийРублевыеСуммыДокументовВВалюте
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПродавцы КАК ВременнаяТаблицаПродавцы
	|		ПО (НЕ Реквизиты.СводныйСчетФактураКомиссионераПо1279)
	|			И (Реквизиты.Дата >= ДАТАВРЕМЯ(2015, 1, 1))
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Реквизиты.Дата,
	|	Реквизиты.Ссылка,
	|	Реквизиты.Организация,
	|	Реквизиты.Контрагент,
	|	Реквизиты.КППКонтрагента,
	|	ВЫБОР
	|		КОГДА ТаблицаПродавцы.Продавец = Реквизиты.Контрагент
	|			ТОГДА НЕОПРЕДЕЛЕНО
	|		ИНАЧЕ ТаблицаПродавцы.Продавец
	|	КОНЕЦ,
	|	Реквизиты.Ссылка,
	|	ЗНАЧЕНИЕ(Перечисление.ЧастиЖурналаУчетаСчетовФактур.ПолученныеСчетаФактуры),
	|	Реквизиты.Дата,
	|	Реквизиты.КодСпособаПолучения,
	|	Реквизиты.КодВидаОперации,
	|	Реквизиты.НомерВходящегоДокумента,
	|	Реквизиты.ДатаВходящегоДокумента,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ВЫБОР
	|		КОГДА Реквизиты.Исправление
	|			ТОГДА Реквизиты.НомерИсправления
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.Исправление
	|			ТОГДА Реквизиты.ДатаИсправления
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА Реквизиты.ВалютаДокумента <> &ВалютаРеглУчета
	|				И Реквизиты.РасчетыВУсловныхЕдиницах
	|			ТОГДА &ВалютаРеглУчета
	|		ИНАЧЕ Реквизиты.ВалютаДокумента
	|	КОНЕЦ,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	0,
	|	Реквизиты.СчетФактураБезНДС,
	|	НЕОПРЕДЕЛЕНО,
	|	Реквизиты.РасчетыВУсловныхЕдиницах,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ТаблицаПродавцы.НомерСтроки,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	Реквизиты.ИсправлениеСобственнойОшибки,
	|	Реквизиты.ИсправляемыйСчетФактура,
	|	Реквизиты.ИННКонтрагента,
	|	ЛОЖЬ,
	|	ЗНАЧЕНИЕ(Документ.СчетФактураПолученный.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Документ.СчетФактураПолученный.ПустаяСсылка),
	|	ТаблицаПродавцы.ИННПродавца,
	|	ТаблицаПродавцы.КПППродавца,
	|	"""",
	|	"""",
	|	Реквизиты.КодВидаОперацииНаУменьшение
	|ИЗ
	|	Реквизиты КАК Реквизиты
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаПродавцы КАК ТаблицаПродавцы
	|		ПО (ИСТИНА)
	|ГДЕ
	|	Реквизиты.СводныйСчетФактураКомиссионераПо1279
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИндексСтроки"
	+ ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ТекстЗапросаИсправлениеСобственнойОшибки()
	
	// Подготавливаем сервисные временные таблицы.
	ТекстЗапросаПодготовительный =  "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.СчетФактура КАК СчетФактура
	|ПОМЕСТИТЬ СчетаФактурыВыданныеПоТекущемуСФ
	|ИЗ
	|	Документ.СчетФактураПолученный.СчетаФактурыВыданныеПокупателям КАК СчетФактураПолученныйСчетаФактурыВыданныеПокупателям
	|ГДЕ
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.Ссылка = &Ссылка
	|	И НЕ &ТолькоСторнироватьИсходныйСчетФактуру
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.СчетФактура КАК СчетФактура
	|ПОМЕСТИТЬ СчетаФактурыВыданныеПоИсправляемомуСФ
	|ИЗ
	|	Документ.СчетФактураПолученный.СчетаФактурыВыданныеПокупателям КАК СчетФактураПолученныйСчетаФактурыВыданныеПокупателям
	|ГДЕ
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.Ссылка = &ИсправляемыйСчетФактура
	|	И НЕ &ТолькоСторнироватьИсходныйСчетФактуру
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетаФактурыВыданныеПоТекущемуСФ.СчетФактура КАК СчетФактура
	|ПОМЕСТИТЬ СчетаФактурыВыданные
	|ИЗ
	|	СчетаФактурыВыданныеПоТекущемуСФ КАК СчетаФактурыВыданныеПоТекущемуСФ
	|ГДЕ
	|	НЕ &ТолькоСторнироватьИсходныйСчетФактуру
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетаФактурыВыданныеПоИсправляемомуСФ.СчетФактура
	|ИЗ
	|	СчетаФактурыВыданныеПоИсправляемомуСФ КАК СчетаФактурыВыданныеПоИсправляемомуСФ
	|ГДЕ
	|	НЕ СчетаФактурыВыданныеПоИсправляемомуСФ.СчетФактура В
	|				(ВЫБРАТЬ
	|					СчетаФактурыВыданныеПоТекущемуСФ.СчетФактура
	|				ИЗ
	|					СчетаФактурыВыданныеПоТекущемуСФ)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	МАКСИМУМ(ЖурналУчетаСчетовФактурСрезПоследних.Регистратор) КАК Регистратор,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СчетФактура
	|ПОМЕСТИТЬ ПоследнийРегистраторПоСчетуФактуреВыданному
	|ИЗ
	|	РегистрСведений.ЖурналУчетаСчетовФактур.СрезПоследних(
	|			&Дата,
	|			Регистратор <> &Ссылка
	|				И СчетФактура В
	|					(ВЫБРАТЬ
	|						СчетаФактурыВыданные.СчетФактура
	|					ИЗ
	|						СчетаФактурыВыданные)) КАК ЖурналУчетаСчетовФактурСрезПоследних
	|ГДЕ
	|	НЕ &ТолькоСторнироватьИсходныйСчетФактуру
	|	И ЖурналУчетаСчетовФактурСрезПоследних.Регистратор <> &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЖурналУчетаСчетовФактурСрезПоследних.СчетФактура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Регистратор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналУчетаСчетовФактурСрезПоследних.СчетФактураВыданныйПокупателю КАК СчетФактураВыданныйПокупателю,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуре,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДС,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуреРазницаУменьшение,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуреРазницаУвеличение,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДСРазницаУменьшение,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДСРазницаУвеличение,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуреКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДСКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуреРазницаУменьшениеКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуреРазницаУвеличениеКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДСРазницаУменьшениеКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДСРазницаУвеличениеКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СчетФактура,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Контрагент
	|ПОМЕСТИТЬ СуммыПоСчетамФактурамПолученным
	|ИЗ
	|	РегистрСведений.ЖурналУчетаСчетовФактур.СрезПоследних(
	|			&Дата,
	|			СчетФактура <> &ИсправляемыйСчетФактура
	|				И СчетФактураВыданныйПокупателю В
	|					(ВЫБРАТЬ
	|						СчетаФактурыВыданныеПоТекущемуСФ.СчетФактура
	|					ИЗ
	|						СчетаФактурыВыданныеПоТекущемуСФ)
	|				И Регистратор <> &Ссылка
	|				И НЕ Сторно) КАК ЖурналУчетаСчетовФактурСрезПоследних
	|ГДЕ
	|	НЕ &ПовторноеИсправлениеСобственнойОшибки
	|	И НЕ &ТолькоСторнироватьИсходныйСчетФактуру
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактураВыданныйПокупателю
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналУчетаСчетовФактурСрезПоследних.Период,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Регистратор,
	|	ЖурналУчетаСчетовФактурСрезПоследних.НомерСтроки,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Активность,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Организация,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Контрагент,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СчетФактура КАК СчетФактура,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ЧастьЖурнала,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ИндексСтроки,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Сторно,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ИсправленныйСчетФактура,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СчетФактураВыданныйПокупателю,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СчетФактураПолученныйОтПродавца,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ИсправлениеСобственнойОшибки,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ДатаВыставленияПолучения,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КодСпособаВыставленияПолучения,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КодВидаОперации,
	|	ЖурналУчетаСчетовФактурСрезПоследних.НомерСчетаФактуры,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ДатаСчетаФактуры,
	|	ЖурналУчетаСчетовФактурСрезПоследних.НомерИсправления,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ДатаИсправления,
	|	ЖурналУчетаСчетовФактурСрезПоследних.НомерКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ДатаКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактурСрезПоследних.НомерИсправленияКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ДатаИсправленияКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Валюта,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуре,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДС,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуреРазницаУменьшение,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуреРазницаУвеличение,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДСРазницаУменьшение,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДСРазницаУвеличение,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ПоСтавкеБезНДС,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СчетФактураНеВыставляется,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Продавец,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КППКонтрагента,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Посредник,
	|	ЖурналУчетаСчетовФактурСрезПоследних.УдалитьСчетФактураВыданныйПокупателю,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Субкомиссионер,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КодВидаСделки,
	|	ЖурналУчетаСчетовФактурСрезПоследних.НомерСчетаФактурыПродавца,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуреКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДСКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуреРазницаУменьшениеКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуреРазницаУвеличениеКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДСРазницаУменьшениеКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДСРазницаУвеличениеКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КодВидаОперацииКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ДатаСчетаФактурыПродавца,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ИННКонтрагента,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ИННПродавца,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КПППродавца,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ИННСубкомиссионера,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КППСубкомиссионера
	|ПОМЕСТИТЬ ДвиженияНоваяЗаписьВыставленныеСФПредварительная
	|ИЗ
	|	РегистрСведений.ЖурналУчетаСчетовФактур.СрезПоследних(
	|			&Дата,
	|			Регистратор В
	|					(ВЫБРАТЬ
	|						ПоследнийРегистраторПоСчетуФактуреВыданному.Регистратор
	|					ИЗ
	|						ПоследнийРегистраторПоСчетуФактуреВыданному)
	|				И СчетФактура В
	|					(ВЫБРАТЬ
	|						СчетаФактурыВыданныеПоТекущемуСФ.СчетФактура
	|					ИЗ
	|						СчетаФактурыВыданныеПоТекущемуСФ)
	|				И НЕ Сторно
	|				И ВЫБОР
	|					КОГДА &ПовторноеИсправлениеСобственнойОшибки
	|						ТОГДА СчетФактураПолученныйОтПродавца = &ИсправляемыйСчетФактура
	|					ИНАЧЕ ИСТИНА
	|				КОНЕЦ) КАК ЖурналУчетаСчетовФактурСрезПоследних
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналУчетаСчетовФактурСрезПоследних.Период,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Регистратор,
	|	ЖурналУчетаСчетовФактурСрезПоследних.НомерСтроки,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Активность,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Организация,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Контрагент,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СчетФактура КАК СчетФактура,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ЧастьЖурнала,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ИндексСтроки,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Сторно,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ИсправленныйСчетФактура,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СчетФактураВыданныйПокупателю,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СчетФактураПолученныйОтПродавца,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ИсправлениеСобственнойОшибки,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ДатаВыставленияПолучения,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КодСпособаВыставленияПолучения,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КодВидаОперации,
	|	ЖурналУчетаСчетовФактурСрезПоследних.НомерСчетаФактуры,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ДатаСчетаФактуры,
	|	ЖурналУчетаСчетовФактурСрезПоследних.НомерИсправления,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ДатаИсправления,
	|	ЖурналУчетаСчетовФактурСрезПоследних.НомерКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ДатаКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактурСрезПоследних.НомерИсправленияКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ДатаИсправленияКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Валюта,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуре,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДС,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуреРазницаУменьшение,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуреРазницаУвеличение,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДСРазницаУменьшение,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДСРазницаУвеличение,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ПоСтавкеБезНДС,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СчетФактураНеВыставляется,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Продавец,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КППКонтрагента,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Посредник,
	|	ЖурналУчетаСчетовФактурСрезПоследних.УдалитьСчетФактураВыданныйПокупателю,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Субкомиссионер,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КодВидаСделки,
	|	ЖурналУчетаСчетовФактурСрезПоследних.НомерСчетаФактурыПродавца,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуреКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДСКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуреРазницаУменьшениеКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуреРазницаУвеличениеКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДСРазницаУменьшениеКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДСРазницаУвеличениеКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КодВидаОперацииКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ДатаСчетаФактурыПродавца,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ИННКонтрагента,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ИННПродавца,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КПППродавца,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ИННСубкомиссионера,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КППСубкомиссионера
	|ПОМЕСТИТЬ ДвиженияНоваяЗаписьПовторноеИсправление
	|ИЗ
	|	РегистрСведений.ЖурналУчетаСчетовФактур.СрезПоследних(
	|			&Дата,
	|			Регистратор В
	|					(ВЫБРАТЬ
	|						ПоследнийРегистраторПоСчетуФактуреВыданному.Регистратор
	|					ИЗ
	|						ПоследнийРегистраторПоСчетуФактуреВыданному)
	|				И СчетФактура В
	|					(ВЫБРАТЬ
	|						СчетаФактурыВыданныеПоТекущемуСФ.СчетФактура
	|					ИЗ
	|						СчетаФактурыВыданныеПоТекущемуСФ)
	|				И НЕ Сторно
	|				И СчетФактураПолученныйОтПродавца <> &ИсправляемыйСчетФактура) КАК ЖурналУчетаСчетовФактурСрезПоследних
	|ГДЕ
	|	&ПовторноеИсправлениеСобственнойОшибки
	|	И НЕ &ТолькоСторнироватьИсходныйСчетФактуру
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЖурналУчетаСчетовФактурСрезПоследних.Период,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Регистратор,
	|	ЖурналУчетаСчетовФактурСрезПоследних.НомерСтроки,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Активность,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Организация,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Контрагент,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СчетФактура КАК СчетФактура,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ЧастьЖурнала,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ИндексСтроки,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Сторно,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ИсправленныйСчетФактура,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СчетФактураВыданныйПокупателю,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СчетФактураПолученныйОтПродавца,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ИсправлениеСобственнойОшибки,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ДатаВыставленияПолучения,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КодСпособаВыставленияПолучения,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КодВидаОперации,
	|	ЖурналУчетаСчетовФактурСрезПоследних.НомерСчетаФактуры,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ДатаСчетаФактуры,
	|	ЖурналУчетаСчетовФактурСрезПоследних.НомерИсправления,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ДатаИсправления,
	|	ЖурналУчетаСчетовФактурСрезПоследних.НомерКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ДатаКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактурСрезПоследних.НомерИсправленияКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ДатаИсправленияКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Валюта,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуре,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДС,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуреРазницаУменьшение,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуреРазницаУвеличение,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДСРазницаУменьшение,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДСРазницаУвеличение,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ПоСтавкеБезНДС,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СчетФактураНеВыставляется,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Продавец,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КППКонтрагента,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Посредник,
	|	ЖурналУчетаСчетовФактурСрезПоследних.УдалитьСчетФактураВыданныйПокупателю,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Субкомиссионер,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КодВидаСделки,
	|	ЖурналУчетаСчетовФактурСрезПоследних.НомерСчетаФактурыПродавца,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуреКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДСКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуреРазницаУменьшениеКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуреРазницаУвеличениеКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДСРазницаУменьшениеКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДСРазницаУвеличениеКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КодВидаОперацииКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ДатаСчетаФактурыПродавца,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ИННКонтрагента,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ИННПродавца,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КПППродавца,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ИННСубкомиссионера,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КППСубкомиссионера
	|ПОМЕСТИТЬ ДвиженияНоваяЗаписьПервичноеИсправление
	|ИЗ
	|	РегистрСведений.ЖурналУчетаСчетовФактур.СрезПоследних(
	|			&Дата,
	|			Регистратор <> &Ссылка
	|				И НЕ Сторно) КАК ЖурналУчетаСчетовФактурСрезПоследних
	|ГДЕ
	|	НЕ &ПовторноеИсправлениеСобственнойОшибки
	|	И НЕ &ТолькоСторнироватьИсходныйСчетФактуру
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетФактура";

	//1 пакет - сторно записи.
	//  1 запрос - подготавливаем сторно запись по исправляемому полученному счету-фактуре.
	//  2 запрос - подготавливаем сторно записи по счетам-фактурам из ТЧ "СФ выданные покупателям" ИСПРАВЛЯЕМОГО СФ.
	//2 пакет - подготавливаем новые записи по счетам-фактурам из ТЧ "СФ выданные покупателям" с привязкой к текущему полученному счету-фактуре,
	//  берем запись по выданному СФ по последнему регистратору, если это повторное исправление то из записи по последнему регистратору берем 
	//  запись со счетом-фактурой полученным равным исправляемому счету-фактуре.
	//3 пакет - если это не повторное исправление, значит к выставленному счету-фактуре не привязаны все полученные через измерение "СчетФактураПолученныйОтПродавца",
	//  ищем другие полученные счета-фактуры которые ссылаются на выставленный из ТЧ "СФ выданные покупателям" через измерение
	//  "СчетФактураВыданныйПокупателю".
	//4 пакет.
	//  1 запрос - если это повторное исправление, значит выставленный счет-фактура уже привязан ранее ко всем полученным через "СчетФактураПолученныйОтПродавца",
	//  ищем такие записи по последнему регистратору, дублируем, кроме записи, которая ссылается на исправляемый СФ полученный.
	//  2 запрос - если это не повторное исправление, значит выставленный счет-фактура не привязан ранее ко всем полученным через "СчетФактураПолученныйОтПродавца",
	//  новые записи по выставленному счету-фактуре с привязкой к счетам-фактурам из пакета 4.
	
	ТекстЗапросаОсновной = "ВЫБРАТЬ
	|	ЖурналУчетаСчетовФактурСрезПоследних.Организация,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Контрагент,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КППКонтрагента,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Продавец,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Посредник,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СчетФактура,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ЧастьЖурнала,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ДатаВыставленияПолучения,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КодСпособаВыставленияПолучения,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КодВидаОперации,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КодВидаОперацииКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.НомерСчетаФактуры,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ДатаСчетаФактуры,
	|	ЖурналУчетаСчетовФактурСрезПоследних.НомерКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ДатаКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактурСрезПоследних.НомерИсправления,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ДатаИсправления,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Валюта,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ПоСтавкеБезНДС,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СчетФактураНеВыставляется,
	|	ЖурналУчетаСчетовФактурСрезПоследних.НомерИсправленияКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ДатаИсправленияКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Субкомиссионер,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СчетФактураВыданныйПокупателю,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КодВидаСделки,
	|	ЖурналУчетаСчетовФактурСрезПоследних.НомерСчетаФактурыПродавца,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ИндексСтроки,
	|	ИСТИНА КАК ИсправлениеСобственнойОшибки,
	|	ЗНАЧЕНИЕ(Документ.СчетФактураПолученный.ПустаяСсылка) КАК ИсправляемыйСчетФактура,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ИсправленныйСчетФактура,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ИННКонтрагента,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СчетФактураПолученныйОтПродавца КАК СчетФактураПолученныйОтПродавца,
	|	ИСТИНА КАК Сторно,
	|	-ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуре КАК СуммаПоСчетуФактуре,
	|	-ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуреКомиссия КАК СуммаПоСчетуФактуреКомиссия,
	|	-ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДС КАК СуммаНДС,
	|	-ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДСКомиссия КАК СуммаНДСКомиссия,
	|	-ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуреРазницаУменьшение КАК СуммаПоСчетуФактуреРазницаУменьшение,
	|	-ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуреРазницаУменьшениеКомиссия КАК СуммаПоСчетуФактуреРазницаУменьшениеКомиссия,
	|	-ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуреРазницаУвеличение КАК СуммаПоСчетуФактуреРазницаУвеличение,
	|	-ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуреРазницаУвеличениеКомиссия КАК СуммаПоСчетуФактуреРазницаУвеличениеКомиссия,
	|	-ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДСРазницаУменьшение КАК СуммаНДСРазницаУменьшение,
	|	-ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДСРазницаУменьшениеКомиссия КАК СуммаНДСРазницаУменьшениеКомиссия,
	|	-ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДСРазницаУвеличение КАК СуммаНДСРазницаУвеличение,
	|	-ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДСРазницаУвеличениеКомиссия КАК СуммаНДСРазницаУвеличениеКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ИННПродавца,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КПППродавца,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ИННСубкомиссионера,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КППСубкомиссионера
	|ПОМЕСТИТЬ ДвиженияСторно
	|ИЗ
	|	РегистрСведений.ЖурналУчетаСчетовФактур.СрезПоследних(
	|			&Дата,
	|			СчетФактура = &ИсправляемыйСчетФактура
	|				И Регистратор <> &Ссылка
	|				И НЕ Сторно) КАК ЖурналУчетаСчетовФактурСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЖурналУчетаСчетовФактурСрезПоследних.Организация,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Контрагент,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КППКонтрагента,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Продавец,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Посредник,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СчетФактура,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ЧастьЖурнала,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ДатаВыставленияПолучения,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КодСпособаВыставленияПолучения,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КодВидаОперации,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КодВидаОперацииКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.НомерСчетаФактуры,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ДатаСчетаФактуры,
	|	ЖурналУчетаСчетовФактурСрезПоследних.НомерКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ДатаКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактурСрезПоследних.НомерИсправления,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ДатаИсправления,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Валюта,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ПоСтавкеБезНДС,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СчетФактураНеВыставляется,
	|	ЖурналУчетаСчетовФактурСрезПоследних.НомерИсправленияКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ДатаИсправленияКорректировочногоСчетаФактуры,
	|	ЖурналУчетаСчетовФактурСрезПоследних.Субкомиссионер,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СчетФактураВыданныйПокупателю,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КодВидаСделки,
	|	ЖурналУчетаСчетовФактурСрезПоследних.НомерСчетаФактурыПродавца,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ИндексСтроки,
	|	ИСТИНА,
	|	ЗНАЧЕНИЕ(Документ.СчетФактураПолученный.ПустаяСсылка),
	|	ЖурналУчетаСчетовФактурСрезПоследних.ИсправленныйСчетФактура,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ИННКонтрагента,
	|	ЖурналУчетаСчетовФактурСрезПоследних.СчетФактураПолученныйОтПродавца,
	|	ИСТИНА,
	|	-ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуре,
	|	-ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуреКомиссия,
	|	-ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДС,
	|	-ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДСКомиссия,
	|	-ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуреРазницаУменьшение,
	|	-ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуреРазницаУменьшениеКомиссия,
	|	-ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуреРазницаУвеличение,
	|	-ЖурналУчетаСчетовФактурСрезПоследних.СуммаПоСчетуФактуреРазницаУвеличениеКомиссия,
	|	-ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДСРазницаУменьшение,
	|	-ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДСРазницаУменьшениеКомиссия,
	|	-ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДСРазницаУвеличение,
	|	-ЖурналУчетаСчетовФактурСрезПоследних.СуммаНДСРазницаУвеличениеКомиссия,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ИННПродавца,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КПППродавца,
	|	ЖурналУчетаСчетовФактурСрезПоследних.ИННСубкомиссионера,
	|	ЖурналУчетаСчетовФактурСрезПоследних.КППСубкомиссионера
	|ИЗ
	|	РегистрСведений.ЖурналУчетаСчетовФактур.СрезПоследних(
	|			&Дата,
	|			Регистратор В
	|					(ВЫБРАТЬ
	|						ПоследнийРегистраторПоСчетуФактуреВыданному.Регистратор
	|					ИЗ
	|						ПоследнийРегистраторПоСчетуФактуреВыданному)
	|				И СчетФактура В
	|					(ВЫБРАТЬ
	|						СчетаФактурыВыданныеПоИсправляемомуСФ.СчетФактура
	|					ИЗ
	|						СчетаФактурыВыданныеПоИсправляемомуСФ)
	|				И НЕ Сторно) КАК ЖурналУчетаСчетовФактурСрезПоследних
	|ГДЕ
	|	НЕ &ТолькоСторнироватьИсходныйСчетФактуру
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Ссылка КАК Регистратор,
	|	Реквизиты.Организация,
	|	ДвиженияНоваяЗаписьВыставленныеСФПредварительная.Контрагент КАК Контрагент,
	|	ДвиженияНоваяЗаписьВыставленныеСФПредварительная.КППКонтрагента КАК КППКонтрагента,
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.Ссылка.Контрагент КАК Продавец,
	|	ДвиженияНоваяЗаписьВыставленныеСФПредварительная.Посредник КАК Посредник,
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.СчетФактура,
	|	ДвиженияНоваяЗаписьВыставленныеСФПредварительная.ЧастьЖурнала КАК ЧастьЖурнала,
	|	ДвиженияНоваяЗаписьВыставленныеСФПредварительная.ДатаВыставленияПолучения КАК ДатаВыставленияПолучения,
	|	ДвиженияНоваяЗаписьВыставленныеСФПредварительная.КодСпособаВыставленияПолучения КАК КодСпособаВыставленияПолучения,
	|	ДвиженияНоваяЗаписьВыставленныеСФПредварительная.КодВидаОперации КАК КодВидаОперации,
	|	ДвиженияНоваяЗаписьВыставленныеСФПредварительная.НомерСчетаФактуры КАК НомерСчетаФактуры,
	|	ДвиженияНоваяЗаписьВыставленныеСФПредварительная.ДатаСчетаФактуры КАК ДатаСчетаФактуры,
	|	ДвиженияНоваяЗаписьВыставленныеСФПредварительная.НомерКорректировочногоСчетаФактуры КАК НомерКорректировочногоСчетаФактуры,
	|	ДвиженияНоваяЗаписьВыставленныеСФПредварительная.ДатаКорректировочногоСчетаФактуры КАК ДатаКорректировочногоСчетаФактуры,
	|	ДвиженияНоваяЗаписьВыставленныеСФПредварительная.НомерИсправления КАК НомерИсправления,
	|	ДвиженияНоваяЗаписьВыставленныеСФПредварительная.ДатаИсправления КАК ДатаИсправления,
	|	ДвиженияНоваяЗаписьВыставленныеСФПредварительная.Валюта КАК Валюта,
	|	ДвиженияНоваяЗаписьВыставленныеСФПредварительная.ПоСтавкеБезНДС КАК ПоСтавкеБезНДС,
	|	ДвиженияНоваяЗаписьВыставленныеСФПредварительная.СчетФактураНеВыставляется КАК СчетФактураНеВыставляется,
	|	ДвиженияНоваяЗаписьВыставленныеСФПредварительная.НомерИсправленияКорректировочногоСчетаФактуры КАК НомерИсправленияКорректировочногоСчетаФактуры,
	|	ДвиженияНоваяЗаписьВыставленныеСФПредварительная.ДатаИсправленияКорректировочногоСчетаФактуры КАК ДатаИсправленияКорректировочногоСчетаФактуры,
	|	ДвиженияНоваяЗаписьВыставленныеСФПредварительная.Субкомиссионер КАК Субкомиссионер,
	|	ДвиженияНоваяЗаписьВыставленныеСФПредварительная.СчетФактураВыданныйПокупателю КАК СчетФактураВыданныйПокупателю,
	|	ДвиженияНоваяЗаписьВыставленныеСФПредварительная.КодВидаСделки КАК КодВидаСделки,
	|	НЕОПРЕДЕЛЕНО КАК НомерСчетаФактурыПродавца,
	|	НЕОПРЕДЕЛЕНО КАК ИндексСтроки,
	|	ИСТИНА КАК ИсправлениеСобственнойОшибки,
	|	ЗНАЧЕНИЕ(Документ.СчетФактураПолученный.ПустаяСсылка) КАК ИсправляемыйСчетФактура,
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.Ссылка КАК ИсправленныйСчетФактура,
	|	ДвиженияНоваяЗаписьВыставленныеСФПредварительная.ИННКонтрагента КАК ИННКонтрагента,
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.Ссылка КАК СчетФактураПолученныйОтПродавца,
	|	ЛОЖЬ КАК Сторно,
	|	ДвиженияНоваяЗаписьВыставленныеСФПредварительная.СуммаПоСчетуФактуре КАК СуммаПоСчетуФактуре,
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.Сумма КАК СуммаПоСчетуФактуреКомиссия,
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.НДС КАК СуммаНДС,
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.НДС КАК СуммаНДСКомиссия,
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.СуммаУменьшение КАК СуммаПоСчетуФактуреРазницаУменьшение,
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.СуммаУменьшение КАК СуммаПоСчетуФактуреРазницаУменьшениеКомиссия,
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.СуммаУвеличение КАК СуммаПоСчетуФактуреРазницаУвеличение,
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.СуммаУвеличение КАК СуммаПоСчетуФактуреРазницаУвеличениеКомиссия,
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.СуммаНДСУвеличение КАК СуммаНДСРазницаУменьшение,
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.СуммаНДСУвеличение КАК СуммаНДСРазницаУменьшениеКомиссия,
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.СуммаНДСУменьшение КАК СуммаНДСРазницаУвеличение,
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.СуммаНДСУменьшение КАК СуммаНДСРазницаУвеличениеКомиссия,
	|	ДвиженияНоваяЗаписьВыставленныеСФПредварительная.КодВидаОперацииКомиссия,
	|	Реквизиты.ИННКонтрагента КАК ИННПродавца,
	|	Реквизиты.КППКонтрагента КАК КПППродавца,
	|	ДвиженияНоваяЗаписьВыставленныеСФПредварительная.ИННСубкомиссионера,
	|	ДвиженияНоваяЗаписьВыставленныеСФПредварительная.КППСубкомиссионера
	|ПОМЕСТИТЬ ДвиженияНоваяЗаписьВыставленныеСФ
	|ИЗ
	|	Документ.СчетФактураПолученный.СчетаФактурыВыданныеПокупателям КАК СчетФактураПолученныйСчетаФактурыВыданныеПокупателям
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО (ИСТИНА)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДвиженияНоваяЗаписьВыставленныеСФПредварительная КАК ДвиженияНоваяЗаписьВыставленныеСФПредварительная
	|		ПО СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.СчетФактура = ДвиженияНоваяЗаписьВыставленныеСФПредварительная.СчетФактура
	|ГДЕ
	|	СчетФактураПолученныйСчетаФактурыВыданныеПокупателям.Ссылка = &Ссылка
	|	И НЕ &ТолькоСторнироватьИсходныйСчетФактуру
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Ссылка КАК Регистратор,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.Организация,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.Контрагент,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.КППКонтрагента,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.Продавец КАК Продавец,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.Посредник,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.СчетФактура,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.ЧастьЖурнала,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.ДатаВыставленияПолучения,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.КодСпособаВыставленияПолучения,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.КодВидаОперации,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.НомерСчетаФактуры,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.ДатаСчетаФактуры,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.НомерКорректировочногоСчетаФактуры,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.ДатаКорректировочногоСчетаФактуры,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.НомерИсправления,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.ДатаИсправления,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.Валюта,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.ПоСтавкеБезНДС,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.СчетФактураНеВыставляется,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.НомерИсправленияКорректировочногоСчетаФактуры,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.ДатаИсправленияКорректировочногоСчетаФактуры,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.Субкомиссионер,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.СчетФактураВыданныйПокупателю,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.КодВидаСделки,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.НомерСчетаФактурыПродавца,
	|	НЕОПРЕДЕЛЕНО КАК ИндексСтроки,
	|	ИСТИНА КАК ИсправлениеСобственнойОшибки,
	|	ЗНАЧЕНИЕ(Документ.СчетФактураПолученный.ПустаяСсылка) КАК ИсправляемыйСчетФактура,
	|	&Ссылка КАК ИсправленныйСчетФактура,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.ИННКонтрагента,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.СчетФактураПолученныйОтПродавца,
	|	ЛОЖЬ КАК Сторно,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.СуммаПоСчетуФактуре,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.СуммаПоСчетуФактуреКомиссия,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.СуммаНДС,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.СуммаНДСКомиссия,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.СуммаПоСчетуФактуреРазницаУменьшение,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.СуммаПоСчетуФактуреРазницаУменьшениеКомиссия,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.СуммаПоСчетуФактуреРазницаУвеличение,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.СуммаПоСчетуФактуреРазницаУвеличениеКомиссия,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.СуммаНДСРазницаУменьшение,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.СуммаНДСРазницаУменьшениеКомиссия,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.СуммаНДСРазницаУвеличение,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.СуммаНДСРазницаУвеличениеКомиссия,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.КодВидаОперацииКомиссия,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.ИННПродавца КАК ИННПродавца,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.КПППродавца КАК КПППродавца,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.ИННСубкомиссионера,
	|	ДвиженияНоваяЗаписьПовторноеИсправление.КППСубкомиссионера
	|ПОМЕСТИТЬ ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным
	|ИЗ
	|	Реквизиты КАК Реквизиты,
	|	ДвиженияНоваяЗаписьПовторноеИсправление КАК ДвиженияНоваяЗаписьПовторноеИсправление
	|ГДЕ
	|	&ПовторноеИсправлениеСобственнойОшибки
	|	И НЕ &ТолькоСторнироватьИсходныйСчетФактуру
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Реквизиты.Дата,
	|	Реквизиты.Ссылка,
	|	ДвиженияНоваяЗаписьПервичноеИсправление.Организация,
	|	ДвиженияНоваяЗаписьПервичноеИсправление.Контрагент,
	|	ДвиженияНоваяЗаписьПервичноеИсправление.КППКонтрагента,
	|	СуммыПоСчетамФактурамПолученным.Контрагент,
	|	ДвиженияНоваяЗаписьПервичноеИсправление.Посредник,
	|	ДвиженияНоваяЗаписьПервичноеИсправление.СчетФактура,
	|	ДвиженияНоваяЗаписьПервичноеИсправление.ЧастьЖурнала,
	|	ДвиженияНоваяЗаписьПервичноеИсправление.ДатаВыставленияПолучения,
	|	ДвиженияНоваяЗаписьПервичноеИсправление.КодСпособаВыставленияПолучения,
	|	ДвиженияНоваяЗаписьПервичноеИсправление.КодВидаОперации,
	|	ДвиженияНоваяЗаписьПервичноеИсправление.НомерСчетаФактуры,
	|	ДвиженияНоваяЗаписьПервичноеИсправление.ДатаСчетаФактуры,
	|	ДвиженияНоваяЗаписьПервичноеИсправление.НомерКорректировочногоСчетаФактуры,
	|	ДвиженияНоваяЗаписьПервичноеИсправление.ДатаКорректировочногоСчетаФактуры,
	|	ДвиженияНоваяЗаписьПервичноеИсправление.НомерИсправления,
	|	ДвиженияНоваяЗаписьПервичноеИсправление.ДатаИсправления,
	|	ДвиженияНоваяЗаписьПервичноеИсправление.Валюта,
	|	ДвиженияНоваяЗаписьПервичноеИсправление.ПоСтавкеБезНДС,
	|	ДвиженияНоваяЗаписьПервичноеИсправление.СчетФактураНеВыставляется,
	|	ДвиженияНоваяЗаписьПервичноеИсправление.НомерИсправленияКорректировочногоСчетаФактуры,
	|	ДвиженияНоваяЗаписьПервичноеИсправление.ДатаИсправленияКорректировочногоСчетаФактуры,
	|	ДвиженияНоваяЗаписьПервичноеИсправление.Субкомиссионер,
	|	ЗНАЧЕНИЕ(Документ.СчетФактураВыданный.ПустаяСсылка),
	|	ДвиженияНоваяЗаписьПервичноеИсправление.КодВидаСделки,
	|	НЕОПРЕДЕЛЕНО,
	|	НЕОПРЕДЕЛЕНО,
	|	ИСТИНА,
	|	ЗНАЧЕНИЕ(Документ.СчетФактураПолученный.ПустаяСсылка),
	|	&Ссылка,
	|	ДвиженияНоваяЗаписьПервичноеИсправление.ИННКонтрагента,
	|	СуммыПоСчетамФактурамПолученным.СчетФактура,
	|	ЛОЖЬ,
	|	ДвиженияНоваяЗаписьПервичноеИсправление.СуммаПоСчетуФактуре,
	|	СуммыПоСчетамФактурамПолученным.СуммаПоСчетуФактуреКомиссия,
	|	СуммыПоСчетамФактурамПолученным.СуммаНДС,
	|	СуммыПоСчетамФактурамПолученным.СуммаНДСКомиссия,
	|	СуммыПоСчетамФактурамПолученным.СуммаПоСчетуФактуреРазницаУменьшение,
	|	СуммыПоСчетамФактурамПолученным.СуммаПоСчетуФактуреРазницаУменьшениеКомиссия,
	|	СуммыПоСчетамФактурамПолученным.СуммаПоСчетуФактуреРазницаУвеличение,
	|	СуммыПоСчетамФактурамПолученным.СуммаПоСчетуФактуреРазницаУвеличениеКомиссия,
	|	СуммыПоСчетамФактурамПолученным.СуммаНДСРазницаУменьшение,
	|	СуммыПоСчетамФактурамПолученным.СуммаНДСРазницаУменьшениеКомиссия,
	|	СуммыПоСчетамФактурамПолученным.СуммаНДСРазницаУвеличение,
	|	СуммыПоСчетамФактурамПолученным.СуммаНДСРазницаУвеличениеКомиссия,
	|	ДвиженияНоваяЗаписьПервичноеИсправление.КодВидаОперацииКомиссия,
	|	ДвиженияНоваяЗаписьПервичноеИсправление.ИННКонтрагента,
	|	ДвиженияНоваяЗаписьПервичноеИсправление.КПППродавца,
	|	ДвиженияНоваяЗаписьПервичноеИсправление.ИННСубкомиссионера,
	|	ДвиженияНоваяЗаписьПервичноеИсправление.КППСубкомиссионера
	|ИЗ
	|	ДвиженияНоваяЗаписьПервичноеИсправление КАК ДвиженияНоваяЗаписьПервичноеИсправление
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СуммыПоСчетамФактурамПолученным КАК СуммыПоСчетамФактурамПолученным
	|		ПО ДвиженияНоваяЗаписьПервичноеИсправление.СчетФактура = СуммыПоСчетамФактурамПолученным.СчетФактураВыданныйПокупателю
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО (ИСТИНА)
	|ГДЕ
	|	НЕ &ПовторноеИсправлениеСобственнойОшибки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Дата КАК Период,
	|	Реквизиты.Ссылка КАК Регистратор,
	|	ДвиженияСторно.Организация,
	|	ДвиженияСторно.Контрагент,
	|	ДвиженияСторно.КППКонтрагента,
	|	ДвиженияСторно.Продавец,
	|	ДвиженияСторно.Посредник,
	|	ДвиженияСторно.СчетФактура,
	|	ДвиженияСторно.ЧастьЖурнала,
	|	ДвиженияСторно.ДатаВыставленияПолучения,
	|	ДвиженияСторно.КодСпособаВыставленияПолучения,
	|	ДвиженияСторно.КодВидаОперации,
	|	ДвиженияСторно.КодВидаОперацииКомиссия,
	|	ДвиженияСторно.НомерСчетаФактуры,
	|	ДвиженияСторно.ДатаСчетаФактуры,
	|	ДвиженияСторно.НомерКорректировочногоСчетаФактуры,
	|	ДвиженияСторно.ДатаКорректировочногоСчетаФактуры,
	|	ДвиженияСторно.НомерИсправления,
	|	ДвиженияСторно.ДатаИсправления,
	|	ДвиженияСторно.Валюта,
	|	ДвиженияСторно.ПоСтавкеБезНДС,
	|	ДвиженияСторно.СчетФактураНеВыставляется,
	|	ДвиженияСторно.НомерИсправленияКорректировочногоСчетаФактуры,
	|	ДвиженияСторно.ДатаИсправленияКорректировочногоСчетаФактуры,
	|	ДвиженияСторно.Субкомиссионер,
	|	ДвиженияСторно.СчетФактураВыданныйПокупателю,
	|	ДвиженияСторно.КодВидаСделки,
	|	ДвиженияСторно.НомерСчетаФактурыПродавца,
	|	ДвиженияСторно.ИндексСтроки,
	|	ДвиженияСторно.ИсправлениеСобственнойОшибки,
	|	ДвиженияСторно.ИсправляемыйСчетФактура,
	|	ДвиженияСторно.ИсправленныйСчетФактура,
	|	ДвиженияСторно.ИННКонтрагента,
	|	ДвиженияСторно.СчетФактураПолученныйОтПродавца,
	|	ДвиженияСторно.Сторно,
	|	ДвиженияСторно.СуммаПоСчетуФактуре,
	|	ДвиженияСторно.СуммаПоСчетуФактуреКомиссия,
	|	ДвиженияСторно.СуммаНДС,
	|	ДвиженияСторно.СуммаНДСКомиссия,
	|	ДвиженияСторно.СуммаПоСчетуФактуреРазницаУменьшение,
	|	ДвиженияСторно.СуммаПоСчетуФактуреРазницаУменьшениеКомиссия,
	|	ДвиженияСторно.СуммаПоСчетуФактуреРазницаУвеличение,
	|	ДвиженияСторно.СуммаПоСчетуФактуреРазницаУвеличениеКомиссия,
	|	ДвиженияСторно.СуммаНДСРазницаУменьшение,
	|	ДвиженияСторно.СуммаНДСРазницаУменьшениеКомиссия,
	|	ДвиженияСторно.СуммаНДСРазницаУвеличение,
	|	ДвиженияСторно.СуммаНДСРазницаУвеличениеКомиссия,
	|	ДвиженияСторно.ИННПродавца,
	|	ДвиженияСторно.КПППродавца,
	|	ДвиженияСторно.ИННСубкомиссионера,
	|	ДвиженияСторно.КППСубкомиссионера,
	|	Реквизиты.КодВидаОперацииНаУменьшение
	|ИЗ
	|	ДвиженияСторно КАК ДвиженияСторно
	|		ЛЕВОЕ СОЕДИНЕНИЕ Реквизиты КАК Реквизиты
	|		ПО (ИСТИНА)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДвиженияНоваяЗаписьВыставленныеСФ.Период,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.Регистратор,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.Организация,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.Контрагент,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.КППКонтрагента,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.Продавец,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.Посредник,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.СчетФактура,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.ЧастьЖурнала,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.ДатаВыставленияПолучения,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.КодСпособаВыставленияПолучения,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.КодВидаОперации,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.КодВидаОперацииКомиссия,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.НомерСчетаФактуры,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.ДатаСчетаФактуры,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.НомерКорректировочногоСчетаФактуры,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.ДатаКорректировочногоСчетаФактуры,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.НомерИсправления,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.ДатаИсправления,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.Валюта,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.ПоСтавкеБезНДС,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.СчетФактураНеВыставляется,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.НомерИсправленияКорректировочногоСчетаФактуры,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.ДатаИсправленияКорректировочногоСчетаФактуры,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.Субкомиссионер,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.СчетФактураВыданныйПокупателю,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.КодВидаСделки,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.НомерСчетаФактурыПродавца,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.ИндексСтроки,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.ИсправлениеСобственнойОшибки,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.ИсправляемыйСчетФактура,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.ИсправленныйСчетФактура,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.ИННКонтрагента,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.СчетФактураПолученныйОтПродавца,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.Сторно,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.СуммаПоСчетуФактуре,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.СуммаПоСчетуФактуреКомиссия,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.СуммаНДС,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.СуммаНДСКомиссия,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.СуммаПоСчетуФактуреРазницаУменьшение,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.СуммаПоСчетуФактуреРазницаУменьшениеКомиссия,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.СуммаПоСчетуФактуреРазницаУвеличение,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.СуммаПоСчетуФактуреРазницаУвеличениеКомиссия,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.СуммаНДСРазницаУменьшение,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.СуммаНДСРазницаУменьшениеКомиссия,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.СуммаНДСРазницаУвеличение,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.СуммаНДСРазницаУвеличениеКомиссия,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.ИННПродавца,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.КПППродавца,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.ИННСубкомиссионера,
	|	ДвиженияНоваяЗаписьВыставленныеСФ.КППСубкомиссионера,
	|	""""
	|ИЗ
	|	ДвиженияНоваяЗаписьВыставленныеСФ КАК ДвиженияНоваяЗаписьВыставленныеСФ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.Период,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.Регистратор,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.Организация,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.Контрагент,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.КППКонтрагента,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.Продавец,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.Посредник,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.СчетФактура,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.ЧастьЖурнала,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.ДатаВыставленияПолучения,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.КодСпособаВыставленияПолучения,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.КодВидаОперации,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.КодВидаОперацииКомиссия,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.НомерСчетаФактуры,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.ДатаСчетаФактуры,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.НомерКорректировочногоСчетаФактуры,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.ДатаКорректировочногоСчетаФактуры,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.НомерИсправления,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.ДатаИсправления,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.Валюта,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.ПоСтавкеБезНДС,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.СчетФактураНеВыставляется,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.НомерИсправленияКорректировочногоСчетаФактуры,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.ДатаИсправленияКорректировочногоСчетаФактуры,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.Субкомиссионер,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.СчетФактураВыданныйПокупателю,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.КодВидаСделки,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.НомерСчетаФактурыПродавца,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.ИндексСтроки,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.ИсправлениеСобственнойОшибки,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.ИсправляемыйСчетФактура,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.ИсправленныйСчетФактура,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.ИННКонтрагента,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.СчетФактураПолученныйОтПродавца,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.Сторно,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.СуммаПоСчетуФактуре,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.СуммаПоСчетуФактуреКомиссия,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.СуммаНДС,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.СуммаНДСКомиссия,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.СуммаПоСчетуФактуреРазницаУменьшение,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.СуммаПоСчетуФактуреРазницаУменьшениеКомиссия,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.СуммаПоСчетуФактуреРазницаУвеличение,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.СуммаПоСчетуФактуреРазницаУвеличениеКомиссия,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.СуммаНДСРазницаУменьшение,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.СуммаНДСРазницаУменьшениеКомиссия,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.СуммаНДСРазницаУвеличение,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.СуммаНДСРазницаУвеличениеКомиссия,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.ИННПродавца,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.КПППродавца,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.ИННСубкомиссионера,
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным.КППСубкомиссионера,
	|	""""
	|ИЗ
	|	ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным КАК ДвиженияНоваяЗаписьВыставленныеСФПоПрочимПолученным";
	
	ТекстЗапросаИтоговый = ТекстЗапросаПодготовительный
		+ ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета()
		+ ТекстЗапросаОсновной
		+ ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
		
	Возврат ТекстЗапросаИтоговый;
	
КонецФункции

Функция ТекстЗапросаОшибочныеРеквизитыКонтрагентов(НомераТаблиц, ПараметрыПроведения, Реквизиты)
	
	Если НЕ Реквизиты.ИсправлениеСобственнойОшибки Тогда
		ПараметрыПроведения.Вставить("ТаблицаОшибочныеРеквизитыКонтрагентов", Неопределено);
		Возврат "";
	КонецЕсли;
	
	НомераТаблиц.Вставить("ТаблицаОшибочныеРеквизитыКонтрагентов", НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	СчетФактураПолученный.Дата КАК Период,
	|	СчетФактураПолученный.Ссылка КАК Регистратор,
	|	СчетФактураПолученный.Организация КАК Организация,
	|	СчетФактураПолученный.ИсправляемыйСчетФактура КАК СчетФактура,
	|	&ИсходныйСчетФактура КАК ИсходныйСчетФактура,
	|	СчетФактураПолученный.Контрагент КАК Контрагент,
	|	СчетФактураПолученный.ИННКонтрагентаДоИзменения КАК ИНН,
	|	СчетФактураПолученный.КППКонтрагентаДоИзменения КАК КПП
	|ИЗ
	|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|ГДЕ
	|	СчетФактураПолученный.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетФактураПолученный.Дата,
	|	СчетФактураПолученный.Ссылка,
	|	СчетФактураПолученный.Организация,
	|	СчетФактураПолученный.ИсправляемыйСчетФактура,
	|	&ИсходныйСчетФактура,
	|	ПродавцыПоСчетуФактуре.Продавец,
	|	ПродавцыПоСчетуФактуре.ИННПродавцаДоИзменения,
	|	ПродавцыПоСчетуФактуре.КПППродавцаДоИзменения
	|ИЗ
	|	Документ.СчетФактураПолученный.Продавцы КАК ПродавцыПоСчетуФактуре
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|		ПО ПродавцыПоСчетуФактуре.Ссылка = СчетФактураПолученный.Ссылка
	|ГДЕ
	|	ПродавцыПоСчетуФактуре.Ссылка = &Ссылка";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции

Функция ЕстьКомиссионныеОперацииПоСчетуФактуре4кв2014(ДокументСсылка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетФактураПолученныйДокументыОснования.ДокументОснование КАК ДокументОснование
	|ПОМЕСТИТЬ ВременнаяТаблицаДокументыОснования
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	|ГДЕ
	|	СчетФактураПолученныйДокументыОснования.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	1 КАК Количество
	|ИЗ
	|	РегистрНакопления.ЗакупленныеТоварыКомитентов КАК ЗакупленныеТоварыКомитентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблицаДокументыОснования КАК ВременнаяТаблицаДокументыОснования
	|		ПО ЗакупленныеТоварыКомитентов.Регистратор = ВременнаяТаблицаДокументыОснования.ДокументОснование
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	1
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Регистратор В
	|			(ВЫБРАТЬ
	|				ВременнаяТаблицаДокументыОснования.ДокументОснование
	|			ИЗ
	|				ВременнаяТаблицаДокументыОснования)
	|	И Хозрасчетный.СчетДт = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ТМЦпринятыеНаОтветственноеХранение)";
	
	Результат = Запрос.Выполнить();
	
	Возврат Не Результат.Пустой();
	
КонецФункции

#КонецОбласти 

#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Счет-фактура от поставщика
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СчетФактураПолученный";
	КомандаПечати.Представление = НСтр("ru = 'Счет-фактура за поставщика'");
	КомандаПечати.Обработчик    = "УчетНДСКлиент.ВыполнитьКомандуПечатиСчетовФактурПолученных";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаВыбора,ФормаДокументаНаПоступление,ФормаДокументаКорректировочный";
	
	Если ПравоДоступа("Чтение", Метаданные.Справочники.Контрагенты) Тогда
		// Печать конвертов
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Идентификатор = "Конверт";
		КомандаПечати.Представление = НСтр("ru = 'Конверт'");
		КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечатиКонверта";
		КомандаПечати.Порядок       = 90;
	КонецЕсли;
	
	// Реестр документов
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Реестр";
	КомандаПечати.Представление = НСтр("ru = 'Реестр документов'");
	КомандаПечати.ЗаголовокФормы= НСтр("ru = 'Реестр документов ""Счет-фактура полученный""'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	КомандаПечати.СписокФорм    = "ФормаСписка";
	КомандаПечати.Порядок       = 100;
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетФактура") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"СчетФактура", "Счет-фактура", 
			УчетНДСБП.ПечатьСчетовФактур(МассивОбъектов, ОбъектыПечати, ТекстЗапросаПечатьСчетовФактур(Ложь)),,
			"ОбщийМакет.ПФ_MXL_СчетФактура451");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СчетФактура1137") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"СчетФактура1137", "Счет-фактура",
			УчетНДС.ПечатьСчетовФактур1137(МассивОбъектов, ОбъектыПечати, ТекстЗапросаПечатьСчетовФактур()),,
			"ОбщийМакет.ПФ_MXL_СчетФактура1137");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КорректировочныйСчетФактура") Тогда		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"КорректировочныйСчетФактура", "Корректировочный счет-фактура", 
			УчетНДСБП.ПечатьКорректировочныхСчетовФактур(МассивОбъектов, ОбъектыПечати, ТекстЗапросаПечатьКорректировочныхСчетовФактур(Ложь, Ложь)),, 
			"ОбщийМакет.ПФ_MXL_КорректировочныйСчетФактура");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КорректировочныйСчетФактура1137") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"КорректировочныйСчетФактура1137", "Корректировочный счет-фактура", 
			УчетНДС.ПечатьКорректировочныхСчетовФактур1137(МассивОбъектов, ОбъектыПечати, ТекстЗапросаПечатьКорректировочныхСчетовФактур(, Ложь)), 
			"ОбщийМакет.ПФ_MXL_КорректировочныйСчетФактура1137");
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "КорректировочныйСчетФактура952") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"КорректировочныйСчетФактура952", "Корректировочный счет-фактура",
			УчетНДС.ПечатьКорректировочныхСчетовФактур952(МассивОбъектов, ОбъектыПечати, ТекстЗапросаПечатьКорректировочныхСчетовФактур()),,
			"ОбщийМакет.ПФ_MXL_КорректировочныйСчетФактура952");
	КонецЕсли;
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	ОбщегоНазначенияБП.ЗаполнитьДополнительныеПараметрыПечати(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода);	
		
КонецПроцедуры

Функция ТекстЗапросаПечатьСчетовФактур(ИспользуетсяПостановлениеНДС1137 = Истина) Экспорт

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДокументыОснования.Ссылка КАК СчетФактура,
	|	ЛОЖЬ КАК УдалитьПрефиксыИзНомера,
	|	ЛОЖЬ КАК ЭтоСчетФактураВыданный,
	|	ИСТИНА КАК ВыводитьСуммуБезНДС,
	|	ДокументыОснования.ДокументОснование КАК ДокументОснование,
	|	ДокументыОснования.НомерСтроки КАК НомерСтроки,
	|	ДокументыОснования.Ссылка.ДатаВходящегоДокумента КАК Дата,
	|	ДокументыОснования.Ссылка.НомерВходящегоДокумента КАК Номер,
	|	ДокументыОснования.Ссылка.ВидСчетаФактуры КАК ВидСчетаФактуры,
	|	ДокументыОснования.Ссылка.СчетФактураБезНДС КАК СчетФактураБезНДС,
	|	ДокументыОснования.Ссылка.Исправление КАК Исправление,
	|	ДокументыОснования.Ссылка.НомерИсправления КАК НомерИсправления,
	|	ДокументыОснования.Ссылка.Дата КАК ДатаИсправления,
	|	ВЫБОР
	|		КОГДА ДокументыОснования.Ссылка.Исправление
	|			ТОГДА ДокументыОснования.Ссылка.ДатаИсправления
	|		КОГДА ДокументыОснования.Ссылка.ДатаВходящегоДокумента <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДокументыОснования.Ссылка.ДатаВходящегоДокумента
	|		ИНАЧЕ ДокументыОснования.Ссылка.Дата
	|	КОНЕЦ КАК ДатаСведений,
	|	ДокументыОснования.Ссылка.Контрагент КАК Контрагент,
	|	ДокументыОснования.Ссылка.ДоговорКонтрагента КАК ДоговорКонтрагента,
	|	"""" КАК ИдентификаторГосКонтракта,
	|	ВЫБОР
	|		КОГДА ДокументыОснования.Ссылка.ДоговорКонтрагента <> ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|			ТОГДА ДокументыОснования.Ссылка.ДоговорКонтрагента.ВидДоговора
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровКонтрагентов.СПоставщиком)
	|	КОНЕЦ КАК ВидДоговора,
	|	ДокументыОснования.Ссылка.КППКонтрагента КАК КППСчетаФактуры,
	|	ДокументыОснования.Ссылка.СводныйКомиссионный
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК ДокументыОснования
	|ГДЕ
	|	ДокументыОснования.Ссылка В(&МассивОбъектов)
	|	И &УсловиеПоДате
	|	И НЕ ДокументыОснования.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|	И НЕ ДокументыОснования.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАвансКомитента)
	|	И НЕ ДокументыОснования.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|	И НЕ ДокументыОснования.ДокументОснование ССЫЛКА Документ.ОтчетКомитентуОПродажах
	|
	|УПОРЯДОЧИТЬ ПО
	|	СчетФактура,
	|	НомерСтроки
	|ИТОГИ
	|	МАКСИМУМ(УдалитьПрефиксыИзНомера),
	|	МАКСИМУМ(ЭтоСчетФактураВыданный),
	|	МАКСИМУМ(ВыводитьСуммуБезНДС)
	|ПО
	|	СчетФактура";
	
	Если ИспользуетсяПостановлениеНДС1137 Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДате",
		"ДокументыОснования.Ссылка.Дата >= &НачалоПримененияПостановления1137");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДате",
		"ДокументыОснования.Ссылка.Дата < &НачалоПримененияПостановления1137");
	КонецЕсли;
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();

КонецФункции 

Функция ТекстЗапросаПечатьКорректировочныхСчетовФактур(ИспользуетсяПостановлениеНДС1137 = Истина, ИспользуетсяПостановлениеНДС952 = Истина) Экспорт

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДокументыОснования.Ссылка КАК СчетФактура,
	|	ДокументыОснования.Ссылка.ДатаВходящегоДокумента КАК Дата,
	|	ДокументыОснования.Ссылка.НомерВходящегоДокумента КАК Номер,
	|	ДокументыОснования.Ссылка.ВидСчетаФактуры КАК ВидСчетаФактуры,
	|	ДокументыОснования.Ссылка.СчетФактураБезНДС КАК СчетФактураБезНДС,
	|	ДокументыОснования.Ссылка.Исправление КАК Исправление,
	|	ДокументыОснования.Ссылка.НомерИсправления КАК НомерИсправления,
	|	ДокументыОснования.Ссылка.ДатаИсправления КАК ДатаИсправления,
	|	ДокументыОснования.УчитыватьИсправлениеИсходногоДокумента КАК УчитыватьИсправлениеИсходногоДокумента,
	|	ДокументыОснования.НомерИсходногоДокумента КАК НомерИсходногоДокумента,
	|	ДокументыОснования.ДатаИсходногоДокумента КАК ДатаИсходногоДокумента,
	|	ДокументыОснования.НомерИсправленияИсходногоДокумента КАК НомерИсправленияИсходногоДокумента,
	|	ДокументыОснования.ДатаИсправленияИсходногоДокумента КАК ДатаИсправленияИсходногоДокумента,
	|	ДокументыОснования.Ссылка.НомерИсправления КАК НомерИсправленияКорректировочного,
	|	ДокументыОснования.Ссылка.ДатаИсправления КАК ДатаИсправленияКорректировочного,
	|	ВЫБОР
	|		КОГДА ДокументыОснования.Ссылка.Исправление
	|			ТОГДА ДокументыОснования.Ссылка.ДатаИсправления
	|		КОГДА ДокументыОснования.Ссылка.ДатаВходящегоДокумента <> ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ДокументыОснования.Ссылка.ДатаВходящегоДокумента
	|		ИНАЧЕ ДокументыОснования.Ссылка.Дата
	|	КОНЕЦ КАК ДатаСведений,
	|	ВЫБОР
	|		КОГДА ДокументыОснования.Ссылка.Контрагент.ОбособленноеПодразделение
	|				И ДокументыОснования.Ссылка.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА ДокументыОснования.Ссылка.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ ДокументыОснования.Ссылка.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ДокументыОснования.Ссылка.КППКонтрагента КАК КППСчетаФактуры,
	|	ЛОЖЬ КАК УдалитьПрефиксыИзНомера,
	|	ЛОЖЬ КАК ЭтоСчетФактураВыданный,
	|	ИСТИНА КАК ВыводитьСуммуБезНДС,
	|	ДокументыОснования.ДокументОснование КАК ДокументОснование,
	|	ДокументыОснования.НомерСтроки КАК НомерСтроки,
	|	"""" КАК ИдентификаторГосКонтракта
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК ДокументыОснования
	|ГДЕ
	|	ДокументыОснования.Ссылка В(&МассивОбъектов)
	|	И &УсловиеПоДате
	|	И ДокументыОснования.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	СчетФактура,
	|	НомерСтроки
	|ИТОГИ
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(ВидСчетаФактуры),
	|	МАКСИМУМ(СчетФактураБезНДС),
	|	МАКСИМУМ(Исправление),
	|	МАКСИМУМ(НомерИсправления),
	|	МАКСИМУМ(ДатаИсправления),
	|	МАКСИМУМ(НомерИсправленияКорректировочного),
	|	МАКСИМУМ(ДатаИсправленияКорректировочного),
	|	МАКСИМУМ(УдалитьПрефиксыИзНомера),
	|	МАКСИМУМ(ЭтоСчетФактураВыданный),
	|	МАКСИМУМ(ВыводитьСуммуБезНДС)
	|ПО
	|	СчетФактура";
	
	Если ИспользуетсяПостановлениеНДС1137 Тогда
		Если ИспользуетсяПостановлениеНДС952 Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДате",
				"ДокументыОснования.Ссылка.Дата >= ДАТАВРЕМЯ(2013,11,6)");
		Иначе	
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДате",
				"ДокументыОснования.Ссылка.Дата МЕЖДУ &НачалоПримененияПостановления1137 И ДАТАВРЕМЯ(2013,11,5,23,59,59)");
		КонецЕсли; 
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеПоДате",
			"ДокументыОснования.Ссылка.Дата < &НачалоПримененияПостановления1137");
	КонецЕсли;
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
КонецФункции 

Функция ТекстЗапросаДанныеДляПечатиСчетовФактур(НомераТаблиц) Экспорт

	НомераТаблиц.Вставить("ВТ_Реквизиты",				НомераТаблиц.Количество());
	НомераТаблиц.Вставить("Реквизиты",					НомераТаблиц.Количество());
	НомераТаблиц.Вставить("ВременнаяТаблицаДокумента",	НомераТаблиц.Количество());
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Реквизиты.Дата,
	|	Реквизиты.Организация,
	|	Реквизиты.Контрагент КАК Контрагент,
	|	ВЫБОР
	|		КОГДА НЕ Реквизиты.Продавец = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	|			ТОГДА Реквизиты.Продавец
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ КАК Поставщик,
	|	Реквизиты.ДоговорКонтрагента,
	|	Реквизиты.ВалютаДокумента
	|ПОМЕСТИТЬ ВТ_Реквизиты
	|ИЗ
	|	Документ.СчетФактураПолученный КАК Реквизиты
	|ГДЕ
	|	Реквизиты.Ссылка = &ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Реквизиты.Дата КАК ДатаОснования,
	|	Реквизиты.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА Реквизиты.Контрагент.ОбособленноеПодразделение
	|				И Реквизиты.Контрагент.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Контрагент.ГоловнойКонтрагент
	|		ИНАЧЕ Реквизиты.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	&ПустоеПодразделение КАК Подразделение,
	|	"""" КАК ЦифровойИндексОбособленногоПодразделения,
	|	ВЫБОР
	|		КОГДА Реквизиты.Поставщик.ОбособленноеПодразделение
	|				И Реквизиты.Поставщик.ГоловнойКонтрагент.СтранаРегистрации = ЗНАЧЕНИЕ(Справочник.СтраныМира.Россия)
	|			ТОГДА Реквизиты.Поставщик.ГоловнойКонтрагент
	|		ИНАЧЕ Реквизиты.Поставщик
	|	КОНЕЦ КАК Поставщик,
	|	Реквизиты.Поставщик.ИНН КАК ИННпоставщика,
	|	Реквизиты.Поставщик КАК ОбособленноеПодразделениеПоставщика,
	|	""он же"" КАК Грузоотправитель,
	|	ВЫБОР
	|		КОГДА Реквизиты.Организация.ОбособленноеПодразделение
	|			ТОГДА Реквизиты.Организация.ГоловнаяОрганизация
	|		ИНАЧЕ Реквизиты.Организация
	|	КОНЕЦ КАК Покупатель,
	|	Реквизиты.Организация.ИНН КАК ИННпокупателя,
	|	Реквизиты.Организация КАК ОбособленноеПодразделениеПокупателя,
	|	Реквизиты.Организация КАК Грузополучатель,
	|	Реквизиты.ВалютаДокумента КАК Валюта,
	|	Реквизиты.ДоговорКонтрагента.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	Реквизиты.ДоговорКонтрагента.РасчетыВУсловныхЕдиницах КАК РасчетыВУсловныхЕдиницах,
	|	Реквизиты.ДоговорКонтрагента.ВидДоговора КАК ВидДоговора,
	|	Реквизиты.ДоговорКонтрагента.Представление КАК Основание,
	|	Реквизиты.ДоговорКонтрагента.Дата КАК ОснованиеДата,
	|	Реквизиты.ДоговорКонтрагента.Номер КАК ОснованиеНомер,
	|	ЛОЖЬ КАК ЕстьТовары,
	|	"""" КАК АдресДоставки,
	|	"""" КАК СведенияОТранспортировкеИГрузе,
	|	НЕОПРЕДЕЛЕНО КАК ОтветственныйЗаОформление,
	|	"""" КАК СопроводительныеДокументы,
	|	НЕОПРЕДЕЛЕНО КАК Перевозчик,
	|	ЛОЖЬ КАК ПеревозкаАвтотранспортом
	|ИЗ
	|	ВТ_Реквизиты КАК Реквизиты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	1 КАК НомерТабЧасти,
	|	ТаблицаТовары.НомерСтроки КАК НомерСтроки,
	|	"""" КАК Товар,
	|	"""" КАК ТоварКод,
	|	"""" КАК ТоварАртикул,
	|	"""" КАК ТоварНаименование,
	|	"""" КАК СтранаПроисхождения,
	|	"""" КАК ПредставлениеСтраны,
	|	"""" КАК НомерГТД,
	|	"""" КАК ПредставлениеГТД,
	|	"""" КАК ЕдиницаИзмерения,
	|	0 КАК Количество,
	|	0 КАК Цена,
	|	ТаблицаТовары.Сумма КАК Сумма,
	|	ТаблицаТовары.СуммаНДС КАК СуммаНДС,
	|	ТаблицаТовары.СтавкаНДС КАК СтавкаНДС,
	|	ЛОЖЬ КАК ЭтоУслуга,
	|	ИСТИНА КАК СуммаВключаетНДС,
	|	ТаблицаТовары.Ссылка КАК Ссылка,
	|	ЛОЖЬ КАК ЭтоКомиссия,
	|	ТаблицаТовары.Сумма КАК ВсегоРуб,
	|	ТаблицаТовары.СуммаНДС КАК НДСРуб,
	|	ТаблицаТовары.Сумма - ТаблицаТовары.СуммаНДС КАК СуммаБезНДСРуб,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК КонтрагентСводныйСФ,
	|	НЕОПРЕДЕЛЕНО КАК ПериодичностьУслуги
	|ПОМЕСТИТЬ ТаблицаДокумента
	|ИЗ
	|	Документ.СчетФактураПолученный.Авансы КАК ТаблицаТовары
	|ГДЕ
	|	ТаблицаТовары.Ссылка = &ДокументОснование
	|	И (ТаблицаТовары.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|			ИЛИ ТаблицаТовары.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАвансКомитента))";
	
	Возврат ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();

КонецФункции

Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Соответствие;
	Результат.Вставить("Информация",              "Контрагент");
	Результат.Вставить("Номер,",                  "Таб.ПредставлениеНомера");
	Результат.Вставить("НомерВходящегоДокумента", "НомерВходящегоДокумента");
	Результат.Вставить("ДатаВходящегоДокумента",  "ДатаВходящегоДокумента");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

// Открываемая форма документа определяется в зависимости от указанного вида счета-фактуры
//
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаСписка"
		ИЛИ ВидФормы = "ФормаВыбора" Тогда
		Возврат;
	КонецЕсли;
	
	ИсправлениеСобственнойОшибки = Ложь;
	БланкСтрогойОтчетности = Ложь;
	
	Если Параметры.Свойство("Ключ") И ЗначениеЗаполнено(Параметры.Ключ) Тогда
		РеквизитыСчетаФактуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			Параметры.Ключ, "ВидСчетаФактуры, БланкСтрогойОтчетности, ИсправлениеСобственнойОшибки");
		ВидСчетаФактуры             = РеквизитыСчетаФактуры.ВидСчетаФактуры;
		БланкСтрогойОтчетности      = РеквизитыСчетаФактуры.БланкСтрогойОтчетности;
		ИсправлениеСобственнойОшибки = РеквизитыСчетаФактуры.ИсправлениеСобственнойОшибки;
	ИначеЕсли Параметры.Свойство("ЗначенияЗаполнения") 
		И ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура")
		И Параметры.ЗначенияЗаполнения.Свойство("ВидСчетаФактуры") Тогда 
		ВидСчетаФактуры = Параметры.ЗначенияЗаполнения.ВидСчетаФактуры;
		Если Параметры.ЗначенияЗаполнения.Свойство("ИсправлениеСобственнойОшибки") Тогда 
			ИсправлениеСобственнойОшибки = Параметры.ЗначенияЗаполнения.ИсправлениеСобственнойОшибки;
		КонецЕсли;
	ИначеЕсли Параметры.Свойство("ЗначениеКопирования") 
		И ЗначениеЗаполнено(Параметры.ЗначениеКопирования)
		И ТипЗнч(Параметры.ЗначениеКопирования) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда 
		ВидСчетаФактуры = Параметры.ЗначениеКопирования.ВидСчетаФактуры;
	ИначеЕсли Параметры.Свойство("Основание") 
		И ЗначениеЗаполнено(Параметры.Основание) Тогда
		ВидСчетаФактуры = УчетНДСПереопределяемый.ОпределитьВидСчетаФактурыПолученногоПоТипуОснования(Параметры.Основание);
		Если Параметры.Свойство("ИсправлениеСобственнойОшибки") Тогда 
			ИсправлениеСобственнойОшибки = Параметры.ИсправлениеСобственнойОшибки;
		КонецЕсли;
	Иначе
		ВидСчетаФактуры = Неопределено;
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	Если ВидСчетаФактуры = Неопределено Тогда
		ВыбраннаяФорма = "ФормаДокумента";
	ИначеЕсли ИсправлениеСобственнойОшибки Тогда
		ВыбраннаяФорма = "ФормаДокументаИсправлениеСобственнойОшибки";
	ИначеЕсли ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.НаАванс Тогда
		ВыбраннаяФорма = "ФормаДокументаНаАванс";
	ИначеЕсли ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.НаАвансКомитента Тогда
		ВыбраннаяФорма = "ФормаДокументаНаАванс";
	ИначеЕсли ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.Корректировочный Тогда
		ВыбраннаяФорма = "ФормаДокументаКорректировочный";
	ИначеЕсли БланкСтрогойОтчетности Тогда
		ВыбраннаяФорма = "ФормаДокументаБланкСтрогойОтчетности";
	Иначе
		ВыбраннаяФорма = "ФормаДокументаНаПоступление";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СозданиеАктуализацияСчетаФактуры

Функция СоздатьДокументНаОсновании(Основание, НомерСчетаФактурыПолученного, ДатаСчетаФактурыПолученного, Продавец = Неопределено) Экспорт
	
	СчетФактура = Документы.СчетФактураПолученный.СоздатьДокумент();
	
	СчетФактура.Заполнить(Основание);
	
	СчетФактура.НомерВходящегоДокумента = НомерСчетаФактурыПолученного;
	СчетФактура.ДатаВходящегоДокумента = ДатаСчетаФактурыПолученного;
	СчетФактура.Дата = Макс(ДатаСчетаФактурыПолученного, Основание.Дата);
	
	Если ЗначениеЗаполнено(Продавец) Тогда
		СчетФактура.Продавец = Продавец;
	КонецЕсли;
	
	РежимЗаписи = ?(Основание.Проведен, 
		РежимЗаписиДокумента.Проведение, 
		РежимЗаписиДокумента.Запись);
	
	СчетФактура.Записать(РежимЗаписи);
	
	Возврат СчетФактура.Ссылка;
	
КонецФункции

Функция СоздатьДокументНаОснованииИсправления(Основание, НомерИсправления, ДатаИсправления) Экспорт
	
	СчетФактура = Документы.СчетФактураПолученный.СоздатьДокумент();
	
	СчетФактура.Заполнить(Основание);
	
	СчетФактура.НомерИсправления = НомерИсправления;
	СчетФактура.ДатаИсправления = ДатаИсправления;
	СчетФактура.Дата = Макс(ДатаИсправления, Основание.Дата);
	
	РежимЗаписи = ?(Основание.Проведен, 
		РежимЗаписиДокумента.Проведение, 
		РежимЗаписиДокумента.Запись);
	
	СчетФактура.Записать(РежимЗаписи);
	
	Возврат СчетФактура.Ссылка;
	
КонецФункции

// Создает или актуализирует счет-фактуру с признаком "Исправление собственной ошибки"
//
// Параметры:
//   Параметры - Структура - структура входных параметров с ключами:
//     * ДокументОснование         - ДокументСсылка.КорректировкаПоступления - основание создаваемого (актуализируемого) счета-фактуры
//     * СчетФактураИсправляемый   - ДокументСсылка.СчетФактураПолученный - исправляемый счет-фактура, 
//                                   тот в котором допустили ошибку ввода, 
//     * СчетФактура               - ДокументСсылка.СчетФактураПолученный - актуализируемый счет-фактура
//                                   если значение не заполнено - будет создан
//     * НомерСчетаФактуры         - Строка, Число - номер входящего счета-фактуры или номер исправления
//     * ДатаСчетаФактуры          - Дата          - дата входящего счета-фактуры или дата исправления
//     * КодВидаОперации           - Срока
//     * ИННКонтрагентаДоИзменения - Строка 10 или 12 символов
//     * КППКонтрагентаДоИзменения - Строка 9 символов
//     * ИННКонтрагента            - Строка 10 или 12 символов
//     * КППКонтрагента            - Строка 9 символов
//
// Возвращаемое значение:
//   ДокументСсылка.СчетФактураПолученный - ссылка на созданный или актуализированный документ
//
//
Функция СоздатьАктуализироватьИсправлениеСобственнойОшибки(Параметры) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Параметры.ДокументОснование)
		ИЛИ НЕ ЗначениеЗаполнено(Параметры.СчетФактураИсправляемый) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("СчетФактураИсправляемый", Параметры.СчетФактураИсправляемый);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетФактураПолученный.Организация,
	|	СчетФактураПолученный.ВидСчетаФактуры,
	|	СчетФактураПолученный.Контрагент,
	|	СчетФактураПолученный.ДоговорКонтрагента,
	|	СчетФактураПолученный.НомерВходящегоДокумента,
	|	СчетФактураПолученный.ДатаВходящегоДокумента,
	|	СчетФактураПолученный.Исправление,
	|	СчетФактураПолученный.НомерИсправления,
	|	СчетФактураПолученный.ДатаИсправления,
	|	СчетФактураПолученный.КодВидаОперации,
	|	СчетФактураПолученный.КодВидаОперацииНаУменьшение,
	|	СчетФактураПолученный.ВалютаДокумента,
	|	СчетФактураПолученный.Продавец
	|ИЗ
	|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|ГДЕ
	|	СчетФактураПолученный.Ссылка = &СчетФактураИсправляемый";
	
	ДанныеИсходногоСчетаФактуры = Запрос.Выполнить();
	Если ДанныеИсходногоСчетаФактуры.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТаблицаИсходногоСчетаФактуры = ДанныеИсходногоСчетаФактуры.Выгрузить();
	РеквизитыИсходногоСчетаФактуры = ТаблицаИсходногоСчетаФактуры[0];
	
	РеквизитыДокументаОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Параметры.ДокументОснование,
		"Дата,Проведен,ДокументПоступления");
	
	Если ЗначениеЗаполнено(Параметры.СчетФактура) Тогда
		СчетФактура = Параметры.СчетФактура.ПолучитьОбъект();
	Иначе
		
		// Возможно исходный счет-фактура был введен к нескольким документам поступления
		// такой счет-фактура исправляется несколькими корректировками поступления
		// перед созданием нового счета-фактуры необходимо убедиться, что серия исправлений
		// уже не начата - поискать счет-фактуру с признаком "Исправление собственной ошибки"
		// у которого "ИсправляемыйСчетФактура" равен исходному,
		// но при этом исправляемый документ поступления другой.
		
		Запрос.УстановитьПараметр("ИсправляемыйДокументПоступления", РеквизитыДокументаОснования.ДокументПоступления);
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	СчетФактураПолученный.Ссылка КАК РанееСозданныйСчетФактура
		|ПОМЕСТИТЬ РанееСозданныеСчетаФактуры
		|ИЗ
		|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
		|ГДЕ
		|	СчетФактураПолученный.ИсправлениеСобственнойОшибки
		|	И СчетФактураПолученный.ИсправляемыйСчетФактура = &СчетФактураИсправляемый
		|	И НЕ СчетФактураПолученный.ПометкаУдаления
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	РанееСозданныйСчетФактура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	РанееСозданныеСчетаФактуры.РанееСозданныйСчетФактура
		|ИЗ
		|	Документ.СчетФактураПолученный.ДокументыОснования КАК ДокументыОснования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаПоступления КАК КорректировкаПоступления
		|		ПО ДокументыОснования.ДокументОснование = КорректировкаПоступления.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РанееСозданныеСчетаФактуры КАК РанееСозданныеСчетаФактуры
		|		ПО ДокументыОснования.Ссылка = РанееСозданныеСчетаФактуры.РанееСозданныйСчетФактура
		|ГДЕ
		|	КорректировкаПоступления.ДокументПоступления <> &ИсправляемыйДокументПоступления";
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			СчетФактура = Документы.СчетФактураПолученный.СоздатьДокумент();
		Иначе
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			СчетФактура = Выборка.РанееСозданныйСчетФактура.ПолучитьОбъект();
		КонецЕсли;
		
		// Перенесем продавцов из исправляемого счета-фактуры
		Запрос.Текст = ТекстЗапросаПродавцыПоИсправляемомуСчетуФактуре();
		
		Продавцы = Запрос.Выполнить().Выгрузить();
		Для Каждого ПродавецИсходный Из Продавцы Цикл
			НоваяСтрока = СчетФактура.Продавцы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ПродавецИсходный);
		КонецЦикла;
		
	КонецЕсли;
	
	// Общие свойства
	СчетФактура.ИсправлениеСобственнойОшибки = Истина;
	СчетФактура.ИсправляемыйСчетФактура = Параметры.СчетФактураИсправляемый;
	
	// Заполним новый документ на основании исправляемого
	ЗаполнитьЗначенияСвойств(СчетФактура, РеквизитыИсходногоСчетаФактуры);
	
	СчетФактура.НомерВходящегоДокументаДоИзменения     = РеквизитыИсходногоСчетаФактуры.НомерВходящегоДокумента;
	СчетФактура.ДатаВходящегоДокументаДоИзменения      = РеквизитыИсходногоСчетаФактуры.ДатаВходящегоДокумента;
	СчетФактура.НомерИсправленияДоИзменения            = РеквизитыИсходногоСчетаФактуры.НомерИсправления;
	СчетФактура.ДатаИсправленияДоИзменения             = РеквизитыИсходногоСчетаФактуры.ДатаИсправления;
	СчетФактура.КодВидаОперацииДоИзменения             = РеквизитыИсходногоСчетаФактуры.КодВидаОперации;
	СчетФактура.КодВидаОперацииНаУменьшениеДоИзменения = РеквизитыИсходногоСчетаФактуры.КодВидаОперацииНаУменьшение;
	
	// Реквизиты, введенные в корректировке поступления
	Если РеквизитыИсходногоСчетаФактуры.Исправление Тогда
		СчетФактура.НомерИсправления = Параметры.НомерСчетаФактуры;
		СчетФактура.ДатаИсправления  = Параметры.ДатаСчетаФактуры;
	Иначе
		СчетФактура.НомерВходящегоДокумента = Параметры.НомерСчетаФактуры;
		СчетФактура.ДатаВходящегоДокумента  = Параметры.ДатаСчетаФактуры;
	КонецЕсли;
	
	СчетФактура.КодВидаОперации             = Параметры.КодВидаОперации;
	СчетФактура.КодВидаОперацииНаУменьшение = Параметры.КодВидаОперацииНаУменьшение;
	СчетФактура.ИННКонтрагента              = Параметры.ИННКонтрагента;
	СчетФактура.КППКонтрагента              = Параметры.КППКонтрагента;
	СчетФактура.ИННКонтрагентаДоИзменения   = Параметры.ИННКонтрагентаДоИзменения;
	СчетФактура.КППКонтрагентаДоИзменения   = Параметры.КППКонтрагентаДоИзменения;
	
	// Документ-основание
	// Исключим повторное добавление основания при актуализации
	Если СчетФактура.ДокументыОснования.Количество() = 0
		ИЛИ СчетФактура.ДокументыОснования.Найти(Параметры.ДокументОснование, "ДокументОснование") = Неопределено Тогда
		
		СтрокаОснования = СчетФактура.ДокументыОснования.Добавить();
		СтрокаОснования.ДокументОснование = Параметры.ДокументОснование;
		
		// Если ошибка исправляется в корректировочном счете-фактуре определим реквизиты корректируемого счета-фактуры
		Если РеквизитыИсходногоСчетаФактуры.ВидСчетаФактуры = Перечисления.ВидСчетаФактурыПолученного.Корректировочный Тогда
			
			Запрос.УстановитьПараметр("ИсправляемыйДокументПоступления", РеквизитыДокументаОснования.ДокументПоступления);
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДокументыОснования.НомерИсходногоДокумента,
			|	ДокументыОснования.ДатаИсходногоДокумента,
			|	ДокументыОснования.УчитыватьИсправлениеИсходногоДокумента,
			|	ДокументыОснования.НомерИсправленияИсходногоДокумента,
			|	ДокументыОснования.ДатаИсправленияИсходногоДокумента
			|ИЗ
			|	Документ.СчетФактураПолученный.ДокументыОснования КАК ДокументыОснования
			|ГДЕ
			|	ДокументыОснования.Ссылка = &СчетФактураИсправляемый
			|	И ДокументыОснования.ДокументОснование = &ИсправляемыйДокументПоступления";
			Результат = Запрос.Выполнить();
			Если НЕ Результат.Пустой() Тогда
				РеквизитыКорректируемогоСчетаФактуры = Результат.Выгрузить();
				ЗаполнитьЗначенияСвойств(СтрокаОснования, РеквизитыКорректируемогоСчетаФактуры[0]);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	СчетФактура.Дата = РеквизитыДокументаОснования.Дата;
	РежимЗаписи = ?(РеквизитыДокументаОснования.Проведен, 
		РежимЗаписиДокумента.Проведение, 
		РежимЗаписиДокумента.Запись);
	
	СчетФактура.Записать(РежимЗаписи);
	
	Возврат СчетФактура.Ссылка;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиОбновления

// Обработчик обновления 3.0.23.7
//
// Отбираются все счета-фактуры полученные - исправления поступления и корректировочные
// у которых не заполнен реквизит ИсправляемыйСчетФактура для установки значения данного реквизита 
// Необходимо при переходе с 2.0 в случае когда исправлялся документ поступления
Процедура ОбработатьСчетаФактурыИзПредыдущейВерсии() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетФактураПолученный.Ссылка
	|ИЗ
	|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|ГДЕ
	|	ВЫБОР
	|			КОГДА СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление)
	|						И СчетФактураПолученный.Исправление
	|					ИЛИ СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|				ТОГДА ВЫБОР
	|						КОГДА СчетФактураПолученный.ИсправляемыйСчетФактура = ЗНАЧЕНИЕ(Документ.СчетФактураПолученный.ПустаяСсылка)
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ЛОЖЬ
	|					КОНЕЦ
	|			ИНАЧЕ ЛОЖЬ
	|		КОНЕЦ
	|	И СчетФактураПолученный.ПометкаУдаления = ЛОЖЬ";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ОбрабатываемыйСчетФактура = Выборка.Ссылка;
			
			Если ОбрабатываемыйСчетФактура.ДокументыОснования.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ОбъектСчетФактура = ОбрабатываемыйСчетФактура.ПолучитьОбъект();
			
			Если ТипЗнч(ОбъектСчетФактура.ДокументыОснования[0].ДокументОснование) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
				РезультатПоискаИсправляемыйСчетФактура = УчетНДСПереопределяемый.НайтиПодчиненныйСчетФактуруПолученный(
				ОбъектСчетФактура.ДокументыОснования[0].ДокументОснование.ИсправляемыйДокументПоступления);
				Если РезультатПоискаИсправляемыйСчетФактура = Неопределено Тогда
					РезультатПоискаИсправляемыйСчетФактура = Документы.СчетФактураВыданный.ПустаяСсылка();
				КонецЕсли;
			Иначе
				РезультатПоискаИсправляемыйСчетФактура = Документы.СчетФактураПолученный.ПустаяСсылка();
			КонецЕсли;
			
			ОбъектСчетФактура.ИсправляемыйСчетФактура = РезультатПоискаИсправляемыйСчетФактура;
			ОбъектСчетФактура.ОбменДанными.Загрузка = Истина;
			
			НачатьТранзакцию();
			
			Попытка
				ОбъектСчетФактура.Записать();
			Исключение
				ТекстОшибки = НСтр("ru = 'Не удалось записать документ.
                                    |%1'");
				ОписаниеОшибки = СтрШаблон(ТекстОшибки, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ЗаписьЖурналаРегистрации(
					ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
					УровеньЖурналаРегистрации.Ошибка,
					ОбъектСчетФактура.Метаданные(),
					ОбъектСчетФактура.Ссылка, 
					ОписаниеОшибки);
					
				ОтменитьТранзакцию();
			КонецПопытки;
			
			ЗафиксироватьТранзакцию();
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

// Обработчик обновления 3.0.24.1
//
// Для всех счетов-фактур полученных устанавливается реквизит ПредставлениеНомера
// Для корректировочных счетов-фактур переопределяется СуммаДокумента и СуммаНДСДокумента
Процедура ОбработатьНомераИСуммыСчетаФактуры() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА КорректировкаПоступленияТовары.Ссылка.СуммаВключаетНДС
	|				ТОГДА КорректировкаПоступленияТовары.Сумма
	|			ИНАЧЕ КорректировкаПоступленияТовары.Сумма + КорректировкаПоступленияТовары.СуммаНДС
	|		КОНЕЦ) КАК СуммаДокумента,
	|	СУММА(КорректировкаПоступленияТовары.СуммаНДС) КАК СуммаНДСДокумента,
	|	КорректировкаПоступленияТовары.Ссылка КАК Документ
	|ПОМЕСТИТЬ ВТ_ОснованияКоррСФ
	|ИЗ
	|	Документ.КорректировкаПоступления.Товары КАК КорректировкаПоступленияТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаПоступленияТовары.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА КорректировкаПоступленияУслуги.Ссылка.СуммаВключаетНДС
	|				ТОГДА КорректировкаПоступленияУслуги.Сумма
	|			ИНАЧЕ КорректировкаПоступленияУслуги.Сумма + КорректировкаПоступленияУслуги.СуммаНДС
	|		КОНЕЦ),
	|	СУММА(КорректировкаПоступленияУслуги.СуммаНДС),
	|	КорректировкаПоступленияУслуги.Ссылка
	|ИЗ
	|	Документ.КорректировкаПоступления.Услуги КАК КорректировкаПоступленияУслуги
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаПоступленияУслуги.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СУММА(ВЫБОР
	|			КОГДА КорректировкаПоступленияАгентскиеУслуги.Ссылка.СуммаВключаетНДС
	|				ТОГДА КорректировкаПоступленияАгентскиеУслуги.Сумма
	|			ИНАЧЕ КорректировкаПоступленияАгентскиеУслуги.Сумма + КорректировкаПоступленияАгентскиеУслуги.СуммаНДС
	|		КОНЕЦ),
	|	СУММА(КорректировкаПоступленияАгентскиеУслуги.СуммаНДС),
	|	КорректировкаПоступленияАгентскиеУслуги.Ссылка
	|ИЗ
	|	Документ.КорректировкаПоступления.АгентскиеУслуги КАК КорректировкаПоступленияАгентскиеУслуги
	|
	|СГРУППИРОВАТЬ ПО
	|	КорректировкаПоступленияАгентскиеУслуги.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Документ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураПолученныйДокументыОснования.Ссылка КАК Ссылка,
	|	СУММА(ЕСТЬNULL(ВТ_ОснованияКоррСФ.СуммаНДСДокумента, 0)) КАК СуммаНДСДокумента,
	|	СУММА(ЕСТЬNULL(ВТ_ОснованияКоррСФ.СуммаДокумента, 0)) КАК СуммаДокумента
	|ПОМЕСТИТЬ ВТ_СуммыКорректировочныхСФ
	|ИЗ
	|	Документ.СчетФактураПолученный.ДокументыОснования КАК СчетФактураПолученныйДокументыОснования
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОснованияКоррСФ КАК ВТ_ОснованияКоррСФ
	|		ПО СчетФактураПолученныйДокументыОснования.ДокументОснование = ВТ_ОснованияКоррСФ.Документ
	|ГДЕ
	|	СчетФактураПолученныйДокументыОснования.Ссылка.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|
	|СГРУППИРОВАТЬ ПО
	|	СчетФактураПолученныйДокументыОснования.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетФактураПолученный.Ссылка,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|			ТОГДА ВТ_СуммыКорректировочныхСФ.СуммаНДСДокумента
	|		ИНАЧЕ СчетФактураПолученный.СуммаНДСДокумента
	|	КОНЕЦ КАК СуммаНДСДокументаПосле,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|			ТОГДА ВТ_СуммыКорректировочныхСФ.СуммаДокумента
	|		ИНАЧЕ СчетФактураПолученный.СуммаДокумента
	|	КОНЕЦ КАК СуммаДокументаПосле,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Корректировочный,
	|	СчетФактураПолученный.СуммаДокумента КАК СуммаДокументаДо,
	|	СчетФактураПолученный.СуммаНДСДокумента КАК СуммаНДСДокументаДо,
	|	СчетФактураПолученный.ПредставлениеНомера
	|ПОМЕСТИТЬ ВТ_СчетаФактурыПредварительная
	|ИЗ
	|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммыКорректировочныхСФ КАК ВТ_СуммыКорректировочныхСФ
	|		ПО (ВТ_СуммыКорректировочныхСФ.Ссылка = СчетФактураПолученный.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СчетаФактурыПредварительная.Ссылка,
	|	ВТ_СчетаФактурыПредварительная.СуммаНДСДокументаПосле КАК СуммаНДСДокумента,
	|	ВТ_СчетаФактурыПредварительная.СуммаДокументаПосле КАК СуммаДокумента,
	|	ВТ_СчетаФактурыПредварительная.Корректировочный
	|ИЗ
	|	ВТ_СчетаФактурыПредварительная КАК ВТ_СчетаФактурыПредварительная
	|ГДЕ
	|	(ВТ_СчетаФактурыПредварительная.ПредставлениеНомера = """"
	|			ИЛИ ВТ_СчетаФактурыПредварительная.СуммаДокументаДо <> ВТ_СчетаФактурыПредварительная.СуммаДокументаПосле
	|			ИЛИ ВТ_СчетаФактурыПредварительная.СуммаНДСДокументаДо <> ВТ_СчетаФактурыПредварительная.СуммаНДСДокументаПосле)";
	
	Результат = Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ОбрабатываемыйСчетФактура = Выборка.Ссылка;
			
			ОбъектСчетФактура = ОбрабатываемыйСчетФактура.ПолучитьОбъект();
			
			Если Выборка.Корректировочный Тогда
				ЗаполнитьЗначенияСвойств(ОбъектСчетФактура, Выборка); 
			КонецЕсли;
			
			ОбъектСчетФактура.ОбменДанными.Загрузка = Истина;
			
			НачатьТранзакцию();
			
			Попытка
				ОбъектСчетФактура.Записать();
			Исключение
				ТекстОшибки = НСтр("ru = 'Не удалось записать документ.
                                    |%1'");
				ОписаниеОшибки = СтрШаблон(ТекстОшибки, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
				ЗаписьЖурналаРегистрации(
					ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
					УровеньЖурналаРегистрации.Ошибка,
					ОбъектСчетФактура.Метаданные(),
					ОбъектСчетФактура.Ссылка, 
					ОписаниеОшибки);
					
				ОтменитьТранзакцию();
			КонецПопытки;
			
			ЗафиксироватьТранзакцию();
			
		КонецЦикла;
		
	КонецЕсли;

КонецПроцедуры

// Обработчик обновления
//
//Устанавливает новый код вида операции для сводных счетов-фактур по комиссии
Процедура УстановитьКодВидаОперацииСводныйКомиссионный() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетФактураПолученный.Ссылка КАК Ссылка,
	|	""27"" КАК КодВидаОперации,
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.КодВидаОперации = ""27""
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК КодУстановлен
	|ИЗ
	|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|ГДЕ
	|	(СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление)
	|			ИЛИ СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный))
	|	И СчетФактураПолученный.ПометкаУдаления = ЛОЖЬ
	|	И СчетФактураПолученный.СводныйКомиссионный = ИСТИНА
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетФактураПолученный.Ссылка,
	|	""28"",
	|	ВЫБОР
	|		КОГДА СчетФактураПолученный.КодВидаОперации = ""28""
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ
	|ИЗ
	|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|ГДЕ
	|	(СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАванс)
	|			ИЛИ СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаАвансКомитента))
	|	И СчетФактураПолученный.ПометкаУдаления = ЛОЖЬ
	|	И СчетФактураПолученный.СводныйКомиссионный = ИСТИНА
	|ИТОГИ
	|	СУММА(КодУстановлен)
	|ПО
	|	ОБЩИЕ";
	
	ВыборкаИтоги = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаИтоги.Следующий()
		И ВыборкаИтоги.КодУстановлен = 0 Тогда
		ВыборкаДокументы = ВыборкаИтоги.Выбрать();
		Пока ВыборкаДокументы.Следующий() Цикл
			СчетФактураДокумент = ВыборкаДокументы.Ссылка.ПолучитьОбъект();
			СчетФактураДокумент.КодВидаОПерации = ВыборкаДокументы.КодВидаОперации;
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СчетФактураДокумент);
		КонецЦикла;
	Иначе
		Возврат;
	КонецЕсли;
		
КонецПроцедуры

// Обработчик обновления 3.0.39.58
// Устанавливает реквизит "Код вида операции" документов "Счет-фактура полученный" в значение "99"
// если в договоре с контрагентом установлено свойство 
// "Поставщик по договору предъявляет НДС по ставкам 4% и 2%" 
// и дата входящего документа ранее 1 января 2015 года
Процедура ОбработатьНалоговыеНакладные() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СчетФактураПолученный.Ссылка КАК СчетФактура
	|ИЗ
	|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО СчетФактураПолученный.ДоговорКонтрагента = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	СчетФактураПолученный.КодВидаОперации = ""01""
	|	И НЕ СчетФактураПолученный.ПометкаУдаления
	|	И СчетФактураПолученный.Проведен
	|	И СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.НаПоступление)
	|	И ДоговорыКонтрагентов.НДСПоСтавкам4и2
	|	И СчетФактураПолученный.ДатаВходящегоДокумента < ДАТАВРЕМЯ(2015, 1, 1)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СчетФактураОбъект = Выборка.СчетФактура.ПолучитьОбъект();
		СчетФактураОбъект.КодВидаОперации = "99";
		
		Попытка
			ОбновлениеИнформационнойБазы.ЗаписатьОбъект(СчетФактураОбъект);
		Исключение
			
			ТекстОшибки = НСтр("ru = 'Не удалось обновить код вида операции.
                                |%1'");
			ОписаниеОшибки = СтрШаблон(ТекстОшибки, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			
			ЗаписьЖурналаРегистрации(
				ОбновлениеИнформационнойБазы.СобытиеЖурналаРегистрации(), 
				УровеньЖурналаРегистрации.Ошибка,
				СчетФактураОбъект.Метаданные(),
				СчетФактураОбъект.Ссылка, 
				ОписаниеОшибки);
					
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Обработчик обновления 3.0.43.206
// заполняет новый реквизит "КодВидаОперацииНаУменьшение" для корректировочных счетов-фактур
// дата которых больше или равна 1 января 2015 года
Процедура УстановитьКодВидаОперацииНаУменьшение() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетФактураПолученный.Ссылка
	|ИЗ
	|	Документ.СчетФактураПолученный КАК СчетФактураПолученный
	|ГДЕ
	|	НЕ СчетФактураПолученный.ПометкаУдаления
	|	И СчетФактураПолученный.ВидСчетаФактуры = ЗНАЧЕНИЕ(Перечисление.ВидСчетаФактурыПолученного.Корректировочный)
	|	И СчетФактураПолученный.Дата >= ДАТАВРЕМЯ(2015, 1, 1)
	|	И СчетФактураПолученный.КодВидаОперацииНаУменьшение = """"";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		
		Выборка = Результат.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ОбрабатываемыйСчетФактура = Выборка.Ссылка;
			СчетФактураДокумент = ОбрабатываемыйСчетФактура.ПолучитьОбъект();
			
			СчетФактураДокумент.КодВидаОперацииНаУменьшение = "18";
			ОбновлениеИнформационнойБазы.ЗаписатьДанные(СчетФактураДокумент);
			
		КонецЦикла;
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли