#Область СлужебныеПроцедурыИФункции

Функция СтруктураШага(НомерШага) Экспорт

	СтруктураНавигации = Обработки.РегистрацияОрганизации.СтруктураНавигацииПомощника();
	Если СтруктураНавигации = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтруктураШага = СтруктураНавигации[ИмяШага(НомерШага)];
	Если СтруктураШага.ОпределятьИмяФормы Тогда
		ПараметрыФормы = СтруктураШага.СтруктураПараметровФормы;
		СтруктураШага.ИмяФормы = Обработки.РегистрацияОрганизации.ИмяФормыШага(ПараметрыФормы.НавигацияПараметрФормы);
	КонецЕсли;
	
	Возврат СтруктураШага;
	
КонецФункции

Функция ИмяШага(НомерШага)
	
	Возврат "Шаг" + НомерШага;
	
КонецФункции

#КонецОбласти

