Процедура ОпределитьВедениеУчетаВРазрезеНалоговыхОрганов(ВестиУчет) Экспорт
	
КонецПроцедуры

Процедура ОпределитьНалоговуюСтавку(Ставка, Организация, НалоговыйОрган, Дата) Экспорт
	
КонецПроцедуры

Процедура ЗаполнитьНалоговыеСтавкиРегиональныйБюджет(Ставки, Период, Организация, РегистрацииВНалоговомОргане) Экспорт
	
КонецПроцедуры

Процедура СоздатьТаблицуРегионов(МенеджерВременныхТаблиц, Организация, Период) Экспорт
	
КонецПроцедуры	

Процедура ОпределитьЕстьОбособленныеПодразделения(ЕстьПодразделения, Организация) Экспорт
	
КонецПроцедуры

Процедура ПроверитьНастроеныПолучателиДеклараций(Ошибки, Период, Организация) Экспорт
	
КонецПроцедуры

Процедура ДобавитьВидСубконтоРегистрацияВНалоговомОргане(ВидыСубконто) Экспорт
	
КонецПроцедуры

Процедура ПодготовитьТаблицуРасчетДолейБазыНалогаНаПрибыль(ТаблицаДолейБазыНалогаНаПрибыль, Знач Реквизиты, СписокОрганизаций) Экспорт
	
КонецПроцедуры

Процедура ПроведениеПересчетаОНАиОНОКаждыйМесяц(СтруктураШапкиДокумента, Движения, Отказ) Экспорт
	
КонецПроцедуры // ПроведениеПересчетаОНАиОНОКаждыйМесяц()

Процедура ПолучитьРасчетнуюСтавкуНалогаНаПрибыль(РасчетнаяСтавка, Организация, Дата) Экспорт
	
КонецПроцедуры

Процедура ПолучитьРаспределениеНалогаДляЗаполненияДекларации(Расчет, КонтекстРасчета) Экспорт
	
КонецПроцедуры

Процедура ЗаполнитьЛист2Приложение5ДекларацииПоПрибыли(Контейнер, ПараметрыОтчета, СписокОрганизаций, Лист02_Прил5) Экспорт
	
КонецПроцедуры

Процедура СписокОтчетовПоддерживаемыхПодсистемой(СписокОтчетов) Экспорт
	
КонецПроцедуры

Процедура ДополнитьСписокСправокРасчетов(Список) Экспорт
	
КонецПроцедуры	

Процедура ВыполнитьЗапросРасчетСтавкиНалогаНаПрибыльЗаМесяц(РезультатЗапроса, Организация, КонецПериода) Экспорт
	
КонецПроцедуры

Процедура ВыполнитьЗапросРасчетНалогаНаПрибыль(РезультатЗапроса, Организация, КонецПериода) Экспорт
	
КонецПроцедуры

Процедура ОпределитьСубконтоРегистрацияВНалоговомОргане(ЭтоСубконтоРегистрация, ВидСубконто) Экспорт
	
КонецПроцедуры