////////////////////////////////////////////////////////////////////////////////
// РасчетЗарплатыДляНебольшихОрганизаций: 
//  
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьУсловиеРасчетаЗарплатыДляНебольшихОрганизаций(Источник, Отказ, Замещение) Экспорт
	
	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(Источник) Тогда
		Возврат;
	КонецЕсли; 
	
	Если ПолучитьФункциональнуюОпцию("РасчетЗарплатыДляНебольшихОрганизаций") Тогда
		
		Если НЕ РасчетЗарплатыДляНебольшихОрганизаций.РасчетЗарплатыДляНебольшихОрганизацийВозможен() Тогда
			
			ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				РасчетЗарплатыДляНебольшихОрганизацийПереопределяемый.ТекстСообщенияОПревышенииМаксимальноДопустимогоКоличестваРаботающихСотрудников(),
				РасчетЗарплатыДляНебольшихОрганизаций.ПорогЗапрета());
				
			ВызватьИсключение ТекстИсключения;
			
		КонецЕсли;
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ДокументыПередЗаписью(Источник, Отказ) Экспорт
	
	Если НЕ Отказ И Источник.ЭтоНовый() Тогда
		
		ТекстИсключения = "";
		Если НЕ ПолучитьФункциональнуюОпцию("РасчетЗарплатыДляНебольшихОрганизаций") Тогда
			
			ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				РасчетЗарплатыДляНебольшихОрганизацийПереопределяемый.ТекстСообщенияОНевозможностиСоздаватьДокументыПриОтключеннойНастройке(),
				Источник.Метаданные().Синоним);
				
			Отказ = Истина
			
		ИначеЕсли НЕ РасчетЗарплатыДляНебольшихОрганизаций.РасчетЗарплатыДляНебольшихОрганизацийВозможен() Тогда
			
			ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				РасчетЗарплатыДляНебольшихОрганизацийПереопределяемый.ТекстСообщенияОНевозможностиСоздаватьДокументыПриПревышенииМаксимальноДопустимогоКоличестваРаботающихСотрудников(),
				РасчетЗарплатыДляНебольшихОрганизаций.ПорогЗапрета(),
				Источник.Метаданные().Синоним);
			
			Отказ = Истина;
			
		КонецЕсли;
		
		Если Отказ Тогда
			
			ВызватьИсключение ТекстИсключения;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриОтключенииНачисленияЗарплаты() Экспорт
	
	Константы.РасчетЗарплатыДляНебольшихОрганизаций.Установить(Ложь);
	
КонецПроцедуры

#КонецОбласти

