
#Область ПрограммныйИнтерфейс

Функция ОписаниеДействия(ПараметрыКоманды) Экспорт
	
	Возврат ВыполнениеЗадачБухгалтера.ОписаниеДействия(ПараметрыКоманды);
	
КонецФункции

Функция ПрекратитьВыполнение(Организация, Правило) Экспорт
	
	Если ЗначениеЗаполнено(Правило) Тогда
	
		ПравилоОбъект = Правило.ПолучитьОбъект();
		ПравилоОбъект.Выполняется = Ложь;
		ПравилоОбъект.Записать();
		
		Возврат РегистрыСведений.ЗадачиБухгалтера.УдалитьЗаписиПоПравилу(Организация, Правило);
		
	Иначе
		
		Возврат Ложь;
	
	КонецЕсли;
	
КонецФункции

Функция ПеренестиВАрхив(Знач ПараметрыКоманды) Экспорт
	
	КлючЗаписи = РегистрыСведений.ЗадачиБухгалтера.УстановитьСтатусВыполнено(ПараметрыКоманды);
	ИсторияРаботыПользователя.Добавить(КлючЗаписи);
	
	Возврат КлючЗаписи; // Для оповещения форм и пользователя
	
КонецФункции

Функция ЗарегистрироватьВЖурналеОткрытиеФормы(Знач ИмяФормы) Экспорт

	ТекстКомментария = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Открытие ""%1""'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
		ИмяФормы);

	ВыполнениеЗадачБухгалтера.ЗарегистрироватьСобытиеВЖурнале(ТекстКомментария);

КонецФункции

Функция ЗарегистрироватьВЖурналеПоказПредупреждения(Знач ТекстПредупреждения) Экспорт

	ТекстКомментария = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Показ предупреждения ""%1""'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
		ТекстПредупреждения);

	ВыполнениеЗадачБухгалтера.ЗарегистрироватьСобытиеВЖурнале(ТекстКомментария);

КонецФункции

Функция ЗарегистрироватьВЖурналеПереходПоСсылке(Знач Ссылка) Экспорт

	ТекстКомментария = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Переход по ссылке ""%1""'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
		Ссылка);

	ВыполнениеЗадачБухгалтера.ЗарегистрироватьСобытиеВЖурнале(ТекстКомментария);

КонецФункции

#КонецОбласти