Процедура УстановитьНомерСпецификации(СпецификацияОбъект, ЭтоНоваяСпецификация, Отказ) Экспорт
	
	Если ЭтоНоваяСпецификация Тогда // новая спецификация
		
		ЗарегистрироватьНовуюСпецификацию (СпецификацияОбъект, СпецификацияОбъект.ПолучитьСсылкуНового(), Отказ);	
		
	Иначе
		
		ИзменитьНомерСпецификации (СпецификацияОбъект, Отказ);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ИзменитьНомерСпецификации(СпецификацияОбъект, Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НумерацияСпецификацийДоговоров.НомерСпецификации,
	|	НумерацияСпецификацийДоговоров.НомерСпецификацииЧислом,
	|	НумерацияСпецификацийДоговоров.ДоговорКонтрагента
	|ИЗ
	|	РегистрСведений.НумерацияСпецификацийДоговоров КАК НумерацияСпецификацийДоговоров
	|ГДЕ
	|	НумерацияСпецификацийДоговоров.СпецификацияКДоговору = &СпецификацияКДоговору";
	
	Запрос.УстановитьПараметр("СпецификацияКДоговору", СпецификацияОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ЗарегистрироватьНовуюСпецификацию(СпецификацияОбъект, СпецификацияОбъект.Ссылка, Отказ);
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Если Выборка.ДоговорКонтрагента = СпецификацияОбъект.ДоговорКонтрагента и 
		Выборка.НомерСпецификации= СпецификацияОбъект.НомерСпецификации Тогда // данные не менялись
		Возврат; 
	Иначе
		
		НаборЗаписей = РегистрыСведений.НумерацияСпецификацийДоговоров.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДоговорКонтрагента.Установить(Выборка.ДоговорКонтрагента);
		НаборЗаписей.Отбор.НомерСпецификации.Установить(Выборка.НомерСпецификации);
		НаборЗаписей.Прочитать();
		Если не НаборЗаписей.Количество() = 0 Тогда
			
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();
		
		НаборЗаписей = РегистрыСведений.НумерацияСпецификацийДоговоров.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ДоговорКонтрагента.Установить(СпецификацияОбъект.ДоговорКонтрагента);
		НаборЗаписей.Отбор.НомерСпецификации.Установить(СпецификацияОбъект.НомерСпецификации);
		НаборЗаписей.Прочитать();
		Если не НаборЗаписей.Количество() = 0 Тогда // есть другая спецификация с таким номером
		ВызватьИсключение ("В базе данных уже зарегистрирована спецификация к договору " + СпецификацияОбъект.ДоговорКонтрагента + " с номером " + СпецификацияОбъект.НомерСпецификации);
		КонецЕсли;
	КонецЕсли;
	
		Запись = НаборЗаписей.Добавить();
		
		Запись.СпецификацияКДоговору = СпецификацияОбъект.Ссылка;
		Запись.ДоговорКонтрагента = СпецификацияОбъект.ДоговорКонтрагента;
		Запись.НомерСпецификации = СпецификацияОбъект.НомерСпецификации;
		Запись.НомерСпецификацииЧислом = ПолучитьНомерСпецификацииЧислом (СпецификацияОбъект.НомерСпецификации);
		
		Попытка
			
			НаборЗаписей.Записать();
			
		Исключение
			Инфо = ИнформацияОбОшибке();
			Сообщить (Инфо.Причина);
			Отказ = Истина;
		КонецПопытки;
		
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ЗарегистрироватьНовуюСпецификацию (СпецификацияОбъект, Ссылка, Отказ)
	
	НомерСпецификацииЧислом = Неопределено;
	
	Если не ЗначениеЗаполнено(СпецификацияОбъект.НомерСпецификации) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(НумерацияСпецификацийДоговоров.НомерСпецификацииЧислом) КАК НомерСпецификацииЧислом
		|ИЗ
		|	РегистрСведений.НумерацияСпецификацийДоговоров КАК НумерацияСпецификацийДоговоров
		|ГДЕ
		|	НумерацияСпецификацийДоговоров.ДоговорКонтрагента = &ДоговорКонтрагента";
		
		Запрос.УстановитьПараметр("ДоговорКонтрагента",СпецификацияОбъект.ДоговорКонтрагента);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		ВыборкаДетальныеЗаписи.Следующий();
		
		Если ВыборкаДетальныеЗаписи.НомерСпецификацииЧислом = Null Тогда
			НомерСпецификацииЧислом = 1;
		Иначе	
			НомерСпецификацииЧислом = ВыборкаДетальныеЗаписи.НомерСпецификацииЧислом+1;
		КонецЕсли;
		
		СпецификацияОбъект.НомерСпецификации = НомерСпецификацииЧислом;
		
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.НумерацияСпецификацийДоговоров.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ДоговорКонтрагента.Установить(СпецификацияОбъект.ДоговорКонтрагента);
	НаборЗаписей.Отбор.НомерСпецификации.Установить(СпецификацияОбъект.НомерСпецификации);

	НаборЗаписей.Прочитать();
	Если не НаборЗаписей.Количество() = 0 Тогда // есть другая спецификация с таким номером
		ВызватьИсключение ("В базе данных уже зарегистрирована спецификация к договору " + СпецификацияОбъект.ДоговорКонтрагента + " с номером " + СпецификацияОбъект.НомерСпецификации);
	КонецЕсли;

	Запись = НаборЗаписей.Добавить();
	Запись.СпецификацияКДоговору = Ссылка;
	Запись.ДоговорКонтрагента = СпецификацияОбъект.ДоговорКонтрагента;
	Запись.НомерСпецификации = СпецификацияОбъект.НомерСпецификации;
	Запись.НомерСпецификацииЧислом = ? (НомерСпецификацииЧислом = Неопределено, ПолучитьНомерСпецификацииЧислом (СпецификацияОбъект.НомерСпецификации), НомерСпецификацииЧислом);
	
	Попытка
		
		НаборЗаписей.Записать();
		
	Исключение
		Инфо = ИнформацияОбОшибке();
		Сообщить (Инфо.Причина);
		Отказ = Истина;
	КонецПопытки;
	
	
КонецПроцедуры

Функция ПолучитьНомерСпецификацииЧислом(НомерСтрока)
	
	НомерВхождения = Найти (НомерСтрока, "/");
	
	Если НомерВхождения = 0 тогда
		
		НомерСпецификации = Число(НомерСтрока);
		
	Иначе
		НомерСпецификации = Число (Лев (НомерСтрока, НомерВхождения-1));
		
	КонецЕсли;
	
	Возврат НомерСпецификации;
	
	
КонецФункции // ПолучитьНомерСпецификацииЧислом()

Процедура УдалитьЗапись(СпецификацияСсылка, Отказ) Экспорт

	НаборЗаписей = РегистрыСведений.НумерацияСпецификацийДоговоров.СоздатьНаборЗаписей();
  	НаборЗаписей.Отбор.ДоговорКонтрагента.Установить(СпецификацияСсылка.ДоговорКонтрагента);
	НаборЗаписей.Отбор.НомерСпецификации.Установить(СпецификацияСсылка.НомерСпецификации);
	НаборЗаписей.Записать();
	

КонецПроцедуры
