Процедура УстановитьНомерСпецификации(СпецификацияОбъект, Отказ) Экспорт
	
	Если не ЗначениеЗаполнено(СпецификацияОбъект.НомерСпецификации) Тогда // новая спецификация
		
	ЗарегистрироватьНовуюСпецификацию (СпецификацияОбъект, Отказ);	
	
	Иначе
		
	ИзменитьНомерСпецификации (СпецификацияОбъект, Отказ);
	
	КонецЕсли;

КонецПроцедуры

Процедура ИзменитьНомерСпецификации(СпецификацияОбъект, Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НумерацияСпецификацийДоговоров.НомерСпецификации
		|ИЗ
		|	РегистрСведений.НумерацияСпецификацийДоговоров КАК НумерацияСпецификацийДоговоров
		|ГДЕ
		|	НумерацияСпецификацийДоговоров.СпецификацияКДоговору = &СпецификацияКДоговору";
	
	Запрос.УстановитьПараметр("СпецификацияКДоговору", СпецификацияОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Если Выборка.НомерСпецификации= СпецификацияОбъект.НомерСпецификации Тогда // номер не менялся
			Возврат; 
	Иначе
		
	КонецЕсли;
	

КонецПроцедуры

Процедура ЗарегистрироватьНовуюСпецификацию (СпецификацияОбъект, Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(НумерацияСпецификацийДоговоров.НомерСпецификации) КАК НомерСпецификации
		|ИЗ
		|	РегистрСведений.НумерацияСпецификацийДоговоров КАК НумерацияСпецификацийДоговоров
		|ГДЕ
		|	НумерацияСпецификацийДоговоров.ДоговорКонтрагента = &ДоговорКонтрагента";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента",СпецификацияОбъект.ДоговорКонтрагента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	НомерСпецификации = ? (ВыборкаДетальныеЗаписи.НомерСпецификации = Null, 0, Число(ВыборкаДетальныеЗаписи.НомерСпецификации));

	
	
КонецПроцедуры
