
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СпецификацияКДоговору") Тогда
		Спецификация = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.СпецификацииДоговоров.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СпецификацииДоговоровОстатки.Организация,
		|	СпецификацииДоговоровОстатки.Контрагент,
		|	СпецификацииДоговоровОстатки.ДоговорКонтрагента,
		|	СпецификацииДоговоровОстатки.Спецификация,
		|	СпецификацииДоговоровОстатки.Номенклатура,
		|	СпецификацииДоговоровОстатки.Цена,
		|	СпецификацииДоговоровОстатки.КоличествоОстаток как Количество
		|ИЗ
		|	РегистрНакопления.СпецификацииДоговоров.Остатки КАК СпецификацииДоговоровОстатки
		|ГДЕ
		|	СпецификацииДоговоровОстатки.Спецификация = &Спецификация";
	
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Движение = Движения.СпецификацииДоговоров.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
	
	
РегистрыСведений.СтатусыСпецификаций.УстановитьСтатусСпецификации(Перечисления.СтатусыСпецификаций.Закрыт, Спецификация);	

КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗакрытиеСпецификации.Ссылка
		|ИЗ
		|	Документ.ЗакрытиеСпецификации КАК ЗакрытиеСпецификации
		|ГДЕ
		|	ЗакрытиеСпецификации.Проведен = ИСТИНА
		|	И ЗакрытиеСпецификации.Спецификация = &Спецификация
		|	И ЗакрытиеСпецификации.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Спецификация", Спецификация);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда // других документов закрытия спецификаций нет
	РегистрыСведений.СтатусыСпецификаций.УстановитьСтатусСпецификации(Перечисления.СтатусыСпецификаций.ВРаботе, Спецификация);
	КонецЕсли;
		
		
	
КонецПроцедуры
