&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	НомерШагаПомощника = НомерШагаПомощника();
	Если ЗначениеЗаполнено(НомерШагаПомощника) Тогда
		РегистрацияОрганизацииКлиент.ОткрытьЭтап(НомерШагаПомощника);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Сервис регистрации отключен или не используется'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция НомерШагаПомощника()
	
	Возврат Обработки.РегистрацияОрганизации.НомерШагаПомощникаДляЗапускаИзИнтерфейса();
	
КонецФункции