#Область ПрограммныйИнтерфейс

// Удаляет из массива ссылки на объекты, к которым у пользователя нет доступа
// Параметры:
//  МассивСсылок  - Массив - массив ссылок, из которого надо удалить те, к которым нет доступа
//
Процедура УдалитьНедоступныеЭлементыИзМассива(МассивСсылок) Экспорт
	
	Запрос = Новый Запрос;
	ОбъектыПоТипам = Новый Соответствие;
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		Возврат;
	КонецЕсли;
	
	// Исключим из массива объекты  на чтение которых у пользователя нет прав по ролям.
	Для каждого Ссылка Из МассивСсылок Цикл
		Если ПравоДоступа("Чтение", Ссылка.Метаданные()) Тогда
			СсылкиЭтогоТипа = ОбъектыПоТипам[Ссылка.Метаданные()];
			Если СсылкиЭтогоТипа = Неопределено Тогда
				СсылкиЭтогоТипа = Новый Массив;
				ОбъектыПоТипам.Вставить(Ссылка.Метаданные(), СсылкиЭтогоТипа);
			КонецЕсли;
			СсылкиЭтогоТипа.Добавить(Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	// С помощью запроса определим объекты, разрешенные по RLS.
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.ПакетЗапросов[0].ВыбиратьРазрешенные = Истина;
	Индекс = 0;
	Для каждого Объекты Из ОбъектыПоТипам Цикл
		
		Если Индекс = 0 Тогда
			// Оператор с индексом [0] создается конструктором схемы запроса всегда.
			Оператор = СхемаЗапроса.ПакетЗапросов[0].Операторы[0];
		Иначе
			Оператор = СхемаЗапроса.ПакетЗапросов[0].Операторы.Добавить();
		КонецЕсли;
		
		ИмяПараметра = СтрШаблон("МассивОбъектов_%1", Формат(Индекс + 1, "ЧГ=0"));
		
		Оператор.ВыбиратьРазличные = Истина;
		Оператор.Источники.Добавить(Объекты.Ключ.ПолноеИмя());
		Оператор.ВыбираемыеПоля.Добавить("Ссылка");
		Оператор.Отбор.Добавить(СтрШаблон("Ссылка В(&%1)", ИмяПараметра));
		
		Запрос.УстановитьПараметр(ИмяПараметра, Объекты.Значение);
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	Запрос.Текст = СхемаЗапроса.ПолучитьТекстЗапроса();
	
	ДопустимыеЗначения = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	// Ограничим исходную коллекцию только допустимыми значениями, через сокращение исходного массива чтобы сохранить порядок элементов.
	НедопустимыеЗначения = ОбщегоНазначенияКлиентСервер.СократитьМассив(МассивСсылок, ДопустимыеЗначения);
	МассивСсылок         = ОбщегоНазначенияКлиентСервер.СократитьМассив(МассивСсылок, НедопустимыеЗначения);
	
КонецПроцедуры

// Определяет перечень организаций, чтение данных которых, размещенных в конкретном объекте метаданных,
// разрешено пользователю настройками прав доступа.
//
// Функцию можно использовать, если требуется получать данные в привилегированном режиме для предоставления их пользователю - 
// она позволяет ограничить эти данные в соответствии с настройками.
//
// Функцию можно использовать только в тех случаях (для тех объектов),
// когда применяется стандартное ограничение доступа к запрашиваемому объекту метаданных - 
// то есть, аналогичное ограничению, применяемому для регистру бухгалтерии Хозрасчетный
// роли ДобавлениеИзменениеДанныхБухгалтерии.
//
// Порядок использования:
//  1. с помощью функции определяется список доступных организаций
//  2. в текстах запросов к самим данных (регистрам, документам) 
//     устанавливаются отборы по этим организациям
//  3. перед выполнением запроса к данным включается привилегированный режим.
//
// При использовании функции следует иметь в виду, что в общем случае ограничить выбираемые данные
// в соответствии с ОДД по Организации недостаточно:
// 1. в прикладном решении могут использоваться и иные виды доступа, не только Организации
// 2. перед установкой привилегированного режима в вызывающем коде следует проверить наличие прав
//    на чтение запрашиваемой таблицы (регистра, документов) в целом.
//
// Не следует (запрещается) вызывать эту функцию из кода, который может выполняться в привилегированном режиме,
// так как это приведет к последующей неверной ее работе вне привилегированного режима:
// может повторно использоваться значение, вычисленное в привилегированном режиме.
//
// Возвращаемое значение:
//  ФиксированныйМассив - содержит СправочникСсылка.Организации
//
// См. также ОбщегоНазначенияБПВызовСервераПовтИсп.ВсеОрганизацииДанныеКоторыхДоступныПоRLS()
//
// Параметры:
//  ИмяОбъектаДанных - Строка - полное имя объекта данных, доступ к которым проверяется, например, "РегистрБухгалтерии.Хозрасчетный"
//  ПравоНаИзменение - Булево - Истина, если после выполнения запроса данные предполагается менять
//               и нужно проверить, что у пользователя есть право на изменение
//  Пользователь     - СправочникСсылка.Пользователи - Ссылка на пользователя, для которого нужно получить список организаций.
// 
Функция ОрганизацииДанныеКоторыхДоступныПользователю(ИмяОбъектаДанных, ПравоНаИзменение = Ложь, Пользователь = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Если Не УправлениеДоступом.ОграничиватьДоступНаУровнеЗаписей()
		Или Пользователи.ЭтоПолноправныйПользователь(Пользователь , , Ложь) Тогда
		
		// Ограничений по RLS нет, возвращаем все организации из справочника
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Организации.Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации";
		
	Иначе
	
		// Запрос взят из шаблона #ПоЗначениям роли ДобавлениеИзменениеДанныхБухгалтерии
		// с теми параметрами, с которыми он применяется для регистра бухгалтерии Хозрасчетный.
		Запрос.УстановитьПараметр("Пользователь", ?(Пользователь = Неопределено, Пользователи.ТекущийПользователь(), Пользователь));
		Запрос.УстановитьПараметр("Изменение", ПравоНаИзменение);
		
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	Организации.Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	ИСТИНА В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ИСТИНА
		|			ИЗ
		|				Справочник.ИдентификаторыОбъектовМетаданных КАК СвойстваТекущейТаблицы
		|					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ГруппыДоступа КАК ГруппыДоступа
		|					ПО
		|						СвойстваТекущейТаблицы.ПолноеИмя = &ИмяОбъектаДанных
		|							И ИСТИНА В
		|								(ВЫБРАТЬ ПЕРВЫЕ 1
		|									ИСТИНА
		|								ИЗ
		|									РегистрСведений.ТаблицыГруппДоступа КАК ТаблицыГруппДоступа
		|								ГДЕ
		|									ТаблицыГруппДоступа.Таблица = СвойстваТекущейТаблицы.Ссылка
		|									И ТаблицыГруппДоступа.ГруппаДоступа = ГруппыДоступа.Ссылка
		|									И ТаблицыГруппДоступа.Изменение = &Изменение)
		|							И ГруппыДоступа.Ссылка В
		|								(ВЫБРАТЬ
		|									ГруппыДоступаПользователи.Ссылка КАК ГруппаДоступа
		|								ИЗ
		|									Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		|										ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоставыГруппПользователей КАК СоставыГруппПользователей
		|										ПО
		|											СоставыГруппПользователей.Пользователь = &Пользователь
		|												И СоставыГруппПользователей.ГруппаПользователей = ГруппыДоступаПользователи.Пользователь)
		|			ГДЕ
		|				ВЫБОР
		|					КОГДА ИСТИНА В
		|							(ВЫБРАТЬ ПЕРВЫЕ 1
		|								ИСТИНА
		|							ИЗ
		|								РегистрСведений.ЗначенияГруппДоступа КАК Значения
		|									ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ГруппыЗначенийДоступа КАК ГруппыЗначений
		|									ПО
		|										Значения.ГруппаДоступа = ГруппыДоступа.Ссылка
		|											И Значения.ЗначениеДоступа = Организации.Ссылка
		|											И ГруппыЗначений.ЗначениеДоступа = ГруппыЗначений.ГруппаЗначенийДоступа)
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ = ВЫБОР
		|					КОГДА ИСТИНА В
		|							(ВЫБРАТЬ ПЕРВЫЕ 1
		|								ИСТИНА
		|							ИЗ
		|								РегистрСведений.ЗначенияГруппДоступаПоУмолчанию КАК ЗначенияПоУмолчанию
		|							ГДЕ
		|								ЗначенияПоУмолчанию.ГруппаДоступа = ГруппыДоступа.Ссылка
		|								И ТИПЗНАЧЕНИЯ(ЗначенияПоУмолчанию.ТипЗначенийДоступа) = ТИПЗНАЧЕНИЯ(Организации.Ссылка)
		|								И ЗначенияПоУмолчанию.ВсеРазрешены = ЛОЖЬ)
		|						ТОГДА ИСТИНА
		|					ИНАЧЕ ЛОЖЬ
		|				КОНЕЦ)";
		
		Запрос.Текст = ?(ПравоНаИзменение,
			ТекстЗапроса,
			СтрЗаменить(ТекстЗапроса, "И ТаблицыГруппДоступа.Изменение = &Изменение", ""));
			
		Запрос.УстановитьПараметр("ИмяОбъектаДанных", ИмяОбъектаДанных);
			
	КонецЕсли;
	
	// Доступ к настройкам RLS выполняется в привилегированном режиме.
	УстановитьПривилегированныйРежим(Истина);
	
	МассивОрганизаций = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат Новый ФиксированныйМассив(МассивОрганизаций);
	
КонецФункции

// Определяет разрещено ли текущему пользователю изменять данные при включенном ограничени доступа на уровне записи.
//
// Параметры:
//  Ссылка - Ссылка - ссылка на объект у которого проверяется право изменения.
//
// Возвращаемые параметры:
//  Булево - Истина если изменение разрешено, иначе Ложь.
//
Функция ЕстьПравоИзмененияНаУровнеЗаписи(Ссылка) Экспорт
	
	СсылкаВМассиве = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Ссылка);
	УдалитьНедоступныеЭлементыИзМассива(СсылкаВМассиве);
	
	Возврат СсылкаВМассиве.Количество() > 0;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Заполняет описания поставляемых профилей пользователей в подсистеме БСП "Управление доступом".
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииПоставляемыхПрофилейГруппДоступа()
//
// Параметры:
//  ОписаниеПрофиля		 - см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа() - заполняемая коллекция
//
Процедура ЗаполнитьПоставляемыеПрофилиПользователей(ОписанияПрофилей) Экспорт
	
	ОписанияПрофилейБП = Новый Массив;
	ОписанияПрофилейБП.Добавить(ОписаниеПрофиляГлавныйБухгалтер());
	ОписанияПрофилейБП.Добавить(ОписаниеПрофиляБухгалтер());
	ОписанияПрофилейБП.Добавить(ОписаниеПрофиляМенеджерПоПродажам());
	ОписанияПрофилейБП.Добавить(ОписаниеПрофиляТолькоПросмотр());
	
	ВытеснитьРолиИнтегральнымиРолями(ОписанияПрофилейБП);
	ИсключитьИзбыточныеРолиПросмотра(ОписанияПрофилейБП);
	ЗапретитьРедактированиеОбщихДанных(ОписанияПрофилейБП);
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(ОписанияПрофилей, ОписанияПрофилейБП);
	
КонецПроцедуры

// Включает виды доступа в подсистеме БСП "Управление доступом".
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииВидовДоступа()
//
Процедура ЗаполнитьВидыДоступа(ВидыДоступа) Экспорт
	
	// Организации
	Если ВидыДоступа.Найти("Организации", "Имя") = Неопределено Тогда // Могут быть добавлены библиотеками
		ВидДоступа = ВидыДоступа.Добавить();
		ВидДоступа.Имя           = "Организации";
		ВидДоступа.Представление = НСтр("ru = 'Организации'");
		ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Организации");
	КонецЕсли;
	
	// Виды операций документа "ПКО"
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя           = "ВидыОперацийПКО";
	ВидДоступа.Представление = НСтр("ru = 'Виды поступления наличных'");
	ВидДоступа.ТипЗначений   = Тип("ПеречислениеСсылка.ВидыОперацийПКО");
	
КонецПроцедуры

Процедура ЗаполнитьВидыОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	ШаблонОписания = 
	"
	|Справочник.БанковскиеСчета.Чтение.ГруппыФизическихЛиц
	|Справочник.БанковскиеСчета.Чтение.Организации
	|Справочник.ВерсииФайлов.Чтение.Объект.Документ.УдалитьЗаявлениеАбонентаСпецоператораСвязи
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.Организации
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.ПапкиФайлов
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.ФизическиеЛица
	|Справочник.ВерсииФайлов.Изменение.Объект.Документ.УдалитьЗаявлениеАбонентаСпецоператораСвязи
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.Организации
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ПапкиФайлов
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ФизическиеЛица
	|Справочник.ВидыДеятельностиЕНВД.Чтение.Организации
	|Справочник.ВидыДеятельностиЕНВД.Изменение.Организации
	|Справочник.ВидыОплатОрганизаций.Чтение.Организации
	|Справочник.ВидыОплатОрганизаций.Изменение.Организации
	|Справочник.ВнешниеПользователи.Чтение.ВнешниеПользователи
	|Справочник.ВнешниеПользователи.Изменение.ВнешниеПользователи
	|Справочник.ГруппыВнешнихПользователей.Чтение.ВнешниеПользователи
	|Справочник.ГруппыПользователей.Чтение.Пользователи
	|Справочник.ДоверенностиНалогоплательщика.Чтение.Организации
	|Справочник.ДоверенностиНалогоплательщика.Изменение.Организации
	|Справочник.ДоговорыКонтрагентов.Чтение.Организации
	|Справочник.ДоговорыКонтрагентов.Изменение.Организации
	|Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов.Чтение.Организации
	|Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов.Изменение.Организации
	|Справочник.ДополнительныеОтчетыИОбработки.Чтение.ДополнительныеОтчетыИОбработки
	|Справочник.ЗарплатныеПроекты.Чтение.Организации
	|Справочник.ЗарплатныеПроекты.Изменение.Организации
	|Справочник.ЗначенияСвойствОбъектов.Чтение.ДополнительныеСведения
	|Справочник.ЗначенияСвойствОбъектовИерархия.Чтение.ДополнительныеСведения
	|Справочник.КомплектыОтчетностиПерсучета.Чтение.Организации
	|Справочник.КомплектыОтчетностиПерсучета.Изменение.Организации
	|Справочник.МакетыПенсионныхДел.Чтение.Организации
	|Справочник.МакетыПенсионныхДел.Изменение.Организации
	|Справочник.НастройкиОбменСБанками.Чтение.Организации
	|Справочник.ОписиВходящихДокументовИзНалоговыхОрганов.Чтение.Организации
	|Справочник.ОписиВходящихДокументовИзНалоговыхОрганов.Изменение.Организации
	|Справочник.ОписиИсходящихДокументовВНалоговыеОрганы.Чтение.Организации
	|Справочник.ОписиИсходящихДокументовВНалоговыеОрганы.Изменение.Организации
	|Справочник.ОписьПачекСЗВ_6ПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОписьПачекСЗВ_6ПрисоединенныеФайлы.Изменение.Организации
	|Справочник.Организации.Чтение.Организации
	|Справочник.Организации.Изменение.Организации
	|Справочник.ОрганизацииПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ОснованияПраваПодписи.Чтение.Организации
	|Справочник.ОснованияПраваПодписи.Изменение.Организации
	|Справочник.ОтправкиБанкРоссии.Чтение.Организации
	|Справочник.ОтправкиБанкРоссии.Изменение.Организации
	|Справочник.ОтправкиРПН.Чтение.Организации
	|Справочник.ОтправкиРПН.Изменение.Организации
	|Справочник.ОтправкиФСРАР.Чтение.Организации
	|Справочник.ОтправкиФСРАР.Изменение.Организации
	|Справочник.ОтправкиФСС.Чтение.Организации
	|Справочник.ОтправкиФСС.Изменение.Организации
	|Справочник.ОтправкиФТС.Чтение.Организации
	|Справочник.ОтправкиФТС.Изменение.Организации
	|Справочник.ПакетЭДПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ПапкиФайлов.Чтение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.ПапкиФайлов.Изменение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.Патенты.Чтение.Организации
	|Справочник.Патенты.Изменение.Организации
	|Справочник.ПерепискаСКонтролирующимиОрганами.Чтение.Организации
	|Справочник.ПерепискаСКонтролирующимиОрганами.Изменение.Организации
	|Справочник.ПодключаемоеОборудование.Чтение.Организации
	|Справочник.ПодключаемоеОборудование.Изменение.Организации
	|Справочник.ПодразделенияОрганизаций.Чтение.Организации
	|Справочник.ПодразделенияОрганизаций.Изменение.Организации
	|Справочник.Пользователи.Чтение.Пользователи
	|Справочник.Пользователи.Изменение.Пользователи
	|Справочник.ПрофилиНастроекЭДО.Чтение.Организации
	|Справочник.РегистрацииВНалоговомОргане.Чтение.Организации
	|Справочник.РегистрацииВНалоговомОргане.Изменение.Организации
	|Справочник.СканированныеДокументыДляПередачиВЭлектронномВиде.Чтение.Организации
	|Справочник.СканированныеДокументыДляПередачиВЭлектронномВиде.Изменение.Организации
	|Справочник.СоглашенияОбИспользованииЭД.Чтение.Организации
	|Справочник.Сотрудники.Чтение.ГруппыФизическихЛиц
	|Справочник.Сотрудники.Чтение.Организации
	|Справочник.Сотрудники.Изменение.ГруппыФизическихЛиц
	|Справочник.Сотрудники.Изменение.Организации
	|Справочник.ТорговыеТочки.Чтение.Организации
	|Справочник.ТорговыеТочки.Изменение.Организации
	|Справочник.УчетныеЗаписиЭлектроннойПочты.Чтение.УчетныеЗаписиЭлектроннойПочты
	|Справочник.Файлы.Чтение.Объект.Документ.УдалитьЗаявлениеАбонентаСпецоператораСвязи
	|Справочник.Файлы.Чтение.Объект.Справочник.Организации
	|Справочник.Файлы.Чтение.Объект.Справочник.ПапкиФайлов
	|Справочник.Файлы.Чтение.Объект.Справочник.ФизическиеЛица
	|Справочник.Файлы.Изменение.Объект.Документ.УдалитьЗаявлениеАбонентаСпецоператораСвязи
	|Справочник.Файлы.Изменение.Объект.Справочник.Организации
	|Справочник.Файлы.Изменение.Объект.Справочник.ПапкиФайлов
	|Справочник.Файлы.Изменение.Объект.Справочник.ФизическиеЛица
	|Справочник.ФизическиеЛица.Чтение.ГруппыФизическихЛиц
	|Справочник.ФизическиеЛица.Изменение.ГруппыФизическихЛиц
	|Справочник.ЭДПрисоединенныеФайлы.Чтение.Организации
	|Справочник.ЭлектронныеПредставленияРегламентированныхОтчетов.Чтение.Организации
	|Справочник.ЭлектронныеПредставленияРегламентированныхОтчетов.Изменение.Организации
	|Документ.АвансовыйОтчет.Чтение.Организации
	|Документ.АвансовыйОтчет.Изменение.Организации
	|Документ.АвансовыйПлатежИностранцаПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.АвансовыйПлатежИностранцаПоНДФЛ.Чтение.Организации
	|Документ.АвансовыйПлатежИностранцаПоНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.АвансовыйПлатежИностранцаПоНДФЛ.Изменение.Организации
	|Документ.АвизоМПЗВходящее.Чтение.Организации
	|Документ.АвизоМПЗВходящее.Изменение.Организации
	|Документ.АвизоМПЗИсходящее.Чтение.Организации
	|Документ.АвизоМПЗИсходящее.Изменение.Организации
	|Документ.АвизоОСВходящее.Чтение.Организации
	|Документ.АвизоОСВходящее.Изменение.Организации
	|Документ.АвизоОСИсходящее.Чтение.Организации
	|Документ.АвизоОСИсходящее.Изменение.Организации
	|Документ.АвизоПрочееВходящее.Чтение.Организации
	|Документ.АвизоПрочееВходящее.Изменение.Организации
	|Документ.АвизоПрочееИсходящее.Чтение.Организации
	|Документ.АвизоПрочееИсходящее.Изменение.Организации
	|Документ.АвизоРасчетыВходящее.Чтение.Организации
	|Документ.АвизоРасчетыВходящее.Изменение.Организации
	|Документ.АвизоРасчетыИсходящее.Чтение.Организации
	|Документ.АвизоРасчетыИсходящее.Изменение.Организации
	|Документ.АктОбОказанииПроизводственныхУслуг.Чтение.Организации
	|Документ.АктОбОказанииПроизводственныхУслуг.Изменение.Организации
	|Документ.АктПроверкиСтраховыхВзносов.Чтение.ГруппыФизическихЛиц
	|Документ.АктПроверкиСтраховыхВзносов.Чтение.Организации
	|Документ.АктПроверкиСтраховыхВзносов.Изменение.ГруппыФизическихЛиц
	|Документ.АктПроверкиСтраховыхВзносов.Изменение.Организации
	|Документ.АктСверкиВзаиморасчетов.Чтение.Организации
	|Документ.АктСверкиВзаиморасчетов.Изменение.Организации
	|Документ.БольничныйЛист.Чтение.ГруппыФизическихЛиц
	|Документ.БольничныйЛист.Чтение.Организации
	|Документ.БольничныйЛист.Изменение.ГруппыФизическихЛиц
	|Документ.БольничныйЛист.Изменение.Организации
	|Документ.ВводНачальныхОстатков.Чтение.Организации
	|Документ.ВводНачальныхОстатков.Изменение.Организации
	|Документ.ВедомостьНаВыплатуЗарплаты.Чтение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплаты.Чтение.Организации
	|Документ.ВедомостьНаВыплатуЗарплаты.Изменение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплаты.Изменение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыВБанк.Чтение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыВБанк.Чтение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыВБанк.Изменение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыВБанк.Изменение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыВКассу.Чтение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыВКассу.Чтение.Организации
	|Документ.ВедомостьНаВыплатуЗарплатыВКассу.Изменение.ГруппыФизическихЛиц
	|Документ.ВедомостьНаВыплатуЗарплатыВКассу.Изменение.Организации
	|Документ.ВедомостьУплатыАДВ_11.Чтение.Организации
	|Документ.ВедомостьУплатыАДВ_11.Изменение.Организации
	|Документ.ВозвратМатериаловИзЭксплуатации.Чтение.Организации
	|Документ.ВозвратМатериаловИзЭксплуатации.Изменение.Организации
	|Документ.ВозвратНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.ВозвратНДФЛ.Чтение.Организации
	|Документ.ВозвратНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.ВозвратНДФЛ.Изменение.Организации
	|Документ.ВозвратОСОтАрендатора.Чтение.Организации
	|Документ.ВозвратОСОтАрендатора.Изменение.Организации
	|Документ.ВозвратТоваровОтПокупателя.Чтение.Организации
	|Документ.ВозвратТоваровОтПокупателя.Изменение.Организации
	|Документ.ВозвратТоваровПоставщику.Чтение.Организации
	|Документ.ВозвратТоваровПоставщику.Изменение.Организации
	|Документ.ВосстановлениеНДС.Чтение.Организации
	|Документ.ВосстановлениеНДС.Изменение.Организации
	|Документ.ВосстановлениеНДСПоОбъектамНедвижимости.Чтение.Организации
	|Документ.ВосстановлениеНДСПоОбъектамНедвижимости.Изменение.Организации
	|Документ.ВыгрузкаРегламентированныхОтчетов.Чтение.Организации
	|Документ.ВыгрузкаРегламентированныхОтчетов.Изменение.Организации
	|Документ.ВыдачаДенежныхДокументов.Чтение.Организации
	|Документ.ВыдачаДенежныхДокументов.Изменение.Организации
	|Документ.ВыкупПредметовЛизинга.Чтение.Организации
	|Документ.ВыкупПредметовЛизинга.Изменение.Организации
	|Документ.ВыработкаМатериалов.Чтение.Организации
	|Документ.ВыработкаМатериалов.Изменение.Организации
	|Документ.ВыработкаНМА.Чтение.Организации
	|Документ.ВыработкаНМА.Изменение.Организации
	|Документ.ВыработкаОС.Чтение.Организации
	|Документ.ВыработкаОС.Изменение.Организации
	|Документ.ГТДИмпорт.Чтение.Организации
	|Документ.ГТДИмпорт.Изменение.Организации
	|Документ.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР.Чтение.ГруппыФизическихЛиц
	|Документ.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР.Чтение.Организации
	|Документ.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР.Изменение.ГруппыФизическихЛиц
	|Документ.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР.Изменение.Организации
	|Документ.ДепонированиеЗарплаты.Чтение.ГруппыФизическихЛиц
	|Документ.ДепонированиеЗарплаты.Чтение.Организации
	|Документ.ДепонированиеЗарплаты.Изменение.ГруппыФизическихЛиц
	|Документ.ДепонированиеЗарплаты.Изменение.Организации
	|Документ.Доверенность.Чтение.Организации
	|Документ.Доверенность.Изменение.Организации
	|Документ.ДокументРасчетовСКонтрагентом.Чтение.Организации
	|Документ.ДокументРасчетовСКонтрагентом.Изменение.Организации
	|Документ.ДопЛистКнигиПокупокДляПередачиВЭлектронномВиде.Чтение.Организации
	|Документ.ДопЛистКнигиПокупокДляПередачиВЭлектронномВиде.Изменение.Организации
	|Документ.ДопЛистКнигиПродажДляПередачиВЭлектронномВиде.Чтение.Организации
	|Документ.ДопЛистКнигиПродажДляПередачиВЭлектронномВиде.Изменение.Организации
	|Документ.ЖурналУчетаСчетовФактурДляПередачиВЭлектронномВиде.Чтение.Организации
	|Документ.ЖурналУчетаСчетовФактурДляПередачиВЭлектронномВиде.Изменение.Организации
	|Документ.ЗаписьКнигиУчетаДоходовИРасходовИП.Чтение.Организации
	|Документ.ЗаписьКнигиУчетаДоходовИРасходовИП.Изменение.Организации
	|Документ.ЗаписьКУДиР.Чтение.Организации
	|Документ.ЗаписьКУДиР.Изменение.Организации
	|Документ.ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП.Чтение.Организации
	|Документ.ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП.Изменение.Организации
	|Документ.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика.Чтение.Организации
	|Документ.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика.Изменение.Организации
	|Документ.ЗапросНаИнформационноеОбслуживаниеСтрахователя.Чтение.Организации
	|Документ.ЗапросНаИнформационноеОбслуживаниеСтрахователя.Изменение.Организации
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Чтение.Организации
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Изменение.Организации
	|Документ.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников.Чтение.Организации
	|Документ.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаЗакрытиеЛицевыхСчетовСотрудников.Изменение.Организации
	|Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников.Чтение.Организации
	|Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявкаНаОткрытиеЛицевыхСчетовСотрудников.Изменение.Организации
	|Документ.ЗаявлениеАбонентаСпецоператораСвязи.Чтение.Организации
	|Документ.ЗаявлениеАбонентаСпецоператораСвязи.Изменение.Организации
	|Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.Чтение.Организации
	|Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов.Изменение.Организации
	|Документ.ЗаявлениеВФССОВозмещенииРасходовНаПогребение.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеВФССОВозмещенииРасходовНаПогребение.Чтение.Организации
	|Документ.ЗаявлениеВФССОВозмещенииРасходовНаПогребение.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеВФССОВозмещенииРасходовНаПогребение.Изменение.Организации
	|Документ.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ.Чтение.Организации
	|Документ.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ.Изменение.Организации
	|Документ.ЗаявлениеОВвозеТоваров.Чтение.Организации
	|Документ.ЗаявлениеОВвозеТоваров.Изменение.Организации
	|Документ.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ.Чтение.Организации
	|Документ.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ.Изменение.Организации
	|Документ.ЗаявлениеСотрудникаНаВыплатуПособия.Чтение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеСотрудникаНаВыплатуПособия.Чтение.Организации
	|Документ.ЗаявлениеСотрудникаНаВыплатуПособия.Изменение.ГруппыФизическихЛиц
	|Документ.ЗаявлениеСотрудникаНаВыплатуПособия.Изменение.Организации
	|Документ.ИзменениеГрафиковАмортизацииОС.Чтение.Организации
	|Документ.ИзменениеГрафиковАмортизацииОС.Изменение.Организации
	|Документ.ИзменениеОтраженияРасходовПоЛизинговымПлатежамОС.Чтение.Организации
	|Документ.ИзменениеОтраженияРасходовПоЛизинговымПлатежамОС.Изменение.Организации
	|Документ.ИзменениеПараметровНачисленияАмортизацииОС.Чтение.Организации
	|Документ.ИзменениеПараметровНачисленияАмортизацииОС.Изменение.Организации
	|Документ.ИзменениеСостоянияОС.Чтение.Организации
	|Документ.ИзменениеСостоянияОС.Изменение.Организации
	|Документ.ИзменениеСпециальногоКоэффициентаНМА.Чтение.Организации
	|Документ.ИзменениеСпециальногоКоэффициентаНМА.Изменение.Организации
	|Документ.ИзменениеСпециальногоКоэффициентаОС.Чтение.Организации
	|Документ.ИзменениеСпециальногоКоэффициентаОС.Изменение.Организации
	|Документ.ИзменениеСпособовОтраженияРасходовПоАмортизацииНМА.Чтение.Организации
	|Документ.ИзменениеСпособовОтраженияРасходовПоАмортизацииНМА.Изменение.Организации
	|Документ.ИзменениеСпособовОтраженияРасходовПоАмортизацииОС.Чтение.Организации
	|Документ.ИзменениеСпособовОтраженияРасходовПоАмортизацииОС.Изменение.Организации
	|Документ.ИнвентаризацияНЗП.Чтение.Организации
	|Документ.ИнвентаризацияНЗП.Изменение.Организации
	|Документ.ИнвентаризацияОС.Чтение.Организации
	|Документ.ИнвентаризацияОС.Изменение.Организации
	|Документ.ИнвентаризацияРасчетовСКонтрагентами.Чтение.Организации
	|Документ.ИнвентаризацияРасчетовСКонтрагентами.Изменение.Организации
	|Документ.ИнвентаризацияТоваровНаСкладе.Чтение.Организации
	|Документ.ИнвентаризацияТоваровНаСкладе.Изменение.Организации
	|Документ.ИсполнительныйЛист.Чтение.ГруппыФизическихЛиц
	|Документ.ИсполнительныйЛист.Чтение.Организации
	|Документ.ИсполнительныйЛист.Изменение.ГруппыФизическихЛиц
	|Документ.ИсполнительныйЛист.Изменение.Организации
	|Документ.ИсходящаяСправкаОЗаработкеДляРасчетаПособий.Чтение.ГруппыФизическихЛиц
	|Документ.ИсходящаяСправкаОЗаработкеДляРасчетаПособий.Чтение.Организации
	|Документ.ИсходящаяСправкаОЗаработкеДляРасчетаПособий.Изменение.ГруппыФизическихЛиц
	|Документ.ИсходящаяСправкаОЗаработкеДляРасчетаПособий.Изменение.Организации
	|Документ.КадровыйПеревод.Чтение.ГруппыФизическихЛиц
	|Документ.КадровыйПеревод.Чтение.Организации
	|Документ.КадровыйПеревод.Изменение.ГруппыФизическихЛиц
	|Документ.КадровыйПеревод.Изменение.Организации
	|Документ.КассоваяСмена.Чтение.Организации
	|Документ.КассоваяСмена.Изменение.Организации
	|Документ.КассовыйЧекКоррекции.Чтение.Организации
	|Документ.КассовыйЧекКоррекции.Изменение.Организации
	|Документ.КнигаПокупокДляПередачиВЭлектронномВиде.Чтение.Организации
	|Документ.КнигаПокупокДляПередачиВЭлектронномВиде.Изменение.Организации
	|Документ.КнигаПродажДляПередачиВЭлектронномВиде.Чтение.Организации
	|Документ.КнигаПродажДляПередачиВЭлектронномВиде.Изменение.Организации
	|Документ.КомплектацияНоменклатуры.Чтение.Организации
	|Документ.КомплектацияНоменклатуры.Изменение.Организации
	|Документ.КонтролируемаяСделка.Чтение.Организации
	|Документ.КонтролируемаяСделка.Изменение.Организации
	|Документ.КорректировкаДолга.Чтение.Организации
	|Документ.КорректировкаДолга.Изменение.Организации
	|Документ.КорректировкаПоступления.Чтение.Организации
	|Документ.КорректировкаПоступления.Изменение.Организации
	|Документ.КорректировкаРеализации.Чтение.Организации
	|Документ.КорректировкаРеализации.Изменение.Организации
	|Документ.МодернизацияОС.Чтение.Организации
	|Документ.МодернизацияОС.Изменение.Организации
	|Документ.НачислениеЗарплаты.Чтение.ГруппыФизическихЛиц
	|Документ.НачислениеЗарплаты.Чтение.Организации
	|Документ.НачислениеЗарплаты.Изменение.ГруппыФизическихЛиц
	|Документ.НачислениеЗарплаты.Изменение.Организации
	|Документ.НачислениеНДСпоСМРхозспособом.Чтение.Организации
	|Документ.НачислениеНДСпоСМРхозспособом.Изменение.Организации
	|Документ.НачислениеОценочныхОбязательствПоОтпускам.Чтение.ГруппыФизическихЛиц
	|Документ.НачислениеОценочныхОбязательствПоОтпускам.Чтение.Организации
	|Документ.НачислениеОценочныхОбязательствПоОтпускам.Изменение.ГруппыФизическихЛиц
	|Документ.НачислениеОценочныхОбязательствПоОтпускам.Изменение.Организации
	|Документ.НачислениеПеней.Чтение.Организации
	|Документ.ОказаниеУслуг.Чтение.Организации
	|Документ.ОказаниеУслуг.Изменение.Организации
	|Документ.ОперацияБух.Чтение.Организации
	|Документ.ОперацияБух.Изменение.Организации
	|Документ.ОперацияНалоговогоУчетаПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.ОперацияНалоговогоУчетаПоНДФЛ.Чтение.Организации
	|Документ.ОперацияНалоговогоУчетаПоНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.ОперацияНалоговогоУчетаПоНДФЛ.Изменение.Организации
	|Документ.ОперацияУчетаПоСтраховымВзносам.Чтение.ГруппыФизическихЛиц
	|Документ.ОперацияУчетаПоСтраховымВзносам.Чтение.Организации
	|Документ.ОперацияУчетаПоСтраховымВзносам.Изменение.ГруппыФизическихЛиц
	|Документ.ОперацияУчетаПоСтраховымВзносам.Изменение.Организации
	|Документ.ОписьЗаявленийСотрудниковНаВыплатуПособий.Чтение.ГруппыФизическихЛиц
	|Документ.ОписьЗаявленийСотрудниковНаВыплатуПособий.Чтение.Организации
	|Документ.ОписьЗаявленийСотрудниковНаВыплатуПособий.Изменение.ГруппыФизическихЛиц
	|Документ.ОписьЗаявленийСотрудниковНаВыплатуПособий.Изменение.Организации
	|Документ.ОписьОДВ_1.Чтение.Организации
	|Документ.ОписьОДВ_1.Изменение.Организации
	|Документ.ОписьПачекСЗВ_6.Чтение.Организации
	|Документ.ОписьПачекСЗВ_6.Изменение.Организации
	|Документ.ОплатаПлатежнойКартой.Чтение.Организации
	|Документ.ОплатаПлатежнойКартой.Изменение.Организации
	|Документ.ОприходованиеТоваров.Чтение.Организации
	|Документ.ОприходованиеТоваров.Изменение.Организации
	|Документ.ОтзывСогласияНаОбработкуПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|Документ.ОтзывСогласияНаОбработкуПерсональныхДанных.Чтение.Организации
	|Документ.ОтзывСогласияНаОбработкуПерсональныхДанных.Изменение.ГруппыФизическихЛиц
	|Документ.ОтзывСогласияНаОбработкуПерсональныхДанных.Изменение.Организации
	|Документ.Отпуск.Чтение.ГруппыФизическихЛиц
	|Документ.Отпуск.Чтение.Организации
	|Документ.Отпуск.Изменение.ГруппыФизическихЛиц
	|Документ.Отпуск.Изменение.Организации
	|Документ.ОтражениеЗарплатыВБухучете.Чтение.ГруппыФизическихЛиц
	|Документ.ОтражениеЗарплатыВБухучете.Чтение.Организации
	|Документ.ОтражениеЗарплатыВБухучете.Изменение.ГруппыФизическихЛиц
	|Документ.ОтражениеЗарплатыВБухучете.Изменение.Организации
	|Документ.ОтражениеЗарплатыВУчете.Чтение.Организации
	|Документ.ОтражениеЗарплатыВУчете.Изменение.Организации
	|Документ.ОтражениеНачисленияНДС.Чтение.Организации
	|Документ.ОтражениеНачисленияНДС.Изменение.Организации
	|Документ.ОтражениеНДСКВычету.Чтение.Организации
	|Документ.ОтражениеНДСКВычету.Изменение.Организации
	|Документ.ОтчетКомиссионераОПродажах.Чтение.Организации
	|Документ.ОтчетКомиссионераОПродажах.Изменение.Организации
	|Документ.ОтчетКомитентуОПродажах.Чтение.Организации
	|Документ.ОтчетКомитентуОПродажах.Изменение.Организации
	|Документ.ОтчетОператораСистемыПлатон.Чтение.Организации
	|Документ.ОтчетОператораСистемыПлатон.Изменение.Организации
	|Документ.ОтчетОРозничныхПродажах.Чтение.Организации
	|Документ.ОтчетОРозничныхПродажах.Изменение.Организации
	|Документ.ОтчетПроизводстваЗаСмену.Чтение.Организации
	|Документ.ОтчетПроизводстваЗаСмену.Изменение.Организации
	|Документ.ПакетОбменСБанками.Чтение.Организации
	|Документ.ПакетЭД.Чтение.Организации
	|Документ.Партия.Чтение.Организации
	|Документ.Партия.Изменение.Организации
	|Документ.ПартияМатериаловВЭксплуатации.Чтение.Организации
	|Документ.ПартияМатериаловВЭксплуатации.Изменение.Организации
	|Документ.ПачкаДокументовАДВ_1.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовАДВ_1.Чтение.Организации
	|Документ.ПачкаДокументовАДВ_1.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовАДВ_1.Изменение.Организации
	|Документ.ПачкаДокументовАДВ_2.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовАДВ_2.Чтение.Организации
	|Документ.ПачкаДокументовАДВ_2.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовАДВ_2.Изменение.Организации
	|Документ.ПачкаДокументовАДВ_3.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовАДВ_3.Чтение.Организации
	|Документ.ПачкаДокументовАДВ_3.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовАДВ_3.Изменение.Организации
	|Документ.ПачкаДокументовДСВ_1.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовДСВ_1.Чтение.Организации
	|Документ.ПачкаДокументовДСВ_1.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовДСВ_1.Изменение.Организации
	|Документ.ПачкаДокументовСЗВ_6_1.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_6_1.Чтение.Организации
	|Документ.ПачкаДокументовСЗВ_6_1.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_6_1.Изменение.Организации
	|Документ.ПачкаДокументовСЗВ_6_3.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_6_3.Чтение.Организации
	|Документ.ПачкаДокументовСЗВ_6_3.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_6_3.Изменение.Организации
	|Документ.ПачкаДокументовСЗВ_6_4.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_6_4.Чтение.Организации
	|Документ.ПачкаДокументовСЗВ_6_4.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_6_4.Изменение.Организации
	|Документ.ПачкаДокументовСЗВ_К.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_К.Чтение.Организации
	|Документ.ПачкаДокументовСЗВ_К.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСЗВ_К.Изменение.Организации
	|Документ.ПачкаДокументовСПВ_1.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСПВ_1.Чтение.Организации
	|Документ.ПачкаДокументовСПВ_1.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСПВ_1.Изменение.Организации
	|Документ.ПачкаДокументовСПВ_2.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСПВ_2.Чтение.Организации
	|Документ.ПачкаДокументовСПВ_2.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаДокументовСПВ_2.Изменение.Организации
	|Документ.ПачкаРазделов6РасчетаРСВ_1.Чтение.ГруппыФизическихЛиц
	|Документ.ПачкаРазделов6РасчетаРСВ_1.Чтение.Организации
	|Документ.ПачкаРазделов6РасчетаРСВ_1.Изменение.ГруппыФизическихЛиц
	|Документ.ПачкаРазделов6РасчетаРСВ_1.Изменение.Организации
	|Документ.ПередачаМатериаловВЭксплуатацию.Чтение.Организации
	|Документ.ПередачаМатериаловВЭксплуатацию.Изменение.Организации
	|Документ.ПередачаНМА.Чтение.Организации
	|Документ.ПередачаНМА.Изменение.Организации
	|Документ.ПередачаОборудованияВМонтаж.Чтение.Организации
	|Документ.ПередачаОборудованияВМонтаж.Изменение.Организации
	|Документ.ПередачаОС.Чтение.Организации
	|Документ.ПередачаОС.Изменение.Организации
	|Документ.ПередачаОСВАренду.Чтение.Организации
	|Документ.ПередачаОСВАренду.Изменение.Организации
	|Документ.ПередачаТоваров.Чтение.Организации
	|Документ.ПередачаТоваров.Изменение.Организации
	|Документ.ПеремещениеОС.Чтение.Организации
	|Документ.ПеремещениеОС.Изменение.Организации
	|Документ.ПеремещениеТоваров.Чтение.Организации
	|Документ.ПеремещениеТоваров.Изменение.Организации
	|Документ.ПереоценкаТоваровВРознице.Чтение.Организации
	|Документ.ПереоценкаТоваровВРознице.Изменение.Организации
	|Документ.ПерерасчетНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.ПерерасчетНДФЛ.Чтение.Организации
	|Документ.ПерерасчетНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.ПерерасчетНДФЛ.Изменение.Организации
	|Документ.ПерерасчетСтраховыхВзносов.Чтение.ГруппыФизическихЛиц
	|Документ.ПерерасчетСтраховыхВзносов.Чтение.Организации
	|Документ.ПерерасчетСтраховыхВзносов.Изменение.ГруппыФизическихЛиц
	|Документ.ПерерасчетСтраховыхВзносов.Изменение.Организации
	|Документ.ПлатежноеПоручение.Чтение.Организации
	|Документ.ПлатежноеПоручение.Изменение.Организации
	|Документ.ПлатежноеТребование.Чтение.Организации
	|Документ.ПлатежноеТребование.Изменение.Организации
	|Документ.ПодготовкаКПередачеОС.Чтение.Организации
	|Документ.ПодготовкаКПередачеОС.Изменение.Организации
	|Документ.ПодтверждениеЗачисленияЗарплаты.Чтение.ГруппыФизическихЛиц
	|Документ.ПодтверждениеЗачисленияЗарплаты.Чтение.Организации
	|Документ.ПодтверждениеЗачисленияЗарплаты.Изменение.ГруппыФизическихЛиц
	|Документ.ПодтверждениеЗачисленияЗарплаты.Изменение.Организации
	|Документ.ПодтверждениеНулевойСтавкиНДС.Чтение.Организации
	|Документ.ПодтверждениеНулевойСтавкиНДС.Изменение.Организации
	|Документ.ПодтверждениеОплатыНДСВБюджет.Чтение.Организации
	|Документ.ПодтверждениеОплатыНДСВБюджет.Изменение.Организации
	|Документ.ПодтверждениеОткрытияЛицевыхСчетовСотрудников.Чтение.ГруппыФизическихЛиц
	|Документ.ПодтверждениеОткрытияЛицевыхСчетовСотрудников.Чтение.Организации
	|Документ.ПодтверждениеОткрытияЛицевыхСчетовСотрудников.Изменение.ГруппыФизическихЛиц
	|Документ.ПодтверждениеОткрытияЛицевыхСчетовСотрудников.Изменение.Организации
	|Документ.ПоступлениеВЛизинг.Чтение.Организации
	|Документ.ПоступлениеВЛизинг.Изменение.Организации
	|Документ.ПоступлениеДенежныхДокументов.Чтение.Организации
	|Документ.ПоступлениеДенежныхДокументов.Изменение.Организации
	|Документ.ПоступлениеДопРасходов.Чтение.Организации
	|Документ.ПоступлениеДопРасходов.Изменение.Организации
	|Документ.ПоступлениеИзПереработки.Чтение.Организации
	|Документ.ПоступлениеИзПереработки.Изменение.Организации
	|Документ.ПоступлениеНаРасчетныйСчет.Чтение.Организации
	|Документ.ПоступлениеНаРасчетныйСчет.Изменение.Организации
	|Документ.ПоступлениеНМА.Чтение.Организации
	|Документ.ПоступлениеНМА.Изменение.Организации
	|Документ.ПоступлениеТоваровУслуг.Чтение.Организации
	|Документ.ПоступлениеТоваровУслуг.Изменение.Организации
	|Документ.ПоясненияКДекларацииПоНДС.Чтение.Организации
	|Документ.ПоясненияКДекларацииПоНДС.Изменение.Организации
	|Документ.ПрекращениеСтандартныхВычетовНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.ПрекращениеСтандартныхВычетовНДФЛ.Чтение.Организации
	|Документ.ПрекращениеСтандартныхВычетовНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.ПрекращениеСтандартныхВычетовНДФЛ.Изменение.Организации
	|Документ.ПриемНаРаботу.Чтение.ГруппыФизическихЛиц
	|Документ.ПриемНаРаботу.Чтение.Организации
	|Документ.ПриемНаРаботу.Изменение.ГруппыФизическихЛиц
	|Документ.ПриемНаРаботу.Изменение.Организации
	|Документ.ПринятиеКУчетуНМА.Чтение.Организации
	|Документ.ПринятиеКУчетуНМА.Изменение.Организации
	|Документ.ПринятиеКУчетуОС.Чтение.Организации
	|Документ.ПринятиеКУчетуОС.Изменение.Организации
	|Документ.ПриходныйКассовыйОрдер.Чтение.ВидыОперацийПКО
	|Документ.ПриходныйКассовыйОрдер.Чтение.Организации
	|Документ.ПриходныйКассовыйОрдер.Изменение.ВидыОперацийПКО
	|Документ.ПриходныйКассовыйОрдер.Изменение.Организации
	|Документ.ПрочиеКонтролируемыеСделки.Чтение.Организации
	|Документ.ПрочиеКонтролируемыеСделки.Изменение.Организации
	|Документ.РаспределениеНДС.Чтение.Организации
	|Документ.РаспределениеНДС.Изменение.Организации
	|Документ.РасходныйКассовыйОрдер.Чтение.Организации
	|Документ.РасходныйКассовыйОрдер.Изменение.Организации
	|Документ.РасходыПредпринимателя.Чтение.Организации
	|Документ.РасходыПредпринимателя.Изменение.Организации
	|Документ.РеализацияОтгруженныхТоваров.Чтение.Организации
	|Документ.РеализацияОтгруженныхТоваров.Изменение.Организации
	|Документ.РеализацияТоваровУслуг.Чтение.Организации
	|Документ.РеализацияТоваровУслуг.Изменение.Организации
	|Документ.РеализацияУслугПоПереработке.Чтение.Организации
	|Документ.РеализацияУслугПоПереработке.Изменение.Организации
	|Документ.РегистрацияОплатыОсновныхСредствДляИП.Чтение.Организации
	|Документ.РегистрацияОплатыОсновныхСредствДляИП.Изменение.Организации
	|Документ.РегистрацияОплатыОсновныхСредствДляУСН.Чтение.Организации
	|Документ.РегистрацияОплатыОсновныхСредствДляУСН.Изменение.Организации
	|Документ.РегистрацияСуммыУбыткаУСН.Чтение.Организации
	|Документ.РегистрацияСуммыУбыткаУСН.Изменение.Организации
	|Документ.РегистрУчета.Чтение.Организации
	|Документ.РегистрУчета.Изменение.Организации
	|Документ.РегламентированныйОтчет.Чтение.Организации
	|Документ.РегламентированныйОтчет.Изменение.Организации
	|Документ.РегламентнаяОперация.Чтение.Организации
	|Документ.РегламентнаяОперация.Изменение.Организации
	|Документ.РеестрДанныхЭЛНЗаполняемыхРаботодателем.Чтение.Организации
	|Документ.РеестрДанныхЭЛНЗаполняемыхРаботодателем.Изменение.Организации
	|Документ.РеестрДСВ_3.Чтение.ГруппыФизическихЛиц
	|Документ.РеестрДСВ_3.Чтение.Организации
	|Документ.РеестрДСВ_3.Изменение.ГруппыФизическихЛиц
	|Документ.РеестрДСВ_3.Изменение.Организации
	|Документ.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий.Чтение.ГруппыФизическихЛиц
	|Документ.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий.Чтение.Организации
	|Документ.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий.Изменение.ГруппыФизическихЛиц
	|Документ.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий.Изменение.Организации
	|Документ.РеестрСЗВ_6_2.Чтение.ГруппыФизическихЛиц
	|Документ.РеестрСЗВ_6_2.Чтение.Организации
	|Документ.РеестрСЗВ_6_2.Изменение.ГруппыФизическихЛиц
	|Документ.РеестрСЗВ_6_2.Изменение.Организации
	|Документ.РеестрСчетовФактурПоставщика.Чтение.Организации
	|Документ.РеестрСчетовФактурПоставщика.Изменение.Организации
	|Документ.РозничнаяПродажа.Чтение.Организации
	|Документ.РозничнаяПродажа.Изменение.Организации
	|Документ.СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХ.Чтение.ГруппыФизическихЛиц
	|Документ.СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХ.Чтение.Организации
	|Документ.СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХ.Изменение.ГруппыФизическихЛиц
	|Документ.СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХ.Изменение.Организации
	|Документ.СведенияОЗастрахованныхЛицахСЗВ_М.Чтение.ГруппыФизическихЛиц
	|Документ.СведенияОЗастрахованныхЛицахСЗВ_М.Чтение.Организации
	|Документ.СведенияОЗастрахованныхЛицахСЗВ_М.Изменение.ГруппыФизическихЛиц
	|Документ.СведенияОЗастрахованныхЛицахСЗВ_М.Изменение.Организации
	|Документ.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ.Чтение.ГруппыФизическихЛиц
	|Документ.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ.Чтение.Организации
	|Документ.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ.Изменение.ГруппыФизическихЛиц
	|Документ.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ.Изменение.Организации
	|Документ.СогласиеНаОбработкуПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|Документ.СогласиеНаОбработкуПерсональныхДанных.Чтение.Организации
	|Документ.СогласиеНаОбработкуПерсональныхДанных.Изменение.ГруппыФизическихЛиц
	|Документ.СогласиеНаОбработкуПерсональныхДанных.Изменение.Организации
	|Документ.СообщениеОбменСБанками.Чтение.Организации
	|Документ.СписаниеДепонированнойЗарплаты.Чтение.ГруппыФизическихЛиц
	|Документ.СписаниеДепонированнойЗарплаты.Чтение.Организации
	|Документ.СписаниеДепонированнойЗарплаты.Изменение.ГруппыФизическихЛиц
	|Документ.СписаниеДепонированнойЗарплаты.Изменение.Организации
	|Документ.СписаниеМатериаловИзЭксплуатации.Чтение.Организации
	|Документ.СписаниеМатериаловИзЭксплуатации.Изменение.Организации
	|Документ.СписаниеНДС.Чтение.Организации
	|Документ.СписаниеНДС.Изменение.Организации
	|Документ.СписаниеНМА.Чтение.Организации
	|Документ.СписаниеНМА.Изменение.Организации
	|Документ.СписаниеОС.Чтение.Организации
	|Документ.СписаниеОС.Изменение.Организации
	|Документ.СписаниеСРасчетногоСчета.Чтение.Организации
	|Документ.СписаниеСРасчетногоСчета.Изменение.Организации
	|Документ.СписаниеТоваров.Чтение.Организации
	|Документ.СписаниеТоваров.Изменение.Организации
	|Документ.СправкаНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.СправкаНДФЛ.Чтение.Организации
	|Документ.СправкаНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.СправкаНДФЛ.Изменение.Организации
	|Документ.СправкиНДФЛДляПередачиВНалоговыйОрган.Чтение.ГруппыФизическихЛиц
	|Документ.СправкиНДФЛДляПередачиВНалоговыйОрган.Чтение.Организации
	|Документ.СправкиНДФЛДляПередачиВНалоговыйОрган.Изменение.ГруппыФизическихЛиц
	|Документ.СправкиНДФЛДляПередачиВНалоговыйОрган.Изменение.Организации
	|Документ.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль.Чтение.ГруппыФизическихЛиц
	|Документ.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль.Чтение.Организации
	|Документ.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль.Изменение.ГруппыФизическихЛиц
	|Документ.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль.Изменение.Организации
	|Документ.СчетНаОплатуПокупателю.Чтение.Организации
	|Документ.СчетНаОплатуПокупателю.Изменение.Организации
	|Документ.СчетНаОплатуПоставщика.Чтение.Организации
	|Документ.СчетНаОплатуПоставщика.Изменение.Организации
	|Документ.СчетФактураВыданный.Чтение.Организации
	|Документ.СчетФактураВыданный.Изменение.Организации
	|Документ.СчетФактураПолученный.Чтение.Организации
	|Документ.СчетФактураПолученный.Изменение.Организации
	|Документ.ТаможеннаяДекларацияЭкспорт.Чтение.Организации
	|Документ.ТаможеннаяДекларацияЭкспорт.Изменение.Организации
	|Документ.ТребованиеНакладная.Чтение.Организации
	|Документ.ТребованиеНакладная.Изменение.Организации
	|Документ.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.Чтение.Организации
	|Документ.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.Изменение.Организации
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Чтение.Организации
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Изменение.Организации
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Чтение.Организации
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Изменение.Организации
	|Документ.УведомлениеОКонтролируемыхСделках.Чтение.Организации
	|Документ.УведомлениеОКонтролируемыхСделках.Изменение.Организации
	|Документ.УведомлениеОПолучателеДокументов.Чтение.Организации
	|Документ.УведомлениеОПолучателеДокументов.Изменение.Организации
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Чтение.Организации
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Изменение.Организации
	|Документ.УведомлениеОПравеНаИмущественныйВычетДляНДФЛ.Чтение.ГруппыФизическихЛиц
	|Документ.УведомлениеОПравеНаИмущественныйВычетДляНДФЛ.Чтение.Организации
	|Документ.УведомлениеОПравеНаИмущественныйВычетДляНДФЛ.Изменение.ГруппыФизическихЛиц
	|Документ.УведомлениеОПравеНаИмущественныйВычетДляНДФЛ.Изменение.Организации
	|Документ.УведомлениеОСпецрежимахНалогообложения.Чтение.Организации
	|Документ.УведомлениеОСпецрежимахНалогообложения.Изменение.Организации
	|Документ.УведомлениеОСписанииКиЗГИСМ.Чтение.Организации
	|Документ.УведомлениеОСписанииКиЗГИСМ.Изменение.Организации
	|Документ.Увольнение.Чтение.ГруппыФизическихЛиц
	|Документ.Увольнение.Чтение.Организации
	|Документ.Увольнение.Изменение.ГруппыФизическихЛиц
	|Документ.Увольнение.Изменение.Организации
	|Документ.УдалитьАвансовыйПлатежИностранцаПоНДФЛ.Чтение.Организации
	|Документ.УдалитьАнкетаЗастрахованногоЛица.Чтение.Организации
	|Документ.УдалитьАнкетаЗастрахованногоЛица.Изменение.Организации
	|Документ.УдалитьВводПроцентаДеятельностиЕНВД.Чтение.Организации
	|Документ.УдалитьВводПроцентаДеятельностиЕНВД.Изменение.Организации
	|Документ.УдалитьВводСведенийОПлановыхНачисленияхРаботниковОрганизаций.Чтение.Организации
	|Документ.УдалитьВводСведенийОПлановыхНачисленияхРаботниковОрганизаций.Изменение.Организации
	|Документ.УдалитьДепонированиеОрганизаций.Чтение.Организации
	|Документ.УдалитьДепонированиеОрганизаций.Изменение.Организации
	|Документ.УдалитьЗаявкаНаОткрытиеСчетов.Чтение.Организации
	|Документ.УдалитьЗаявкаНаОткрытиеСчетов.Изменение.Организации
	|Документ.УдалитьЗаявлениеОбОбменеДубликатеСтраховогоСвидетельства.Чтение.Организации
	|Документ.УдалитьЗаявлениеОбОбменеДубликатеСтраховогоСвидетельства.Изменение.Организации
	|Документ.УдалитьЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ.Чтение.Организации
	|Документ.УдалитьКадровоеПеремещениеОрганизаций.Чтение.Организации
	|Документ.УдалитьКадровоеПеремещениеОрганизаций.Изменение.Организации
	|Документ.УдалитьНачислениеЗарплатыРаботникамОрганизаций.Чтение.Организации
	|Документ.УдалитьНачислениеЗарплатыРаботникамОрганизаций.Изменение.Организации
	|Документ.УдалитьНДФЛВозвратНалога.Чтение.Организации
	|Документ.УдалитьНДФЛВозвратНалога.Изменение.Организации
	|Документ.УдалитьНДФЛиЕСНДоходыИНалоги.Чтение.Организации
	|Документ.УдалитьНДФЛиЕСНДоходыИНалоги.Изменение.Организации
	|Документ.УдалитьНДФЛПерерасчет.Чтение.Организации
	|Документ.УдалитьНДФЛПерерасчет.Изменение.Организации
	|Документ.УдалитьНДФЛПодтверждениеПраваНаИмущественныйВычет.Чтение.Организации
	|Документ.УдалитьНДФЛПодтверждениеПраваНаИмущественныйВычет.Изменение.Организации
	|Документ.УдалитьОтражениеЗарплатыВУчете.Чтение.Организации
	|Документ.УдалитьОтражениеЗарплатыВУчете.Изменение.Организации
	|Документ.УдалитьПачкаДокументовСЗВ_6_4.Чтение.Организации
	|Документ.УдалитьПачкаДокументовСЗВ_6_4.Изменение.Организации
	|Документ.УдалитьПачкаДокументовСПВ_2.Чтение.Организации
	|Документ.УдалитьПачкаРазделов6РасчетаРСВ_1.Чтение.Организации
	|Документ.УдалитьПередачаДСВвПФР.Чтение.Организации
	|Документ.УдалитьПередачаСЗВ4вПФР.Чтение.Организации
	|Документ.УдалитьПеречислениеНДФЛвБюджет.Чтение.Организации
	|Документ.УдалитьПриемНаРаботуВОрганизацию.Чтение.Организации
	|Документ.УдалитьПроизвольныйЭД.Чтение.Организации
	|Документ.УдалитьРасчетЕСН.Чтение.Организации
	|Документ.УдалитьРасчетыПоСтраховымВзносам.Чтение.Организации
	|Документ.УдалитьРегистрацияОплатыНДСВБюджет.Чтение.Организации
	|Документ.УдалитьСведенияОВзносахИСтраховомСтажеСПВ1.Чтение.Организации
	|Документ.УдалитьСведенияОДоходахФизлиц.Чтение.Организации
	|Документ.УдалитьСведенияОЗастрахованныхЛицахСЗВ_М.Чтение.Организации
	|Документ.УдалитьСведенияОНачисленномЗаработкеСЗВ63.Чтение.Организации
	|Документ.УдалитьСведенияОТрудовомСтажеИЗаработкеСЗВ4.Чтение.Организации
	|Документ.УдалитьСписаниеДепонентовВДоходыОрганизаций.Чтение.Организации
	|Документ.УдалитьСправкаОЗаработкеДляРасчетаПособий.Чтение.Организации
	|Документ.УдалитьСправкаПоНДФЛВНалоговыйОрган.Чтение.Организации
	|Документ.УдалитьСправкаПоНДФЛВНалоговыйОрганС2015.Чтение.Организации
	|Документ.УдалитьСправкаПоНДФЛСотруднику.Чтение.Организации
	|Документ.УдалитьСправкаПоНДФЛСотрудникуС2015.Чтение.Организации
	|Документ.УдалитьУвольнениеИзОрганизаций.Чтение.Организации
	|Документ.УстановкаПорядкаЗакрытияПодразделений.Чтение.Организации
	|Документ.УстановкаПорядкаЗакрытияПодразделений.Изменение.Организации
	|Документ.ФормированиеЗаписейКнигиПокупок.Чтение.Организации
	|Документ.ФормированиеЗаписейКнигиПокупок.Изменение.Организации
	|Документ.ФормированиеЗаписейКнигиПродаж.Чтение.Организации
	|Документ.ФормированиеЗаписейКнигиПродаж.Изменение.Организации
	|Документ.ФормированиеЗаписейРаздела7ДекларацииНДС.Чтение.Организации
	|Документ.ФормированиеЗаписейРаздела7ДекларацииНДС.Изменение.Организации
	|Документ.ФормированиеУставногоКапитала.Чтение.Организации
	|Документ.ФормированиеУставногоКапитала.Изменение.Организации
	|Документ.ЭлектронныйДокументВходящий.Чтение.Организации
	|Документ.ЭлектронныйДокументИсходящий.Чтение.Организации
	|ЖурналДокументов.АнкетыПерсонифицированногоУчета.Чтение.Объект.Документ.ПачкаДокументовАДВ_1
	|ЖурналДокументов.АнкетыПерсонифицированногоУчета.Чтение.Объект.Документ.ПачкаДокументовАДВ_2
	|ЖурналДокументов.АнкетыПерсонифицированногоУчета.Чтение.Объект.Документ.ПачкаДокументовАДВ_3
	|ЖурналДокументов.АнкетыПерсонифицированногоУчета.Чтение.Объект.Документ.СведенияОЗастрахованныхЛицахСЗВ_М
	|ЖурналДокументов.АнкетыПерсонифицированногоУчета.Чтение.Объект.Документ.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ
	|ЖурналДокументов.ВыплатаЗарплаты.Чтение.Организации
	|ЖурналДокументов.Деньги.Чтение.Организации
	|ЖурналДокументов.ДенежныеДокументы.Чтение.Организации
	|ЖурналДокументов.ДобровольноеПенсионноеСтрахованиеПФР.Чтение.Объект.Документ.ПачкаДокументовДСВ_1
	|ЖурналДокументов.ДобровольноеПенсионноеСтрахованиеПФР.Чтение.Объект.Документ.РеестрДСВ_3
	|ЖурналДокументов.Документы.Чтение.Организации
	|ЖурналДокументов.ДокументыОбменаСБанкамиПоЗарплатнымПроектам.Чтение.Организации
	|ЖурналДокументов.ДокументыПоНДФЛ.Чтение.Объект.Документ.АвансовыйПлатежИностранцаПоНДФЛ
	|ЖурналДокументов.ДокументыПоНДФЛ.Чтение.Объект.Документ.ВозвратНДФЛ
	|ЖурналДокументов.ДокументыПоНДФЛ.Чтение.Объект.Документ.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ
	|ЖурналДокументов.ДокументыПоНДФЛ.Чтение.Объект.Документ.ЗаявлениеОПодтвержденииПраваНаЗачетАвансовПоНДФЛ
	|ЖурналДокументов.ДокументыПоНДФЛ.Чтение.Объект.Документ.ОперацияНалоговогоУчетаПоНДФЛ
	|ЖурналДокументов.ДокументыПоНДФЛ.Чтение.Объект.Документ.ПерерасчетНДФЛ
	|ЖурналДокументов.ДокументыПоНДФЛ.Чтение.Объект.Документ.ПрекращениеСтандартныхВычетовНДФЛ
	|ЖурналДокументов.ДокументыПоНДФЛ.Чтение.Объект.Документ.СправкаНДФЛ
	|ЖурналДокументов.ДокументыПоНДФЛ.Чтение.Объект.Документ.СправкиНДФЛДляПередачиВНалоговыйОрган
	|ЖурналДокументов.ДокументыПоНДФЛ.Чтение.Объект.Документ.СправкиПоНДФЛДляРасчетаПоНалогуНаПрибыль
	|ЖурналДокументов.ДокументыПоНДФЛ.Чтение.Объект.Документ.УведомлениеОПравеНаИмущественныйВычетДляНДФЛ
	|ЖурналДокументов.ДокументыПоНМА.Чтение.Организации
	|ЖурналДокументов.ДокументыПоОС.Чтение.Организации
	|ЖурналДокументов.ДокументыПоУчетуНДСДляПередачиВЭлектронномВиде.Чтение.Организации
	|ЖурналДокументов.ЖурналОпераций.Чтение.Организации
	|ЖурналДокументов.ЗаявленияНаВычеты.Чтение.Объект.Документ.ЗаявлениеНаПредоставлениеСтандартныхВычетовПоНДФЛ
	|ЖурналДокументов.ЗаявленияНаВычеты.Чтение.Объект.Документ.ПрекращениеСтандартныхВычетовНДФЛ
	|ЖурналДокументов.ЗаявленияНаВычеты.Чтение.Объект.Документ.УведомлениеОПравеНаИмущественныйВычетДляНДФЛ
	|ЖурналДокументов.ЗаявленияОписиИРеестрыНаВыплатуПособий.Чтение.Объект.Документ.ЗаявлениеВФССОВозмещенииВыплатРодителямДетейИнвалидов
	|ЖурналДокументов.ЗаявленияОписиИРеестрыНаВыплатуПособий.Чтение.Объект.Документ.ЗаявлениеВФССОВозмещенииРасходовНаПогребение
	|ЖурналДокументов.ЗаявленияОписиИРеестрыНаВыплатуПособий.Чтение.Объект.Документ.ЗаявлениеСотрудникаНаВыплатуПособия
	|ЖурналДокументов.ЗаявленияОписиИРеестрыНаВыплатуПособий.Чтение.Объект.Документ.ОписьЗаявленийСотрудниковНаВыплатуПособий
	|ЖурналДокументов.ЗаявленияОписиИРеестрыНаВыплатуПособий.Чтение.Объект.Документ.РеестрСведенийНеобходимыхДляНазначенияИВыплатыПособий
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.КадровыйПеревод
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.ПриемНаРаботу
	|ЖурналДокументов.КадровыеДокументы.Чтение.Объект.Документ.Увольнение
	|ЖурналДокументов.НачислениеЗарплаты.Чтение.Объект.Документ.БольничныйЛист
	|ЖурналДокументов.НачислениеЗарплаты.Чтение.Объект.Документ.НачислениеЗарплаты
	|ЖурналДокументов.НачислениеЗарплаты.Чтение.Объект.Документ.Отпуск
	|ЖурналДокументов.ПараметрыАмортизацииНМА.Чтение.Организации
	|ЖурналДокументов.ПараметрыАмортизацииОС.Чтение.Организации
	|ЖурналДокументов.ПерсонифицированныйУчет.Чтение.Объект.Документ.ВедомостьУплатыАДВ_11
	|ЖурналДокументов.ПерсонифицированныйУчет.Чтение.Объект.Документ.ДанныеОКорректировкеСведенийЗастрахованныхЛицСЗВ_КОРР
	|ЖурналДокументов.ПерсонифицированныйУчет.Чтение.Объект.Документ.ОписьОДВ_1
	|ЖурналДокументов.ПерсонифицированныйУчет.Чтение.Объект.Документ.ОписьПачекСЗВ_6
	|ЖурналДокументов.ПерсонифицированныйУчет.Чтение.Объект.Документ.ПачкаДокументовСЗВ_6_1
	|ЖурналДокументов.ПерсонифицированныйУчет.Чтение.Объект.Документ.ПачкаДокументовСЗВ_6_3
	|ЖурналДокументов.ПерсонифицированныйУчет.Чтение.Объект.Документ.ПачкаДокументовСЗВ_6_4
	|ЖурналДокументов.ПерсонифицированныйУчет.Чтение.Объект.Документ.ПачкаДокументовСЗВ_К
	|ЖурналДокументов.ПерсонифицированныйУчет.Чтение.Объект.Документ.ПачкаДокументовСПВ_1
	|ЖурналДокументов.ПерсонифицированныйУчет.Чтение.Объект.Документ.ПачкаДокументовСПВ_2
	|ЖурналДокументов.ПерсонифицированныйУчет.Чтение.Объект.Документ.ПачкаРазделов6РасчетаРСВ_1
	|ЖурналДокументов.ПерсонифицированныйУчет.Чтение.Объект.Документ.РеестрСЗВ_6_2
	|ЖурналДокументов.ПерсонифицированныйУчет.Чтение.Объект.Документ.СведенияОЗаработкеСтажеЗастрахованныхЛицСЗВ_ИСХ
	|ЖурналДокументов.ПерсонифицированныйУчет.Чтение.Объект.Документ.СведенияОЗастрахованныхЛицахСЗВ_М
	|ЖурналДокументов.ПерсонифицированныйУчет.Чтение.Объект.Документ.СведенияОСтраховомСтажеЗастрахованныхЛицСЗВ_СТАЖ
	|ЖурналДокументов.ПроизводственныеДокументы.Чтение.Организации
	|ЖурналДокументов.РегламентныеОперацииНДС.Чтение.Организации
	|ЖурналДокументов.СкладскиеДокументы.Чтение.Организации
	|ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Чтение.ДополнительныеСведения
	|РегистрСведений.АктуальностьСпискаЗадачБухгалтера.Чтение.Организации
	|РегистрСведений.АктуальностьСпискаЗадачБухгалтера.Изменение.Организации
	|РегистрСведений.АрхивДанныхРегламентированнойОтчетности.Чтение.Организации
	|РегистрСведений.АрхивДанныхРегламентированнойОтчетности.Изменение.Организации
	|РегистрСведений.БазаРаспределенияНДС.Чтение.Организации
	|РегистрСведений.БазаРаспределенияНДС.Изменение.Организации
	|РегистрСведений.БухучетЗарплатыОрганизаций.Чтение.Организации
	|РегистрСведений.БухучетЗарплатыОрганизаций.Изменение.Организации
	|РегистрСведений.ВариантыПримененияТребованийЗаконодательства.Чтение.Организации
	|РегистрСведений.ВариантыПримененияТребованийЗаконодательства.Изменение.Организации
	|РегистрСведений.ВзаимозависимыеЛица.Чтение.Организации
	|РегистрСведений.ВзаимозависимыеЛица.Изменение.Организации
	|РегистрСведений.ВложенияНеформализованныхДокументов.Чтение.Организации
	|РегистрСведений.ВложенияНеформализованныхДокументов.Изменение.Организации
	|РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ВременноПребывающиеПринятыеПоДолгосрочнымДоговорам.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ГражданствоФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ГражданствоФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ГрафикиАмортизацииОСБухгалтерскийУчет.Чтение.Организации
	|РегистрСведений.ГрафикиАмортизацииОСБухгалтерскийУчет.Изменение.Организации
	|РегистрСведений.ДанныеПервичныхДокументов.Чтение.Организации
	|РегистрСведений.ДанныеПервичныхДокументов.Изменение.Организации
	|РегистрСведений.ДатыВводаНачальныхОстатков.Чтение.Организации
	|РегистрСведений.ДатыВводаНачальныхОстатков.Изменение.Организации
	|РегистрСведений.ДоговорыУчастниковКонтролируемыхСделок.Чтение.Организации
	|РегистрСведений.ДоговорыУчастниковКонтролируемыхСделок.Изменение.Организации
	|РегистрСведений.ДокументыПоНеоблагаемымНДСОперациям.Чтение.Организации
	|РегистрСведений.ДокументыПоНеоблагаемымНДСОперациям.Изменение.Организации
	|РегистрСведений.ДокументыПоТребованиюФНС.Чтение.Организации
	|РегистрСведений.ДокументыПоТребованиюФНС.Изменение.Организации
	|РегистрСведений.ДокументыФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ДокументыФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ДолиСписанияКосвенныхРасходов.Чтение.Организации
	|РегистрСведений.ДолиСписанияКосвенныхРасходов.Изменение.Организации
	|РегистрСведений.ДополнительныеСведения.Чтение.ДополнительныеСведения
	|РегистрСведений.ДополнительныеСведения.Изменение.ДополнительныеСведения
	|РегистрСведений.ДоходыПредыдущегоМестаРаботыНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ДоходыПредыдущегоМестаРаботыНДФЛ.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ЖурналНовыхСобытий.Чтение.Организации
	|РегистрСведений.ЖурналОтправокВКонтролирующиеОрганы.Чтение.Организации
	|РегистрСведений.ЖурналОтправокВКонтролирующиеОрганы.Изменение.Организации
	|РегистрСведений.ЖурналОтчетовСтатусы.Чтение.Организации
	|РегистрСведений.ЖурналОтчетовСтатусы.Изменение.Организации
	|РегистрСведений.ЖурналУчетаСчетовФактур.Чтение.Организации
	|РегистрСведений.ЖурналУчетаСчетовФактур.Изменение.Организации
	|РегистрСведений.ЗадачиБухгалтера.Чтение.Организации
	|РегистрСведений.ЗадачиБухгалтера.Изменение.Организации
	|РегистрСведений.ЗадачиБухгалтераНалоговыеПлатежи.Чтение.Организации
	|РегистрСведений.ЗадачиБухгалтераНалоговыеПлатежи.Изменение.Организации
	|РегистрСведений.ЗарплатаКадрыДолиСписанияКосвенныхРасходов.Чтение.Организации
	|РегистрСведений.ЗарплатаКадрыДолиСписанияКосвенныхРасходов.Изменение.Организации
	|РегистрСведений.ЗаявленияОбОтменеПроверокКонтролирующимиОрганами.Чтение.Организации
	|РегистрСведений.ЗаявленияОбОтменеПроверокКонтролирующимиОрганами.Изменение.Организации
	|РегистрСведений.ЗначенияПараметровТиповойОперации.Чтение.Организации
	|РегистрСведений.ЗначенияПараметровТиповойОперации.Изменение.Организации
	|РегистрСведений.ИзбранныеРегламентированныеОтчеты.Чтение.Организации
	|РегистрСведений.ИзбранныеРегламентированныеОтчеты.Изменение.Организации
	|РегистрСведений.ИмпортТоваровТаможенныйСоюз.Чтение.Организации
	|РегистрСведений.ИмпортТоваровТаможенныйСоюз.Изменение.Организации
	|РегистрСведений.ИПСведенияОбОплатеОСиНМА.Чтение.Организации
	|РегистрСведений.ИПСведенияОбОплатеОСиНМА.Изменение.Организации
	|РегистрСведений.ИсключенныеИзПерепроведенияМесяцы.Чтение.Организации
	|РегистрСведений.ИсключенныеИзПерепроведенияМесяцы.Изменение.Организации
	|РегистрСведений.ИспользоватьНесколькоБанковскихСчетовОрганизации.Чтение.Организации
	|РегистрСведений.ИспользоватьНесколькоБанковскихСчетовОрганизации.Изменение.Организации
	|РегистрСведений.ИсторияРегистрацийВНалоговомОргане.Чтение.Организации
	|РегистрСведений.ИсторияРегистрацийВНалоговомОргане.Изменение.Организации
	|РегистрСведений.ИсторияРегистрацийВОрганеПФР.Чтение.Организации
	|РегистрСведений.ИсторияРегистрацийВОрганеПФР.Изменение.Организации
	|РегистрСведений.КадроваяИсторияСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.КадроваяИсторияСотрудников.Чтение.Организации
	|РегистрСведений.КадроваяИсторияСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.КадроваяИсторияСотрудников.Изменение.Организации
	|РегистрСведений.КадроваяИсторияСотрудниковИнтервальный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.КадроваяИсторияСотрудниковИнтервальный.Чтение.Организации
	|РегистрСведений.КадроваяИсторияСотрудниковИнтервальный.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.КадроваяИсторияСотрудниковИнтервальный.Изменение.Организации
	|РегистрСведений.ЛимитОстаткаКассыОрганизаций.Чтение.Организации
	|РегистрСведений.ЛимитОстаткаКассыОрганизаций.Изменение.Организации
	|РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Чтение.Организации
	|РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ЛицевыеСчетаСотрудниковПоЗарплатнымПроектам.Изменение.Организации
	|РегистрСведений.МестаВыплатыЗарплатыСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.МестаВыплатыЗарплатыСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.МестонахождениеОСБухгалтерскийУчет.Чтение.Организации
	|РегистрСведений.МестонахождениеОСБухгалтерскийУчет.Изменение.Организации
	|РегистрСведений.МетодыОпределенияПрямыхРасходовПроизводстваВНУ.Чтение.Организации
	|РегистрСведений.МетодыОпределенияПрямыхРасходовПроизводстваВНУ.Изменение.Организации
	|РегистрСведений.МетодыРаспределенияКосвенныхРасходовОрганизаций.Чтение.Организации
	|РегистрСведений.МетодыРаспределенияКосвенныхРасходовОрганизаций.Изменение.Организации
	|РегистрСведений.НалогиОтчеты.Чтение.Организации
	|РегистрСведений.НалогиОтчеты.Изменение.Организации
	|РегистрСведений.НастройкаЗаполненияСвободныхСтрокФормСтатистики.Чтение.Организации
	|РегистрСведений.НастройкаЗаполненияСвободныхСтрокФормСтатистики.Изменение.Организации
	|РегистрСведений.НастройкаЗаполненияФормСтатистики.Чтение.Организации
	|РегистрСведений.НастройкаЗаполненияФормСтатистики.Изменение.Организации
	|РегистрСведений.НастройкиЗарплатаКадры.Чтение.Организации
	|РегистрСведений.НастройкиЗарплатаКадры.Изменение.Организации
	|РегистрСведений.НастройкиИнтеграцииСоСпринтером.Чтение.Организации
	|РегистрСведений.НастройкиИнтеграцииСоСпринтером.Изменение.Организации
	|РегистрСведений.НастройкиИспользованияСтраховыхВзносовПоКлассамУсловийТруда.Чтение.Организации
	|РегистрСведений.НастройкиОбменаБанкРоссии.Чтение.Организации
	|РегистрСведений.НастройкиОбменаБанкРоссии.Изменение.Организации
	|РегистрСведений.НастройкиОбменаРПН.Чтение.Организации
	|РегистрСведений.НастройкиОбменаРПН.Изменение.Организации
	|РегистрСведений.НастройкиОбменаСКлиентомБанка.Чтение.Организации
	|РегистрСведений.НастройкиОбменаСКлиентомБанка.Изменение.Организации
	|РегистрСведений.НастройкиОбменаФСРАР.Чтение.Организации
	|РегистрСведений.НастройкиОбменаФСРАР.Изменение.Организации
	|РегистрСведений.НастройкиОбменаФСС.Чтение.Организации
	|РегистрСведений.НастройкиОбменаФСС.Изменение.Организации
	|РегистрСведений.НастройкиОбменаФТС.Чтение.Организации
	|РегистрСведений.НастройкиОбменаФТС.Изменение.Организации
	|РегистрСведений.НастройкиРасчетаРезервовОтпусков.Чтение.Организации
	|РегистрСведений.НастройкиСистемыНалогообложения.Чтение.Организации
	|РегистрСведений.НастройкиСистемыНалогообложения.Изменение.Организации
	|РегистрСведений.НастройкиУчетаЗарплаты.Чтение.Организации
	|РегистрСведений.НастройкиУчетаЗарплаты.Изменение.Организации
	|РегистрСведений.НастройкиУчетаНалогаНаПрибыль.Чтение.Организации
	|РегистрСведений.НастройкиУчетаНалогаНаПрибыль.Изменение.Организации
	|РегистрСведений.НастройкиУчетаНалогаНаПрибыльГруппОбособленныхПодразделений.Чтение.Организации
	|РегистрСведений.НастройкиУчетаНалогаНаПрибыльГруппОбособленныхПодразделений.Изменение.Организации
	|РегистрСведений.НастройкиУчетаНДС.Чтение.Организации
	|РегистрСведений.НастройкиУчетаНДС.Изменение.Организации
	|РегистрСведений.НастройкиУчетаНДФЛ.Чтение.Организации
	|РегистрСведений.НастройкиУчетаНДФЛ.Изменение.Организации
	|РегистрСведений.НастройкиУчетаСтраховыхВзносов.Чтение.Организации
	|РегистрСведений.НастройкиУчетаСтраховыхВзносовИП.Чтение.Организации
	|РегистрСведений.НастройкиУчетаСтраховыхВзносовИП.Изменение.Организации
	|РегистрСведений.НастройкиУчетаУСН.Чтение.Организации
	|РегистрСведений.НастройкиУчетаУСН.Изменение.Организации
	|РегистрСведений.НачислениеАмортизацииНМАСпециальныйКоэффициентНалоговыйУчет.Чтение.Организации
	|РегистрСведений.НачислениеАмортизацииНМАСпециальныйКоэффициентНалоговыйУчет.Изменение.Организации
	|РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет.Чтение.Организации
	|РегистрСведений.НачислениеАмортизацииОСБухгалтерскийУчет.Изменение.Организации
	|РегистрСведений.НачислениеАмортизацииОСНалоговыйУчет.Чтение.Организации
	|РегистрСведений.НачислениеАмортизацииОСНалоговыйУчет.Изменение.Организации
	|РегистрСведений.НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет.Чтение.Организации
	|РегистрСведений.НачислениеАмортизацииОССпециальныйКоэффициентНалоговыйУчет.Изменение.Организации
	|РегистрСведений.НоменклатурныеГруппыРеализацииПродукцииУслуг.Чтение.Организации
	|РегистрСведений.НоменклатурныеГруппыРеализацииПродукцииУслуг.Изменение.Организации
	|РегистрСведений.НомераЛистовКассовойКниги.Чтение.Организации
	|РегистрСведений.НомераЛистовКассовойКниги.Изменение.Организации
	|РегистрСведений.НумераторПачекПФР.Чтение.Организации
	|РегистрСведений.НумераторПачекПФР.Изменение.Организации
	|РегистрСведений.ОборудованиеПоОрганизациям.Чтение.Организации
	|РегистрСведений.ОборудованиеПоОрганизациям.Изменение.Организации
	|РегистрСведений.ОбъектыСтроительстваОрганизаций.Чтение.Организации
	|РегистрСведений.ОбъектыСтроительстваОрганизаций.Изменение.Организации
	|РегистрСведений.ОплатаВедомостейНаВыплатуЗарплаты.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ОплатаВедомостейНаВыплатуЗарплаты.Чтение.Организации
	|РегистрСведений.ОплатаВедомостейНаВыплатуЗарплаты.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ОплатаВедомостейНаВыплатуЗарплаты.Изменение.Организации
	|РегистрСведений.ОрганизацииДляОбменаГИСМ.Чтение.Организации
	|РегистрСведений.ОрганизацииДляОбменаГИСМ.Изменение.Организации
	|РегистрСведений.ОсновныеВариантыПеречисленияСотруднику.Чтение.Организации
	|РегистрСведений.ОсновныеВариантыПеречисленияСотруднику.Изменение.Организации
	|РегистрСведений.ОсновныеДоговорыКонтрагента.Чтение.Организации
	|РегистрСведений.ОсновныеДоговорыКонтрагента.Изменение.Организации
	|РегистрСведений.ОтветственныеЛицаОрганизаций.Чтение.Организации
	|РегистрСведений.ОтветственныеЛицаОрганизаций.Изменение.Организации
	|РегистрСведений.ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП.Чтение.Организации
	|РегистрСведений.ОтветыНаЗапросыВыпискиИзЕГРЮЛ_ЕГРИП.Изменение.Организации
	|РегистрСведений.ОтветыНаЗапросыИОН.Чтение.Организации
	|РегистрСведений.ОтветыНаЗапросыИОН.Изменение.Организации
	|РегистрСведений.ОтветыНаЗапросыИОС.Чтение.Организации
	|РегистрСведений.ОтветыНаЗапросыИОС.Изменение.Организации
	|РегистрСведений.ОтложенноеОткрытиеЛицевыхСчетовСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ОтложенноеОткрытиеЛицевыхСчетовСотрудников.Чтение.Организации
	|РегистрСведений.ОтложенноеОткрытиеЛицевыхСчетовСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ОтложенноеОткрытиеЛицевыхСчетовСотрудников.Изменение.Организации
	|РегистрСведений.ОтражениеВРегламентированномУчетеНастройкиОрганизаций.Чтение.Организации
	|РегистрСведений.ОтражениеВРегламентированномУчетеНастройкиОрганизаций.Изменение.Организации
	|РегистрСведений.ОшибочныеРеквизитыКонтрагентов.Чтение.Организации
	|РегистрСведений.ОшибочныеРеквизитыКонтрагентов.Изменение.Организации
	|РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.Чтение.Организации
	|РегистрСведений.ПараметрыАмортизацииОСБухгалтерскийУчет.Изменение.Организации
	|РегистрСведений.ПараметрыАмортизацииОСНалоговыйУчет.Чтение.Организации
	|РегистрСведений.ПараметрыАмортизацииОСНалоговыйУчет.Изменение.Организации
	|РегистрСведений.ПараметрыТорговыхТочек.Чтение.Организации
	|РегистрСведений.ПараметрыТорговыхТочек.Изменение.Организации
	|РегистрСведений.ПервоначальныеСведенияНМАБухгалтерскийУчет.Чтение.Организации
	|РегистрСведений.ПервоначальныеСведенияНМАБухгалтерскийУчет.Изменение.Организации
	|РегистрСведений.ПервоначальныеСведенияНМАНалоговыйУчет.Чтение.Организации
	|РегистрСведений.ПервоначальныеСведенияНМАНалоговыйУчет.Изменение.Организации
	|РегистрСведений.ПервоначальныеСведенияНМАНалоговыйУчетУСН.Чтение.Организации
	|РегистрСведений.ПервоначальныеСведенияНМАНалоговыйУчетУСН.Изменение.Организации
	|РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.Чтение.Организации
	|РегистрСведений.ПервоначальныеСведенияОСБухгалтерскийУчет.Изменение.Организации
	|РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет.Чтение.Организации
	|РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчет.Изменение.Организации
	|РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчетУСН.Чтение.Организации
	|РегистрСведений.ПервоначальныеСведенияОСНалоговыйУчетУСН.Изменение.Организации
	|РегистрСведений.ПлановыеАвансы.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеАвансы.Чтение.Организации
	|РегистрСведений.ПлановыеАвансы.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеАвансы.Изменение.Организации
	|РегистрСведений.ПлановыеАвансыИнтервальный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеАвансыИнтервальный.Чтение.Организации
	|РегистрСведений.ПлановыеАвансыИнтервальный.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеАвансыИнтервальный.Изменение.Организации
	|РегистрСведений.ПлановыеНачисления.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеНачисления.Чтение.Организации
	|РегистрСведений.ПлановыеНачисления.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеНачисления.Изменение.Организации
	|РегистрСведений.ПлановыеНачисленияИнтервальный.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеНачисленияИнтервальный.Чтение.Организации
	|РегистрСведений.ПлановыеНачисленияИнтервальный.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеНачисленияИнтервальный.Изменение.Организации
	|РегистрСведений.ПлановыеУдержания.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеУдержания.Чтение.Организации
	|РегистрСведений.ПлановыеУдержания.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПлановыеУдержания.Изменение.Организации
	|РегистрСведений.ПолучателиПлатежаЗарплатногоПроекта.Чтение.Организации
	|РегистрСведений.ПолучателиПлатежаЗарплатногоПроекта.Изменение.Организации
	|РегистрСведений.ПорядокЗакрытияПодразделенийОрганизаций.Чтение.Организации
	|РегистрСведений.ПорядокЗакрытияПодразделенийОрганизаций.Изменение.Организации
	|РегистрСведений.ПорядокУплатыАкцизов.Чтение.Организации
	|РегистрСведений.ПорядокУплатыАкцизов.Изменение.Организации
	|РегистрСведений.ПорядокУплатыНалоговНаМестах.Чтение.Организации
	|РегистрСведений.ПорядокУплатыНалоговНаМестах.Изменение.Организации
	|РегистрСведений.ПрименениеСтандартныхВычетовПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ПрименениеСтандартныхВычетовПоНДФЛ.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ПроцентЕНВДДляУчетаЗатратНаЗарплату.Чтение.Организации
	|РегистрСведений.ПроцентЕНВДДляУчетаЗатратНаЗарплату.Изменение.Организации
	|РегистрСведений.РасчетДолейБазыНалогаНаПрибыль.Чтение.Организации
	|РегистрСведений.РасчетДолейБазыНалогаНаПрибыль.Изменение.Организации
	|РегистрСведений.РасчетЗемельногоНалога.Чтение.Организации
	|РегистрСведений.РасчетЗемельногоНалога.Изменение.Организации
	|РегистрСведений.РасчетНалогаНаИмущество.Чтение.Организации
	|РегистрСведений.РасчетНалогаНаИмущество.Изменение.Организации
	|РегистрСведений.РасчетНалогаУСН.Чтение.Организации
	|РегистрСведений.РасчетНалогаУСН.Изменение.Организации
	|РегистрСведений.РасчетНормированияРасходов.Чтение.Организации
	|РегистрСведений.РасчетНормированияРасходов.Изменение.Организации
	|РегистрСведений.РасчетПереоценкиВалютныхСредств.Чтение.Организации
	|РегистрСведений.РасчетПереоценкиВалютныхСредств.Изменение.Организации
	|РегистрСведений.РасчетПорядкаПеределов.Чтение.Организации
	|РегистрСведений.РасчетПорядкаПеределов.Изменение.Организации
	|РегистрСведений.РасчетРазницВОценкеАктивовИОбязательств.Чтение.Организации
	|РегистрСведений.РасчетРазницВОценкеАктивовИОбязательств.Изменение.Организации
	|РегистрСведений.РасчетРаспределенияКосвенныхРасходов.Чтение.Организации
	|РегистрСведений.РасчетРаспределенияКосвенныхРасходов.Изменение.Организации
	|РегистрСведений.РасчетРасходовПоАренде.Чтение.Организации
	|РегистрСведений.РасчетРасходовПоАренде.Изменение.Организации
	|РегистрСведений.РасчетРезерваОтпусков.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.РасчетРезерваОтпусков.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.РасчетРезервовПоСомнительнымДолгам.Чтение.Организации
	|РегистрСведений.РасчетРезервовПоСомнительнымДолгам.Изменение.Организации
	|РегистрСведений.РасчетСебестоимостиПродукции.Чтение.Организации
	|РегистрСведений.РасчетСебестоимостиПродукции.Изменение.Организации
	|РегистрСведений.РасчетСписанияКосвенныхРасходов.Чтение.Организации
	|РегистрСведений.РасчетСписанияКосвенныхРасходов.Изменение.Организации
	|РегистрСведений.РасчетСписанияРБП.Чтение.Организации
	|РегистрСведений.РасчетСписанияРБП.Изменение.Организации
	|РегистрСведений.РасчетСтавкиНалогаНаПрибыльЗаМесяц.Чтение.Организации
	|РегистрСведений.РасчетСтавкиНалогаНаПрибыльЗаМесяц.Изменение.Организации
	|РегистрСведений.РасчетСтоимостиНалоговыхАктивовИОбязательств.Чтение.Организации
	|РегистрСведений.РасчетСтоимостиНалоговыхАктивовИОбязательств.Изменение.Организации
	|РегистрСведений.РасчетСтоимостиНалоговыхАктивовИОбязательствПослеИзмененияСтавкиНалогаНаПрибыль.Чтение.Организации
	|РегистрСведений.РасчетСтоимостиНалоговыхАктивовИОбязательствПослеИзмененияСтавкиНалогаНаПрибыль.Изменение.Организации
	|РегистрСведений.РасчетТорговойНаценкиАТТ.Чтение.Организации
	|РегистрСведений.РасчетТорговойНаценкиАТТ.Изменение.Организации
	|РегистрСведений.РасчетТорговойНаценкиНТТ.Чтение.Организации
	|РегистрСведений.РасчетТорговойНаценкиНТТ.Изменение.Организации
	|РегистрСведений.РасчетТранспортногоНалога.Чтение.Организации
	|РегистрСведений.РасчетТранспортногоНалога.Изменение.Организации
	|РегистрСведений.РасчетыСКонтрагентамиОтложенноеПроведение.Чтение.Организации
	|РегистрСведений.РасчетыСКонтрагентамиОтложенноеПроведение.Изменение.Организации
	|РегистрСведений.РасшифровкаКУДиР.Чтение.Организации
	|РегистрСведений.РасшифровкаКУДиР.Изменение.Организации
	|РегистрСведений.РегиональныеОсобенностиЕНВД.Чтение.Организации
	|РегистрСведений.РегиональныеОсобенностиЕНВД.Изменение.Организации
	|РегистрСведений.РегистрацияЗемельныхУчастков.Чтение.Организации
	|РегистрСведений.РегистрацияЗемельныхУчастков.Изменение.Организации
	|РегистрСведений.РегистрацияТранспортныхСредств.Чтение.Организации
	|РегистрСведений.РегистрацияТранспортныхСредств.Изменение.Организации
	|РегистрСведений.РегулярныеПлатежи.Чтение.Организации
	|РегистрСведений.РегулярныеПлатежи.Изменение.Организации
	|РегистрСведений.РегулярныеСчетаПокупателям.Чтение.Организации
	|РегистрСведений.РегулярныеСчетаПокупателям.Изменение.Организации
	|РегистрСведений.РеквизитыУплатыНалоговИПлатежейВБюджет.Чтение.Организации
	|РегистрСведений.РеквизитыУплатыНалоговИПлатежейВБюджет.Изменение.Организации
	|РегистрСведений.РублевыеСуммыДокументовВВалюте.Чтение.Организации
	|РегистрСведений.РублевыеСуммыДокументовВВалюте.Изменение.Организации
	|РегистрСведений.СведенияОбИнвалидностиФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОбИнвалидностиФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОбОрганизацииДляКонтролируемыхСделок.Чтение.Организации
	|РегистрСведений.СведенияОбОрганизацииДляКонтролируемыхСделок.Изменение.Организации
	|РегистрСведений.СведенияОВзносахВПФР.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СведенияОВзносахВПФР.Чтение.Организации
	|РегистрСведений.СведенияТаможенныхДекларацийЭкспорт.Чтение.Организации
	|РегистрСведений.СведенияТаможенныхДекларацийЭкспорт.Изменение.Организации
	|РегистрСведений.СобытияКалендаряБухгалтера.Чтение.Организации
	|РегистрСведений.СобытияКалендаряБухгалтера.Изменение.Организации
	|РегистрСведений.СобытияОСОрганизаций.Чтение.Организации
	|РегистрСведений.СобытияОСОрганизаций.Изменение.Организации
	|РегистрСведений.СогласияНаОбработкуПерсональныхДанных.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СогласияНаОбработкуПерсональныхДанных.Чтение.Организации
	|РегистрСведений.СоставыГруппПользователей.Чтение.ВнешниеПользователи
	|РегистрСведений.СоставыГруппПользователей.Чтение.Пользователи
	|РегистрСведений.СостояниеНастройкиЗаполненияФормСтатистики.Чтение.Организации
	|РегистрСведений.СостоянияДокументовЗачисленияЗарплаты.Чтение.Организации
	|РегистрСведений.СостоянияДокументовЗачисленияЗарплаты.Изменение.Организации
	|РегистрСведений.СостоянияДокументовОткрытияЛицевыхСчетов.Чтение.Организации
	|РегистрСведений.СостоянияДокументовОткрытияЛицевыхСчетов.Изменение.Организации
	|РегистрСведений.СостоянияНМАОрганизаций.Чтение.Организации
	|РегистрСведений.СостоянияНМАОрганизаций.Изменение.Организации
	|РегистрСведений.СостоянияОСОрганизаций.Чтение.Организации
	|РегистрСведений.СостоянияОСОрганизаций.Изменение.Организации
	|РегистрСведений.СпособыОтраженияРасходовПоАмортизацииНМАБухгалтерскийУчет.Чтение.Организации
	|РегистрСведений.СпособыОтраженияРасходовПоАмортизацииНМАБухгалтерскийУчет.Изменение.Организации
	|РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Чтение.Организации
	|РегистрСведений.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.Изменение.Организации
	|РегистрСведений.СпособыОтраженияРасходовПоАренднымПлатежамОСНалоговыйУчет.Чтение.Организации
	|РегистрСведений.СпособыОтраженияРасходовПоАренднымПлатежамОСНалоговыйУчет.Изменение.Организации
	|РегистрСведений.СпособыОтраженияРасходовПоНалогам.Чтение.Организации
	|РегистрСведений.СпособыОтраженияРасходовПоНалогам.Изменение.Организации
	|РегистрСведений.СрокиОплатыДокументов.Чтение.Организации
	|РегистрСведений.СрокиОплатыДокументов.Изменение.Организации
	|РегистрСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Чтение.Организации
	|РегистрСведений.СтавкаВзносаНаСтрахованиеОтНесчастныхСлучаев.Изменение.Организации
	|РегистрСведений.СтавкиНалогаНаИмущество.Чтение.Организации
	|РегистрСведений.СтавкиНалогаНаИмущество.Изменение.Организации
	|РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.Чтение.Организации
	|РегистрСведений.СтавкиНалогаНаИмуществоПоОтдельнымОсновнымСредствам.Изменение.Организации
	|РегистрСведений.СтавкиНалогаНаПрибыльВБюджетСубъектовРФ.Чтение.Организации
	|РегистрСведений.СтавкиНалогаНаПрибыльВБюджетСубъектовРФ.Изменение.Организации
	|РегистрСведений.СтандартныеВычетыНаДетейНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтандартныеВычетыНаДетейНДФЛ.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СтандартныеВычетыФизическихЛицНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтандартныеВычетыФизическихЛицНДФЛ.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СтатусФизическихЛицКакНалогоплательщиковНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтатусФизическихЛицКакНалогоплательщиковНДФЛ.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СтатусыДокументов.Чтение.Организации
	|РегистрСведений.СтатусыЗапросовРеестровСчетовФактур.Чтение.Организации
	|РегистрСведений.СтатусыЗапросовРеестровСчетовФактур.Изменение.Организации
	|РегистрСведений.СтатусыЗастрахованныхФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.СтатусыЗастрахованныхФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.СтатусыОтправки.Чтение.Организации
	|РегистрСведений.СтатусыОтправки.Изменение.Организации
	|РегистрСведений.СтруктураСтоимостиЗапасов.Чтение.Организации
	|РегистрСведений.СтруктураСтоимостиЗапасов.Изменение.Организации
	|РегистрСведений.СчетаБухгалтерскогоУчетаНМА.Чтение.Организации
	|РегистрСведений.СчетаБухгалтерскогоУчетаНМА.Изменение.Организации
	|РегистрСведений.СчетаБухгалтерскогоУчетаОС.Чтение.Организации
	|РегистрСведений.СчетаБухгалтерскогоУчетаОС.Изменение.Организации
	|РегистрСведений.СчетаУчетаНоменклатуры.Чтение.Организации
	|РегистрСведений.СчетаУчетаНоменклатуры.Изменение.Организации
	|РегистрСведений.СчетаУчетаРасчетовСКонтрагентами.Чтение.Организации
	|РегистрСведений.СчетаУчетаРасчетовСКонтрагентами.Изменение.Организации
	|РегистрСведений.СчетчикВыгрузокОтчетностиВБанк.Чтение.Организации
	|РегистрСведений.СчетчикВыгрузокОтчетностиВБанк.Изменение.Организации
	|РегистрСведений.СчетчикиВыгрузок.Чтение.Организации
	|РегистрСведений.СчетчикиВыгрузок.Изменение.Организации
	|РегистрСведений.ТекущаяТарифнаяСтавкаСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ТекущаяТарифнаяСтавкаСотрудников.Чтение.Организации
	|РегистрСведений.ТекущаяТарифнаяСтавкаСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ТекущаяТарифнаяСтавкаСотрудников.Изменение.Организации
	|РегистрСведений.ТекущиеКадровыеДанныеСотрудников.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ТекущиеКадровыеДанныеСотрудников.Чтение.Организации
	|РегистрСведений.ТекущиеКадровыеДанныеСотрудников.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ТекущиеКадровыеДанныеСотрудников.Изменение.Организации
	|РегистрСведений.ТерриториальныеУсловияПФР.Чтение.Организации
	|РегистрСведений.ТерриториальныеУсловияПФР.Изменение.Организации
	|РегистрСведений.УдалитьЗаработкиПолучателейПособияПоУходуЗаРебенкомДоПолутораЛет.Чтение.Организации
	|РегистрСведений.УдалитьЛицевыеСчетаРаботниковОрганизации.Чтение.Организации
	|РегистрСведений.УдалитьПлановыеНачисленияРаботниковОрганизаций.Чтение.Организации
	|РегистрСведений.УдалитьПроцентДеятельностиЕНВД.Чтение.Организации
	|РегистрСведений.УдалитьРаботникиОрганизаций.Чтение.Организации
	|РегистрСведений.УдалитьСведенияОВыплатахРаботникамОрганизацийПоПлатежнымВедомостям.Чтение.Организации
	|РегистрСведений.УдалитьСотрудникиФизическихЛиц.Чтение.Организации
	|РегистрСведений.УдалитьСуммыВзносовДляСЗВ4.Чтение.Организации
	|РегистрСведений.УполномоченныеЛицаОрганизаций.Чтение.Организации
	|РегистрСведений.УполномоченныеЛицаОрганизаций.Изменение.Организации
	|РегистрСведений.УсловияУдержанияПоИсполнительномуДокументу.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.УсловияУдержанияПоИсполнительномуДокументу.Чтение.Организации
	|РегистрСведений.УсловияУдержанияПоИсполнительномуДокументу.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.УсловияУдержанияПоИсполнительномуДокументу.Изменение.Организации
	|РегистрСведений.УчетнаяПолитика.Чтение.Организации
	|РегистрСведений.УчетнаяПолитика.Изменение.Организации
	|РегистрСведений.ФайлыДокументовРеализацииПолномочийНалоговыхОрганов.Чтение.Организации
	|РегистрСведений.ФайлыДокументовРеализацииПолномочийНалоговыхОрганов.Изменение.Организации
	|РегистрСведений.ФизическиеПоказателиЕНВД.Чтение.Организации
	|РегистрСведений.ФизическиеПоказателиЕНВД.Изменение.Организации
	|РегистрСведений.ФИОФизическихЛиц.Чтение.ГруппыФизическихЛиц
	|РегистрСведений.ФИОФизическихЛиц.Изменение.ГруппыФизическихЛиц
	|РегистрСведений.ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов.Чтение.Организации
	|РегистрСведений.ХранилищеЭлектронныхПредставленийРегламентированныхОтчетов.Изменение.Организации
	|РегистрСведений.ХранимыеФайлыВерсий.Чтение.Объект.Документ.УдалитьЗаявлениеАбонентаСпецоператораСвязи
	|РегистрСведений.ХранимыеФайлыВерсий.Чтение.Объект.Справочник.Организации
	|РегистрСведений.ХранимыеФайлыВерсий.Чтение.Объект.Справочник.ПапкиФайлов
	|РегистрСведений.ХранимыеФайлыВерсий.Чтение.Объект.Справочник.ФизическиеЛица
	|РегистрНакопления.АвансовыеПлатежиИностранцевПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.АвансовыеПлатежиИностранцевПоНДФЛ.Чтение.Организации
	|РегистрНакопления.АвансовыеПлатежиИностранцевПоНДФЛ.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.АвансовыеПлатежиИностранцевПоНДФЛ.Изменение.Организации
	|РегистрНакопления.ВзаиморасчетыСДепонентами.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ВзаиморасчетыСДепонентами.Чтение.Организации
	|РегистрНакопления.ВзаиморасчетыСДепонентами.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.ВзаиморасчетыСДепонентами.Изменение.Организации
	|РегистрНакопления.ВзаиморасчетыССотрудниками.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ВзаиморасчетыССотрудниками.Чтение.Организации
	|РегистрНакопления.ВзаиморасчетыССотрудниками.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.ВзаиморасчетыССотрудниками.Изменение.Организации
	|РегистрНакопления.ВыплатаОтпусковЗаСчетРезерва.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ВыплатаОтпусковЗаСчетРезерва.Чтение.Организации
	|РегистрНакопления.ВыплатаОтпусковЗаСчетРезерва.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.ВыплатаОтпусковЗаСчетРезерва.Изменение.Организации
	|РегистрНакопления.ВыпускПродукцииУслуг.Чтение.Организации
	|РегистрНакопления.ВыпускПродукцииУслуг.Изменение.Организации
	|РегистрНакопления.ВыработкаМатериалов.Чтение.Организации
	|РегистрНакопления.ВыработкаМатериалов.Изменение.Организации
	|РегистрНакопления.ВыработкаНМА.Чтение.Организации
	|РегистрНакопления.ВыработкаНМА.Изменение.Организации
	|РегистрНакопления.ВыработкаОС.Чтение.Организации
	|РегистрНакопления.ВыработкаОС.Изменение.Организации
	|РегистрНакопления.ЗакупленныеТоварыКомитентов.Чтение.Организации
	|РегистрНакопления.ЗакупленныеТоварыКомитентов.Изменение.Организации
	|РегистрНакопления.ЗарплатаКВыплате.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ЗарплатаКВыплате.Чтение.Организации
	|РегистрНакопления.ЗарплатаКВыплате.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.ЗарплатаКВыплате.Изменение.Организации
	|РегистрНакопления.ЗарплатаКВыплатеАвансом.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ЗарплатаКВыплатеАвансом.Чтение.Организации
	|РегистрНакопления.ЗарплатаКВыплатеАвансом.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.ЗарплатаКВыплатеАвансом.Изменение.Организации
	|РегистрНакопления.ИмущественныеВычетыНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ИмущественныеВычетыНДФЛ.Чтение.Организации
	|РегистрНакопления.ИмущественныеВычетыНДФЛ.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.ИмущественныеВычетыНДФЛ.Изменение.Организации
	|РегистрНакопления.ИПДоходы.Чтение.Организации
	|РегистрНакопления.ИПДоходы.Изменение.Организации
	|РегистрНакопления.ИПИныеМатериальныеРасходы.Чтение.Организации
	|РегистрНакопления.ИПИныеМатериальныеРасходы.Изменение.Организации
	|РегистрНакопления.ИПМПЗ.Чтение.Организации
	|РегистрНакопления.ИПМПЗ.Изменение.Организации
	|РегистрНакопления.ИПМПЗОбороты.Чтение.Организации
	|РегистрНакопления.ИПМПЗОбороты.Изменение.Организации
	|РегистрНакопления.ИПМПЗОтгруженные.Чтение.Организации
	|РегистрНакопления.ИПМПЗОтгруженные.Изменение.Организации
	|РегистрНакопления.ИППрочиеДоходы.Чтение.Организации
	|РегистрНакопления.ИППрочиеДоходы.Изменение.Организации
	|РегистрНакопления.ИППрочиеРасходы.Чтение.Организации
	|РегистрНакопления.ИППрочиеРасходы.Изменение.Организации
	|РегистрНакопления.ИПРасходыНаОплатуТруда.Чтение.Организации
	|РегистрНакопления.ИПРасходыНаОплатуТруда.Изменение.Организации
	|РегистрНакопления.ИПРБП.Чтение.Организации
	|РегистрНакопления.ИПРБП.Изменение.Организации
	|РегистрНакопления.ИсчисленныеСтраховыеВзносы.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ИсчисленныеСтраховыеВзносы.Чтение.Организации
	|РегистрНакопления.ИсчисленныеСтраховыеВзносы.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.ИсчисленныеСтраховыеВзносы.Изменение.Организации
	|РегистрНакопления.КнигаУчетаДоходовИРасходов.Чтение.Организации
	|РегистрНакопления.КнигаУчетаДоходовИРасходов.Изменение.Организации
	|РегистрНакопления.КнигаУчетаДоходовИРасходовНМА.Чтение.Организации
	|РегистрНакопления.КнигаУчетаДоходовИРасходовНМА.Изменение.Организации
	|РегистрНакопления.КнигаУчетаДоходовИРасходовОС.Чтение.Организации
	|РегистрНакопления.КнигаУчетаДоходовИРасходовОС.Изменение.Организации
	|РегистрНакопления.КнигаУчетаДоходовИРасходовРаздел4.Чтение.Организации
	|РегистрНакопления.КнигаУчетаДоходовИРасходовРаздел4.Изменение.Организации
	|РегистрНакопления.КнигаУчетаДоходовПатент.Чтение.Организации
	|РегистрНакопления.КнигаУчетаДоходовПатент.Изменение.Организации
	|РегистрНакопления.КонтролируемыеСделкиОрганизаций.Чтение.Организации
	|РегистрНакопления.КонтролируемыеСделкиОрганизаций.Изменение.Организации
	|РегистрНакопления.НачисленияУдержанияПоСотрудникам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.НачисленияУдержанияПоСотрудникам.Чтение.Организации
	|РегистрНакопления.НачисленияУдержанияПоСотрудникам.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.НачисленияУдержанияПоСотрудникам.Изменение.Организации
	|РегистрНакопления.НДСАвансыПоДоговорамКомиссии.Чтение.Организации
	|РегистрНакопления.НДСАвансыПоДоговорамКомиссии.Изменение.Организации
	|РегистрНакопления.НДСВключенныйВСтоимость.Чтение.Организации
	|РегистрНакопления.НДСВключенныйВСтоимость.Изменение.Организации
	|РегистрНакопления.НДСЗаписиКнигиПокупок.Чтение.Организации
	|РегистрНакопления.НДСЗаписиКнигиПокупок.Изменение.Организации
	|РегистрНакопления.НДСЗаписиКнигиПродаж.Чтение.Организации
	|РегистрНакопления.НДСЗаписиКнигиПродаж.Изменение.Организации
	|РегистрНакопления.НДСЗаписиРаздела7Декларации.Чтение.Организации
	|РегистрНакопления.НДСЗаписиРаздела7Декларации.Изменение.Организации
	|РегистрНакопления.НДСНеоблагаемыеОперации.Чтение.Организации
	|РегистрНакопления.НДСНеоблагаемыеОперации.Изменение.Организации
	|РегистрНакопления.НДСКосвенныеРасходы.Чтение.Организации
	|РегистрНакопления.НДСКосвенныеРасходы.Изменение.Организации
	|РегистрНакопления.НДСНачисленный.Чтение.Организации
	|РегистрНакопления.НДСНачисленный.Изменение.Организации
	|РегистрНакопления.НДСПоПриобретеннымЦенностям.Чтение.Организации
	|РегистрНакопления.НДСПоПриобретеннымЦенностям.Изменение.Организации
	|РегистрНакопления.НДСПредъявленный.Чтение.Организации
	|РегистрНакопления.НДСПредъявленный.Изменение.Организации
	|РегистрНакопления.НДСПредъявленныйРеализация0.Чтение.Организации
	|РегистрНакопления.НДСПредъявленныйРеализация0.Изменение.Организации
	|РегистрНакопления.НДСРаздельныйУчет.Чтение.Организации
	|РегистрНакопления.НДСРаздельныйУчет.Изменение.Организации
	|РегистрНакопления.НДСРеализация0.Чтение.Организации
	|РегистрНакопления.НДСРеализация0.Изменение.Организации
	|РегистрНакопления.НДСсАвансов.Чтение.Организации
	|РегистрНакопления.НДСсАвансов.Изменение.Организации
	|РегистрНакопления.ОплатаСчетов.Чтение.Организации
	|РегистрНакопления.ОплатаСчетов.Изменение.Организации
	|РегистрНакопления.ОплатыНМАДляУСН.Чтение.Организации
	|РегистрНакопления.ОплатыНМАДляУСН.Изменение.Организации
	|РегистрНакопления.ОплатыОСДляУСН.Чтение.Организации
	|РегистрНакопления.ОплатыОСДляУСН.Изменение.Организации
	|РегистрНакопления.ОтработанноеВремяПоСотрудникам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ОтработанноеВремяПоСотрудникам.Чтение.Организации
	|РегистрНакопления.ОтработанноеВремяПоСотрудникам.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.ОтработанноеВремяПоСотрудникам.Изменение.Организации
	|РегистрНакопления.ОценочныеОбязательства.Чтение.Организации
	|РегистрНакопления.ОценочныеОбязательства.Изменение.Организации
	|РегистрНакопления.ПособияПоСоциальномуСтрахованию.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ПособияПоСоциальномуСтрахованию.Чтение.Организации
	|РегистрНакопления.ПособияПоСоциальномуСтрахованию.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.ПособияПоСоциальномуСтрахованию.Изменение.Организации
	|РегистрНакопления.ПособияПоУходуЗаРебенком.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ПособияПоУходуЗаРебенком.Чтение.Организации
	|РегистрНакопления.ПособияПоУходуЗаРебенком.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.ПособияПоУходуЗаРебенком.Изменение.Организации
	|РегистрНакопления.ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Чтение.Организации
	|РегистрНакопления.ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.ПредоставленныеСтандартныеИСоциальныеВычетыНДФЛ.Изменение.Организации
	|РегистрНакопления.ПрочиеРасчеты.Чтение.Организации
	|РегистрНакопления.ПрочиеРасчеты.Изменение.Организации
	|РегистрНакопления.РасходыНаПлатон.Чтение.Организации
	|РегистрНакопления.РасходыНаПлатон.Изменение.Организации
	|РегистрНакопления.РасходыПриУСН.Чтение.Организации
	|РегистрНакопления.РасходыПриУСН.Изменение.Организации
	|РегистрНакопления.РасходыУменьшающиеНалогПоОтдельнымРежимам.Чтение.Организации
	|РегистрНакопления.РасходыУменьшающиеНалогПоОтдельнымРежимам.Изменение.Организации
	|РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Чтение.Организации
	|РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.РасчетыНалоговыхАгентовСБюджетомПоНДФЛ.Изменение.Организации
	|РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Чтение.Организации
	|РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.РасчетыНалогоплательщиковСБюджетомПоНДФЛ.Изменение.Организации
	|РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам.Чтение.Организации
	|РегистрНакопления.РасчетыСФондамиПоСтраховымВзносам.Изменение.Организации
	|РегистрНакопления.РеализацияУслуг.Чтение.Организации
	|РегистрНакопления.РеализацияУслуг.Изменение.Организации
	|РегистрНакопления.РеализованныеТоварыКомитентов.Чтение.Организации
	|РегистрНакопления.РеализованныеТоварыКомитентов.Изменение.Организации
	|РегистрНакопления.СведенияОДоходахНДФЛ.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.СведенияОДоходахНДФЛ.Чтение.Организации
	|РегистрНакопления.СведенияОДоходахНДФЛ.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.СведенияОДоходахНДФЛ.Изменение.Организации
	|РегистрНакопления.СведенияОДоходахСтраховыеВзносы.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.СведенияОДоходахСтраховыеВзносы.Чтение.Организации
	|РегистрНакопления.СведенияОДоходахСтраховыеВзносы.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.СведенияОДоходахСтраховыеВзносы.Изменение.Организации
	|РегистрНакопления.СтраховыеВзносыПереданныеВПФР.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.СтраховыеВзносыПереданныеВПФР.Чтение.Организации
	|РегистрНакопления.СтраховыеВзносыПереданныеВПФР.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.СтраховыеВзносыПереданныеВПФР.Изменение.Организации
	|РегистрНакопления.СтраховыеВзносыПоФизическимЛицам.Чтение.ГруппыФизическихЛиц
	|РегистрНакопления.СтраховыеВзносыПоФизическимЛицам.Чтение.Организации
	|РегистрНакопления.СтраховыеВзносыПоФизическимЛицам.Изменение.ГруппыФизическихЛиц
	|РегистрНакопления.СтраховыеВзносыПоФизическимЛицам.Изменение.Организации
	|РегистрНакопления.УдалитьАвансовыеПлатежиИностранцевПоНДФЛ.Чтение.Организации
	|РегистрНакопления.УдалитьВзаиморасчетыСДепонентамиОрганизаций.Чтение.Организации
	|РегистрНакопления.УдалитьВзаиморасчетыСДепонентамиОрганизаций.Изменение.Организации
	|РегистрНакопления.УдалитьВзаиморасчетыСРаботникамиОрганизаций.Чтение.Организации
	|РегистрНакопления.УдалитьВзаиморасчетыСРаботникамиОрганизаций.Изменение.Организации
	|РегистрНакопления.УдалитьЕСНИсчисленный.Чтение.Организации
	|РегистрНакопления.УдалитьЕСНИсчисленный.Изменение.Организации
	|РегистрНакопления.УдалитьЕСНСведенияОДоходах.Чтение.Организации
	|РегистрНакопления.УдалитьЕСНСведенияОДоходах.Изменение.Организации
	|РегистрНакопления.УдалитьНДФЛИмущественныеВычетыФизлиц.Чтение.Организации
	|РегистрНакопления.УдалитьНДФЛИмущественныеВычетыФизлиц.Изменение.Организации
	|РегистрНакопления.УдалитьНДФЛКЗачету.Чтение.Организации
	|РегистрНакопления.УдалитьНДФЛКЗачету.Изменение.Организации
	|РегистрНакопления.УдалитьНДФЛПредоставленныеСтандартныеВычетыФизЛиц.Чтение.Организации
	|РегистрНакопления.УдалитьНДФЛПредоставленныеСтандартныеВычетыФизЛиц.Изменение.Организации
	|РегистрНакопления.УдалитьНДФЛРасчетыСБюджетом.Чтение.Организации
	|РегистрНакопления.УдалитьНДФЛРасчетыСБюджетом.Изменение.Организации
	|РегистрНакопления.УдалитьНДФЛСведенияОДоходах.Чтение.Организации
	|РегистрНакопления.УдалитьНДФЛСведенияОДоходах.Изменение.Организации
	|РегистрНакопления.УдалитьПособияПоУходуЗаРебенкомДоПолутораЛет.Чтение.Организации
	|РегистрНакопления.УдалитьПособияПоУходуЗаРебенкомДоПолутораЛет.Изменение.Организации
	|РегистрНакопления.УдалитьПособияСоциальномуСтрахованию.Чтение.Организации
	|РегистрНакопления.УдалитьПособияСоциальномуСтрахованию.Изменение.Организации
	|РегистрНакопления.УдалитьРасчетыПоСтраховымВзносам.Чтение.Организации
	|РегистрНакопления.УдалитьРасчетыПоСтраховымВзносам.Изменение.Организации
	|РегистрНакопления.УдалитьСтраховыеВзносыСведенияОДоходах.Чтение.Организации
	|РегистрНакопления.УдалитьСтраховыеВзносыСведенияОДоходах.Изменение.Организации
	|РегистрНакопления.УплатаНДФЛНалоговымиАгентамиКРаспределению.Чтение.Организации
	|РегистрНакопления.УплатаНДФЛНалоговымиАгентамиКРаспределению.Изменение.Организации
	|РегистрБухгалтерии.Хозрасчетный.Чтение.Организации
	|РегистрБухгалтерии.Хозрасчетный.Изменение.Организации";
	
	// Удаляем строки ограничений для отсутствующих в текущей версии метаданных.
	ОбъектыСОграничениямиПрав = ИменаОбъектовСОграничениямиПрав();
	Для НомерСтроки = 1 По СтрЧислоСтрок(ШаблонОписания) Цикл
		ТекстСтроки = СтрПолучитьСтроку(ШаблонОписания, НомерСтроки);
		Если СтрЧислоВхождений(ТекстСтроки, ".") >= 3 Тогда
			ЧастиСтроки = СтрРазделить(ТекстСтроки, Символы.Таб + " |.", Ложь);
			Если ЧастиСтроки.Количество() > 2 Тогда
				ИмяОбъекта = ЧастиСтроки[0] + "." + ЧастиСтроки[1];
				Если ОбъектыСОграничениямиПрав.Найти(ИмяОбъекта) <> Неопределено Тогда
					Описание = Описание + Символы.ПС + ТекстСтроки;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область ПрофилиПользователей

Функция ОписаниеПрофиляГлавныйБухгалтер()
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Главный бухгалтер'", Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Идентификатор = "62730c03-81d6-11e0-a42a-be487808c52b"; // Произвольный уникальный идентификатор, присвоенный при разработке.
	
	РазрешитьИспользованиеПрограммы(ОписаниеПрофиля, Истина);
	РазрешитьРедактированиеВсехДанныхБухгалтерии(ОписаниеПрофиля);
	
	// Ниже - до конца процедуры: дополнительные права главного бухгалтера
	
#Область НастройкиПрограммы

	ОписаниеПрофиля.Роли.Добавить("ИзменениеМакетовПечатныхФорм");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекБухгалтерии");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДатЗапретаИзменения");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовОтчетов"); // Общих вариантов и вариантов всех пользователей
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПлановОбмена");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПодключаемогоОборудования");
	РазрешитьНастройкуИнтеграцииЕГАИС(ОписаниеПрофиля);
	ИнтеграцияГИСМБП.РазрешитьНастройку(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеМонитораИПП"); // Информирование о договоре ИТС и новых версиях программы
	
#КонецОбласти

#Область АдминистрированиеДанных
	
	ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");// Разрешает редактирование ключевых реквизитов НСИ БСП. Не путать с правом обхода ограничения редактируемых реквизитов объектов.
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		
		// Эта НСИ общая для многих областей. Ее может менять только администратор сервиса.
		// Поэтому в этом профиле права на редактирование не предоставляются.
		// Права на чтение этой НСИ включены в БазовыеПрава, поэтому ЗапретитьРедактированиеОбщихДанных() не применяется.
		
	Иначе
		
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");  // Классификатор адресов
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБанков");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКалендарныхГрафиков");
		
	КонецЕсли;
	
	
#КонецОбласти

#Область ПрикладныеНастройки

	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений"); // Настройка наборов свойств
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКурсовВалют");
	
	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
		ОписаниеПрофиля.Роли,
		УчетЗарплаты.РолиНастройки());
	
#КонецОбласти

#Область Интеграция
	
	// - негосударственные поставщики данных
	
	// библиотека ИнтернетПоддержкаПользователей
	ОписаниеПрофиля.Роли.Добавить("ЗапросНовойСправкиСПАРКРиски"); // предоставляет доступ к функциям сервиса, которые могут тарифицироваться по количеству обращений

#КонецОбласти

	Возврат ОписаниеПрофиля;
	
КонецФункции

Функция ОписаниеПрофиляБухгалтер()
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Бухгалтер'", Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Идентификатор = "ea55b08d-7d30-11e0-b9a7-20cf30c960bf"; // Произвольный уникальный идентификатор, присвоенный при разработке.
	
	РазрешитьИспользованиеПрограммы(ОписаниеПрофиля, Истина);
	РазрешитьРедактированиеВсехДанныхБухгалтерии(ОписаниеПрофиля);
	
	Возврат ОписаниеПрофиля;

КонецФункции

Функция ОписаниеПрофиляТолькоПросмотр()
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Только просмотр'", Метаданные.ОсновнойЯзык.КодЯзыка);
	ОписаниеПрофиля.Идентификатор = "45ce5549-ade3-11e0-9746-00179a3853da"; // Произвольный уникальный идентификатор, присвоенный при разработке.
	
	РазрешитьИспользованиеПрограммы(ОписаниеПрофиля, Ложь);
	
	// Интегральная роль, предоставляющая доступ к большому количеству объектов,
	// хранящих прикладные данные БП.
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхБухгалтерии");
	
#Область ПрикладныеДанные

#Область НормативноСправочнаяИнформацияБСП
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	
#КонецОбласти

#Область НормативноСправочнаяИнформацияБП

	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщейБухгалтерскойНСИ"); // Общедоступные классификаторы
	// Права на остальную НСИ БП - в интегральной роли
	
#КонецОбласти

#Область НормативноСправочнаяИнформацияБИП
	
	// библиотека ИнтернетПоддержкаПользователей
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски"); // предоставляется совместно с ролями, предоставляющими право просмотра контрагентов (интегральная роль ЧтениеДанныхБухгалтерии)
	
#КонецОбласти

#Область ПервичныеДокументы

	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	РазрешитьПросмотрДанныхЕГАИС(ОписаниеПрофиля);
	ИнтеграцияГИСМБП.РазрешитьПросмотрДанных(
		ОписаниеПрофиля,
		ИнтеграцияГИСМБП.НовыйОписаниеОбластейДоступа(Истина)); // Просмотр всех данных ГИСМ
	// Права на остальные документы - в интегральной роли
	
#КонецОбласти

#Область ЗарплатаКадры

	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
		ОписаниеПрофиля.Роли,
		УчетЗарплаты.РолиПросмотраДанных());
	
#КонецОбласти

#Область РегламентированнаяОтчетность

	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБРО");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхРегламентированнойОтчетности");
	
#КонецОбласти

#КонецОбласти // ПрикладныеДанные

#Область Интеграция

	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановОбмена");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭД");
	
#КонецОбласти

#Область ИнформацияИПоддержка

	РазрешитьВсеКаналыПоддержкиПользователей(ОписаниеПрофиля);

#КонецОбласти
	
	Возврат ОписаниеПрофиля;

КонецФункции

Функция ОписаниеПрофиляМенеджерПоПродажам()
	
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по продажам'", Метаданные.ОсновнойЯзык.КодЯзыка);
	
	ОписаниеПрофиля.Идентификатор = "1f75ab92-9e66-11e5-81c6-e0cb4ed5f182"; // Произвольный уникальный идентификатор, присвоенный при разработке.
	ОписаниеПрофиля.Описание = НСтр("ru = 'Описывает полномочия менеджера по продажам.
                                    |В частности, профиль предоставляет доступ к редактированию
                                    |- счетов покупателям
                                    |- накладных на продажу товаров покупателям и актов на оказание услуг
                                    |- возвратов товаров от покупателей
                                    |- данных о контрагентах
                                    |- данных о номенклатуре, включая цены номенклатуры.'");
									
	РазрешитьИспользованиеПрограммы(ОписаниеПрофиля, Истина);

#Область РазделыИнтерфейса

	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПродажи");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаСправочники");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаСклад");

#КонецОбласти

#Область ПрикладныеДанные

#Область НормативноСправочнаяИнформацияБСП

	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	
#КонецОбласти

#Область НормативноСправочнаяИнформацияБП

	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщейБухгалтерскойНСИ"); // Общедоступные классификаторы
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСпискаФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДолжностей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСтатейДвиженияДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШаблоновДоговоров");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКонтрагентов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБанковскихСчетов");
	
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаДосьеКонтрагента"); // Это роль БСП
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеКомандДосьеКонтрагента"); // Это роль БП, предоставляется совместно с ПросмотрОтчетаДосьеКонтрагента
	
#КонецОбласти

#Область НормативноСправочнаяИнформацияБИП
	
	// библиотека ИнтернетПоддержкаПользователей
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски"); // предоставляется совместно с ролями, предоставляющими право просмотра контрагентов (ДобавлениеИзменениеКонтрагентов, ЧтениеКонтрагентов)
	ОписаниеПрофиля.Роли.Добавить("ПостановкаКонтрагентовНаМониторингСПАРКРиски"); // предоставляется совместно с ролями, предоставляющими право добавления контрагентов (ДобавлениеИзменениеКонтрагентов)
	
#КонецОбласти

#Область ПервичныеДокументы

	// Общие права
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы"); // Это роль БСП
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхПервичныхДокументов"); // Роль предоставляется, совместно с правами на конкретные первичные документы
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСроковОплатыДокументов");
	ОписаниеПрофиля.Роли.Добавить("ВыводРеестраДокументов");
	
	// Права на документы конкретных видов
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовПокупателям");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТекстаДополнительныхУсловийВСчетеПокупателю");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРеализацииТоваровУслуг");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСчетовФактурВыданных");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратТоваровОтПокупателя");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетаОРозничныхПродажах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВидыОплатОрганизаций");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРозничныхПродаж");
	
#КонецОбласти

#Область РабочиеМеста

	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиОжидаемаяОплатаОтПокупателей");

#КонецОбласти

#Область Отчеты
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхМонитораРуководителя");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаСчетаНеОплаченныеПокупателями");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхБухгалтерскогоУчета");
	// Роль ЧтениеДанныхБухгалтерскогоУчета позволяет получать данные из регистра бухгалтерии.
	// Она необходима для использования отчетов, получающих данные из регистра, доступ к которым назначается ниже:
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаОстаткиТоваров");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаВаловаяПрибыль");
	
#КонецОбласти

#КонецОбласти

#Область Интеграция

	// Внешние системы
	
	// - бизнес-контрагентов
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаБизнесСеть");
	
	// - государства
	
	// -- Маркировка товаров
	ОбластиДоступа = ИнтеграцияГИСМБП.НовыйОписаниеОбластейДоступа(Ложь);
	ОбластиДоступа.Отгрузки    = Истина; // Продавец может передавать в ГИСМ только данные об отгрузке покупателям
	ИнтеграцияГИСМБП.РазрешитьИнтеграцию(ОписаниеПрофиля, ОбластиДоступа);
	
	
	// Внутри предприятия

	РазрешитьОбмен1СДокументооборот(ОписаниеПрофиля);
	
	// Это роль БП, предоставляется совместно с ЧтениеУчетныхЗаписейЭлектроннойПочты.
	// Предоставляет доступ к сервисным возможностям для работы с электронной почтой, например,
	// использование подписи в письмах, выбор основной учетной записи и т.п.
	ОписаниеПрофиля.Роли.Добавить("РаботаСЭлектроннойПочтойБП");
	
#КонецОбласти

#Область ИнформацияИПоддержка

	РазрешитьПросмотрНовостей(ОписаниеПрофиля);
	
#КонецОбласти
	
	Возврат ОписаниеПрофиля;
	
КонецФункции

// Включает в профиль набор ролей и видов доступа, необходимых для интерактировной работы в конфигурации.
// Этот набор - общий для всех пользователей.
//
// Параметры:
//  ОписаниеПрофиля		 - см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа() - заполняемая коллекция
//  АктивныйПользователь - Булево - Активный пользователь участвует непосредственно в работе предприятия.
//                                  В том числе, это проявляется в том, что он вносит данные в программу.
//                                  Пассивный - только наблюдает.
//
Процедура РазрешитьИспользованиеПрограммы(ОписаниеПрофиля, АктивныйПользователь)

	// Все прикладные пользователи должны обладать базовыми правами
	ОписаниеПрофиля.Роли.Добавить("БазовыеПрава");
	
	// Минимальный доступ к базовым объектам конфигурации.
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБП");
	
	// Набор ролей, предоставляющий минимальный доступ к базовым объектам библиотек, входящих в состав конфигурации.
	// В соответствии с документацией к соответствующим библиотекам, следующие роли должны быть назначены всем пользователям,
	// имеющим право на интерактивный запуск программы,
	// вне зависимости от полномочий, требующих использовать прикладные функции этих библиотек.
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");  // Библиотека электронного документооборота (с контрагентами и банками)
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИПП"); // Библиотека интернет-поддержки пользователей
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБТС"); // Библиотека технологий сервиса
	
	// В БП для всех профилей применяется ограничение доступа к данным по организациям.
	ОписаниеПрофиля.ВидыДоступа.Добавить("Организации");
	
	// Это роли БСП
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");  // Персональные настройки разного рода
	
	Если АктивныйПользователь Тогда
		
		ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена"); // БСП
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеМобильногоПриложения");
		
		// Общепринятые способы интеграции
		ОписаниеПрофиля.Роли.Добавить("ЧтениеУчетныхЗаписейЭлектроннойПочты");
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхПодписейИШифрование");
		ОписаниеПрофиля.Роли.Добавить("ЧтениеПодключаемогоОборудования"); // ввод и вывод данных с помощью подключаемого оборудования
	
		// Это роли БТС, позволяющие подписывать документы в модели сервиса
		ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСертификатовВХранилище");
		ОписаниеПрофиля.Роли.Добавить("ИспользованиеЭлектроннойПодписиВМоделиСервиса");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура РазрешитьРедактированиеВсехДанныхБухгалтерии(ОписаниеПрофиля)
	
	// Интегральная роль, предоставляющая доступ к большому количеству объектов,
	// хранящих прикладные данные БП
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхБухгалтерии");
	
#Область АдминистрированиеДанных

	// см. также ЗапретитьРедактированиеОбщихДанных()
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбщейБухгалтерскойНСИ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНеразделяемыхДанныхРегламентированнойОтчетности");
		
#КонецОбласти

#Область ПрикладныеДанные

#Область НормативноСправочнаяИнформацияБСП

	ОписаниеПрофиля.Роли.Добавить("ЧтениеКурсовВалют");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовКонтактнойИнформации");// Список стран (разделенный)
	
	// Права на использование досье контрагента - в интегральной роли
	
#КонецОбласти

#Область НормативноСправочнаяИнформацияБП

	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщейБухгалтерскойНСИ"); // Общедоступные классификаторы
	// Права на остальную НСИ БП - в интегральной роли
	
#КонецОбласти

#Область НормативноСправочнаяИнформацияБИП
	
	// библиотека ИнтернетПоддержкаПользователей
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхСПАРКРиски"); // предоставляется совместно с ролями, предоставляющими право просмотра контрагентов (интегральная роль ДобавлениеИзменениеДанныхБухгалтерии)
	ОписаниеПрофиля.Роли.Добавить("ПостановкаКонтрагентовНаМониторингСПАРКРиски"); // предоставляется совместно с ролями, предоставляющими право добавления контрагентов (интегральная роль ДобавлениеИзменениеДанныхБухгалтерии)
	
#КонецОбласти

#Область ПервичныеДокументы

	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	
	// Права на первичные документы БП - в интегральной роли
	
#КонецОбласти

#Область ЗарплатаКадры

	ОбщегоНазначенияКлиентСервер.ДополнитьМассив(
		ОписаниеПрофиля.Роли,
		УчетЗарплаты.РолиРедактированияДанных());

#КонецОбласти

#Область РегламентированнаяОтчетность

	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБРО");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРазделяемыхДанныхРегламентированнойОтчетности");
	
#КонецОбласти

#КонецОбласти // ПрикладныеДанные

#Область Интеграция

	// Внешние системы
	
	// - бизнес-контрагентов
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЭД");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаЭД");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаБизнесСеть");
	
	// - государства
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСервиса1СТакском");
	ОписаниеПрофиля.Роли.Добавить("ПравоНаЗащищенныйДокументооборотСКонтролирующимиОрганами");
	
	РазрешитьИнтеграциюЕГАИС(ОписаниеПрофиля);
	ИнтеграцияГИСМБП.РазрешитьИнтеграцию(
		ОписаниеПрофиля,
		ИнтеграцияГИСМБП.НовыйОписаниеОбластейДоступа(Истина)); // Редактирование всех данных ГИСМ
	
	// - Google
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеСинхронизацииСКалендаремGoogle");
	
	// Внутри предприятия
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПлановОбмена");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеСинхронизацииДанных"); // Позволяет выгрузить почти все данные
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбменаСИнтернетМагазином");

	РазрешитьОбмен1СДокументооборот(ОписаниеПрофиля);
	
#КонецОбласти

#Область ИнформацияИПоддержка

	РазрешитьВсеКаналыПоддержкиПользователей(ОписаниеПрофиля);
	
#КонецОбласти

КонецПроцедуры

Процедура РазрешитьВсеКаналыПоддержкиПользователей(ОписаниеПрофиля)
	
	ОписаниеПрофиля.Роли.Добавить("ПросмотрОписанияИзмененийПрограммы");
	ОписаниеПрофиля.Роли.Добавить("Интеграция1СБухфон");
	РазрешитьПросмотрНовостей(ОписаниеПрофиля);
	
	// Подключение к сервисам 1С:ИТС - привилегия пользователя с полными правами,
	// обладающего информацией о заключенных договорах поддержки.
	
КонецПроцедуры

Процедура РазрешитьПросмотрНовостей(ОписаниеПрофиля)
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНовостей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНовостейРазделов"); // Это роль БП, которая предоставляется совместно с ЧтениеНовостей
	
КонецПроцедуры

Процедура РазрешитьОбмен1СДокументооборот(ОписаниеПрофиля)
	
	// ИнтеграцияС1СДокументооборотом
	Если ОбщегоНазначения.ПодсистемаСуществует("ИнтеграцияС1СДокументооборотом") Тогда
		ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБИД");
	КонецЕсли;
	// Конец ИнтеграцияС1СДокументооборотом
	
КонецПроцедуры

Процедура РазрешитьНастройкуИнтеграцииЕГАИС(ОписаниеПрофиля)
	
	// Следует использовать совместно с РазрешитьИнтеграциюЕГАИС() или РазрешитьПросмотрДанныхЕГАИС()
	
	ОписаниеПрофиля.Роли.Добавить("НастройкаСинхронизацииСЕГАИС");
	
КонецПроцедуры

Процедура РазрешитьИнтеграциюЕГАИС(ОписаниеПрофиля)
	
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктаПостановкиНаБалансЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктаСписанияЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВидовАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗагрузкиОстатковЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификатораАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификатораОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТТНВходящейЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТТНИсходящейЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратаИзТорговогоЗалаЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПередачиВТорговыйЗалЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросовЕГАИС");

КонецПроцедуры

Процедура РазрешитьПросмотрДанныхЕГАИС(ОписаниеПрофиля)
	
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктаПостановкиНаБалансЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктаСписанияЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗагрузкиОстатковЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросовЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковАлкогольнойПродукции");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТТНВходящейЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТТНИсходящейЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачиВТорговыйЗалЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратаИзТорговогоЗалаЕГАИС");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИнтегральныеРолиВсеДанныеБухгалтерии()
	
	// В конфигурации применяются два подхода к описанию профилей:
	// - интегральные роли - это устаревший подход, от которого в будущих версиях планируем постепенно отказаться
	// - атомарные роли - современный подход, детально описанный в стандартах разработки.
	
	// Сейчас эти подходы в конфигурации сочетаются.
	
	// Интегральные роли предоставляют право на множество объектов, слабо связанных друг с другом.
	// Часто интегральные роли предоставляют и часть базовых прав.
	
	// Функция описывает перечень интегральных ролей и, для каждой из них - перечень атомарных, содержащих только те права, 
	// которые уже есть в интегральной роли.
	
	ВытесняемыеРоли = Новый Массив;
	
	ОписаниеРолей = Новый Структура;
	ОписаниеРолей.Вставить("ЧтениеДанныхБухгалтерии",              ВытесняемыеРоли);
	ОписаниеРолей.Вставить("ДобавлениеИзменениеДанныхБухгалтерии", ВытесняемыеРоли);
	
	ВытесняемыеРоли.Добавить("БазовыеПраваБП"); // Базовые права включены в соответствующую единую роль
	ВытесняемыеРоли.Добавить("ЧтениеНовостейРазделов");// Право на все команды включено в единую роль
	
	Возврат ОписаниеРолей;
	
КонецФункции

// Описывает соответствие атомарных ролей просмотра и редактирования одних и тех же данных.
// Содержит только часть таких пар ролей, такую, которая позволяет упростить описание профилей.
//
Функция РолиПросмотраРедактирования()
	
	РолиПросмотраРедактирования = Новый ТаблицаЗначений;
	РолиПросмотраРедактирования.Колонки.Добавить("РольПросмотра",      Новый ОписаниеТипов("Строка"));
	РолиПросмотраРедактирования.Колонки.Добавить("РольРедактирования", Новый ОписаниеТипов("Строка"));
	РолиПросмотраРедактирования.Колонки.Добавить("ОбщиеДанные",        Новый ОписаниеТипов("Булево"));
	
	НоваяСтрока = РолиПросмотраРедактирования.Добавить();
	НоваяСтрока.РольПросмотра      = "ЧтениеПлановОбмена";
	НоваяСтрока.РольРедактирования = "ДобавлениеИзменениеПлановОбмена";
	
	НоваяСтрока = РолиПросмотраРедактирования.Добавить();
	НоваяСтрока.РольПросмотра      = "ЧтениеКурсовВалют";
	НоваяСтрока.РольРедактирования = "ДобавлениеИзменениеКурсовВалют";
	
	НоваяСтрока = РолиПросмотраРедактирования.Добавить();
	НоваяСтрока.РольПросмотра      = "ЧтениеПодключаемогоОборудования";
	НоваяСтрока.РольРедактирования = "ДобавлениеИзменениеПодключаемогоОборудования";
	
	НоваяСтрока = РолиПросмотраРедактирования.Добавить();
	НоваяСтрока.РольПросмотра      = "ЧтениеОбщейБухгалтерскойНСИ";
	НоваяСтрока.РольРедактирования = "ДобавлениеИзменениеОбщейБухгалтерскойНСИ";
	НоваяСтрока.ОбщиеДанные        = Истина;
	
	// Отдельной роли для чтения общих (неразделяемых) данных регламентированной отчетности в БРО нет.
	// Права на чтение этих данных предоставляются одновременно с правами на чтение разделяемых данных.
	НоваяСтрока = РолиПросмотраРедактирования.Добавить();
	НоваяСтрока.РольПросмотра      = "ЧтениеДанныхРегламентированнойОтчетности";
	НоваяСтрока.РольРедактирования = "ДобавлениеИзменениеНеразделяемыхДанныхРегламентированнойОтчетности";
	НоваяСтрока.ОбщиеДанные        = Истина;
	
	Возврат РолиПросмотраРедактирования;
	
КонецФункции

Процедура ВытеснитьРолиИнтегральнымиРолями(ОписанияПрофилей)
	
	ИнтегральныеРоли = ИнтегральныеРолиВсеДанныеБухгалтерии();
	
	// Чтобы упростить описание ролей, атомарные роли включаются в профили там, где это уместно.
	// Вместе с тем, не следует давать одному пользователю атомарную и интегральную роль,
	// предоставляющие права к одному и тому же объекту.
	// Поэтому из профиля, содержащего интегральную роль, исключим "вытесненные" им атомарные.
	
	Для Каждого ОписаниеПрофиля Из ОписанияПрофилей Цикл
		
		Для Каждого ОписаниеИнтегральнойРоли Из ИнтегральныеРоли Цикл
			
			Если ОписаниеПрофиля.Роли.Найти(ОписаниеИнтегральнойРоли.Ключ) = Неопределено Тогда
				Продолжить; // Интегральная роль не назначена
			КонецЕсли;
			
			Для Каждого ИмяВытесненнойРоли Из ОписаниеИнтегральнойРоли.Значение Цикл
				
				ИндексВытесненнойРоли = ОписаниеПрофиля.Роли.Найти(ИмяВытесненнойРоли);
				Если ИндексВытесненнойРоли = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				ОписаниеПрофиля.Роли.Удалить(ИндексВытесненнойРоли);
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ИсключитьИзбыточныеРолиПросмотра(ОписанияПрофилей)
	
	// Иногда при описании профиля удобнее, понятнее предоставить и право просмотра (скажем, в составе общих прав для нескольких профилей)
	// и право редактирования - как дополнительное право конкретного профиля.
	// Однако, с точки зрения исполнения профиля это избыточно.
	// Поэтому избыточные роли просмотра следует избегать там, где это возможно.
	
	РолиПросмотраРедактирования = РолиПросмотраРедактирования();
	
	Для Каждого ОписаниеПрофиля Из ОписанияПрофилей Цикл
		
		Для Каждого ПараРолейПросмотрРедактирование Из РолиПросмотраРедактирования Цикл
			
			РольРедактирования = ОписаниеПрофиля.Роли.Найти(ПараРолейПросмотрРедактирование.РольРедактирования);
			Если РольРедактирования = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			РольПросмотра = ОписаниеПрофиля.Роли.Найти(ПараРолейПросмотрРедактирование.РольПросмотра);
			Если РольПросмотра = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			// Есть одновременно роль просмотра и редактирования.
			// Роль просмотра - избыточная.
			ОписаниеПрофиля.Роли.Удалить(РольПросмотра);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗапретитьРедактированиеОбщихДанных(ОписанияПрофилей)
	
	// Если в информационной базе используются разделители, то только администратор базы может редактировать общие данные.
	// У прикладных пользователей редактирование следует запретить, предоставив права на чтение.
	
	Если Не ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		Возврат;
	КонецЕсли;
	
	РолиПросмотраРедактирования = РолиПросмотраРедактирования();
	
	Для Каждого ОписаниеПрофиля Из ОписанияПрофилей Цикл
		
		Для Каждого ПараРолейПросмотрРедактирование Из РолиПросмотраРедактирования Цикл
			
			Если Не ПараРолейПросмотрРедактирование.ОбщиеДанные Тогда
				Продолжить;
			КонецЕсли;
			
			РольРедактирования = ОписаниеПрофиля.Роли.Найти(ПараРолейПросмотрРедактирование.РольРедактирования);
			Если РольРедактирования = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			// Эту роль следует исключить из профиля, предоставив взамен роль на чтение этих данных.
			ОписаниеПрофиля.Роли.Удалить(РольРедактирования);
			
			РольПросмотра = ОписаниеПрофиля.Роли.Найти(ПараРолейПросмотрРедактирование.РольПросмотра);
			Если РольПросмотра <> Неопределено Тогда
				// Роль просмотра уже есть в профиле, добавлять ее не надо
				Продолжить;
			КонецЕсли;
			
			ОписаниеПрофиля.Роли.Добавить(ПараРолейПросмотрРедактирование.РольПросмотра);
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ИменаОбъектовСОграничениямиПрав()
	
	Результат = Новый Массив;
	
	Для каждого ЭлементМетаданные Из Метаданные.Документы Цикл
		Результат.Добавить("Документ." + ЭлементМетаданные.Имя);
	КонецЦикла;
	Для каждого ЭлементМетаданные Из Метаданные.Справочники Цикл
		Результат.Добавить("Справочник." + ЭлементМетаданные.Имя);
	КонецЦикла;
	Для каждого ЭлементМетаданные Из Метаданные.ЖурналыДокументов Цикл
		Результат.Добавить("ЖурналДокументов." + ЭлементМетаданные.Имя);
	КонецЦикла;
	Для каждого ЭлементМетаданные Из Метаданные.ПланыВидовХарактеристик Цикл
		Результат.Добавить("ПланВидовХарактеристик." + ЭлементМетаданные.Имя);
	КонецЦикла;
	Для каждого ЭлементМетаданные Из Метаданные.РегистрыСведений Цикл
		Результат.Добавить("РегистрСведений." + ЭлементМетаданные.Имя);
	КонецЦикла;
	Для каждого ЭлементМетаданные Из Метаданные.РегистрыНакопления Цикл
		Результат.Добавить("РегистрНакопления." + ЭлементМетаданные.Имя);
	КонецЦикла;
	Для каждого ЭлементМетаданные Из Метаданные.РегистрыБухгалтерии Цикл
		Результат.Добавить("РегистрБухгалтерии." + ЭлементМетаданные.Имя);
	КонецЦикла;
	
	Возврат Результат;

КонецФункции

#КонецОбласти
