Процедура ОпределитьПоддержкуУчетаПоЭлементамЗатрат(УчетПоддерживается) Экспорт
	
КонецПроцедуры

Процедура ЗаполнитьПредопределенныеСчетаРасходов(СчетаРасходов) Экспорт
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыУчета(ПараметрыУчета) Экспорт
	
КонецПроцедуры

Процедура ОпределитьВидСубконтоПоимениПараметра(ВидСубконто, ИмяПараметра) Экспорт
	
КонецПроцедуры

Процедура ОпределитьВидСубконтоЭлементыЗатрат(ВидСубконто) Экспорт
	
КонецПроцедуры

Процедура ПодготовитьОписаниеКоллекцииСумм(ОписаниеСумм, РазрезыУчетаРасходов) Экспорт
	
КонецПроцедуры

Процедура СоздатьСтруктуруСтоимостиЗапасов(МенеджерВременныхТаблиц, Период, Организация, РазрезыУчетаРасходов, ОценитьЗапасы) Экспорт
	
КонецПроцедуры

Процедура СоздатьКлючиЭлементовЗатрат(МенеджерВременныхТаблиц, РазрезыУчетаРасходов, ОценитьЗапасы) Экспорт
	
КонецПроцедуры

Процедура ДополнитьГрафЗатрат(Вершины, ОписаниеСумм, МенеджерВременныхТаблиц, РазрезыУчетаРасходов, ОценитьЗапасы) Экспорт
	
КонецПроцедуры

Процедура УстановитьОсновнойЭлемент(Вершина, ОписаниеСумм) Экспорт
	
КонецПроцедуры

Процедура Исправить(Суммы, ОписаниеСумм) Экспорт
	
КонецПроцедуры

Процедура ЗаполнитьПараметрыФормированияПроводок(ПараметрыПроводок, РазрезыУчетаРасходов, МенеджерВременныхТаблиц, ОписаниеСумм, ОписаниеСуммПроводок) Экспорт
	
КонецПроцедуры

Процедура ДобавитьПроводки(Проводки, СводнаяПроводка, Суммы, ПараметрыФормированияПроводок) Экспорт
	
КонецПроцедуры

Процедура ДополнитьРезультат(Результат, Протокол, ОписаниеСумм, МенеджерВременныхТаблиц, Организация, ОценитьЗапасы) Экспорт
	
КонецПроцедуры

Процедура СформироватьДвиженияСтруктураСтоимостиЗапасов(РезультатРасчета, Движения, Реквизиты) Экспорт
	
КонецПроцедуры

Процедура СформироватьДвиженияСтруктураСтоимостиЗапасовПриВводеНачальныхОстатков(ДанныеДокумента, Движения, Период, Организация, Подразделение) Экспорт
	
КонецПроцедуры