
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	УИДЗамера = ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина);
	
	Если ПараметрыВыполненияКоманды.Окно <> Неопределено Тогда
		ВариантОткрытияОкнаФормы = ПараметрыВыполненияКоманды.Окно;
		Уникальность = Истина;
		Источник = Неопределено;
	Иначе
		ВариантОткрытияОкнаФормы = ПараметрыВыполненияКоманды.Окно;
		Уникальность = ПараметрыВыполненияКоманды.Уникальность;
		Источник = ПараметрыВыполненияКоманды.Источник;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("УИДЗамера", УИДЗамера);
	ОткрытьФорму("ЖурналДокументов.ЖурналОпераций.ФормаСписка",
		ПараметрыФормы,
		Источник,
		Уникальность,
		ВариантОткрытияОкнаФормы);
	
КонецПроцедуры
