////////////////////////////////////////////////////////////////////////////////
// Подсистема "Новости".
// ОбщийМодуль.ОбработкаНовостейПереопределяемыйПовтИсп.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

#Область ПолучениеЗначенийКатегорий

#Область УстаревшиеПроцедурыИФункции

// Устаревший функционал. Перенесено в ОбработкаНовостейПереопределяемый.ПолучитьЗначениеПредопределеннойКатегории.
// Функция возвращает значение категории, если для нее установлено свойство "ЗаполняетсяАвтоматически".
// Переопределение функции имеет смысл только если необходимо возвращать значения, отличные от значений по-умолчанию.
//
// Параметры:
//  Категория           - ПланВидовХарактеристикСсылка.КатегорииНовостей;
//  ПредыдущийРезультат - Произвольный - предыдущее значение, которое можно изменить.
//
// Возвращаемое значение:
//  Произвольное (Строка, список значений).
//
Функция ПолучитьЗначениеПредопределеннойКатегории(Категория, Знач ПредыдущийРезультат) Экспорт

	НовыйРезультат = ПредыдущийРезультат;

	// Если ТипЗнч(Категория) = Тип("ПланВидовХарактеристикСсылка.КатегорииНовостей") Тогда
	//	КатегорияКод = СокрЛП(Категория.Код);
	// ИначеЕсли ТипЗнч(Категория) = Тип("Строка") Тогда
	//	КатегорияКод = СокрЛП(Категория);
	// Иначе
	//	Возврат ПредыдущийРезультат;
	// КонецЕсли;

	// Если ВРег(КатегорияКод) = ВРег("ProductName") Тогда // В плане видов характеристик "КатегорииНовостей" такого элемента нет.
	//	// Определять ИмяКонфигурации английскими буквами!
	//	//Результат = Метаданные.Имя;
	//	НовыйРезультат = "Unknown";

	// ИначеЕсли ВРег(КатегорияКод) = ВРег("TaxReportID") Тогда // Коды подключенных отчетов.
	//	// Определять список подключенных (возможных) отчетов для сдачи в ИФНС, ПФР и т.п.
	//	НовыйРезультат = Новый СписокЗначений;

	// ИначеЕсли ВРег(КатегорияКод) = ВРег("TaxAdministration") Тогда // Номера ИФНС
	//	// Определять список ИФНС (через справочник Организации, или другим способом?)
	//	НовыйРезультат = Новый СписокЗначений;

	// ИначеЕсли ВРег(КатегорияКод) = ВРег("Bank") Тогда // Список банков
	//	// Определять список банков (через справочник РасчетныеСчета или другим способом?)
	//	НовыйРезультат = Новый СписокЗначений;

	// КонецЕсли;

	Возврат НовыйРезультат;

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти

