
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	КлючеваяОперация = "СозданиеФормыСпискаПоступлениеТоваровУслуг";
	ОценкаПроизводительностиКлиент.НачатьЗамерВремени(Истина, КлючеваяОперация);

	Отбор = Новый Структура("ВидОперации", ПредопределенноеЗначение("Перечисление.ВидыОперацийПоступлениеТоваровУслуг.ОсновныеСредства"));
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Отбор", 							Отбор);
	ПараметрыФормы.Вставить("НеИзменятьОтборПоВидуОперации", 	Истина);
	ПараметрыФормы.Вставить("Заголовок", 						НСтр("ru = 'Поступление основных средств'"));
	ОткрытьФорму("Документ.ПоступлениеТоваровУслуг.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, "ФормаСписка_ПоступлениеОсновныхСредств", ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
