#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Режим82 = Константы.ИнтерфейсВерсии82.Получить() ИЛИ Константы.ИнтерфейсВерсии77.Получить();
	
	Если Режим82 И Не ЭтотОбъект.Значение И Справочники.Организации.КоличествоОрганизаций() > 1 Тогда
		СообщениеОбОшибке = 
			НСтр("ru = 'Невозможно отключить учет по организациям. В справочнике организаций присутствует несколько элементов.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СообщениеОбОшибке, , , , Отказ);
		Возврат;
	КонецЕсли;
	
	Константы.НеВестиУчетПоОрганизациям82.Установить(Режим82 И Не ЭтотОбъект.Значение);
	
КонецПроцедуры

#КонецЕсли