#Область ПрограммныйИнтерфейс

// Регистрирует тарифицируемые услуги конфигурации из Структуры.
//
// Параметры:
//  ПоставщикиУслуг - Массив - массив структур, описывающей поставщика услуги.
//
// Пример структуры
//  Обязательные ключи:
//    * "Идентификатор" - идентификатор поставщика услуги (тип Строка(50)),
//    * "Наименование" - наименование поставщика услуги (тип Строка(150)),
//    * "Услуги" - массив услуг, массив структур с обязательными ключами:
//         ** "Идентификатор" - идентификатор услуги  (тип Строка(50))
//         ** "Наименование" - наименование услуги  (тип Строка(150))
//         ** "ТипУслуги" - тип услуги  (тип ПеречислениеСсылка.ТипыУслуг)
//
Процедура ПриФормированииСпискаУслуг(ПоставщикиУслуг) Экспорт
	
	ТарификацияБП.ДополнитьОписаниеТарифицируемыхУслуг(ПоставщикиУслуг);
	
	// ИнтернетПоддержкаПользователей
	ИнтернетПоддержкаПользователей.ПриФормированииСпискаУслуг(ПоставщикиУслуг);
	// Конец ИнтернетПоддержкаПользователей
	
	// БиблиотекаЭлектронныхДокументов
	ЭлектронноеВзаимодействие.ПриФормированииСпискаУслуг(ПоставщикиУслуг);
	// Конец БиблиотекаЭлектронныхДокументо

КонецПроцедуры

#КонецОбласти
