#Область ПрограммныйИнтерфейс

// Оповещает пользователя о том, что его действие заблокировано
// ограничением тарифа и записывает информацию об этом в журнал регистрации.
//
Процедура ОповеститьОбОграниченииТарифа(ИмяОбъекта) Экспорт
	
	ЖурналРегистрацииКлиент.ДобавитьСообщениеДляЖурналаРегистрации(
		СобытиеЖурналаРегистрацииСообщение(),
		,
		Строка(ИмяОбъекта),
		,
		Истина);
	
	ТекстПредупреждения = ТарификацияБПКлиентСервер.ПолучитьТекстПредупреждения();
	ПоказатьПредупреждение(
		,
		ТекстПредупреждения,
		,
		НСтр("ru='Ограничение тарифа'"));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция СобытиеЖурналаРегистрацииСообщение()
	
	КодЯзыка = ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка();
	ШаблонТекста = НСтр("ru='%1.Вызов функции'", КодЯзыка);
	Возврат СтрШаблон(ШаблонТекста, ТарификацияБПКлиентСервер.ГруппаСобытийЖурналаРегистрации());
	
КонецФункции

#КонецОбласти
