#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаОбособленноеПодразделение.Видимость = ПолучитьФункциональнуюОпцию("ВестиУчетПоПодразделениям");
	
	РежимПовторногоВыбораВидаОрганизации = Параметры.РежимПовторногоВыбораВидаОрганизации;
	РежимПовторногоВыбораСистемыНалогообложения = Параметры.РежимПовторногоВыбораСистемыНалогообложения;
	
	РежимПростогоИнтерфейса = Параметры.Свойство("РежимПростогоИнтерфейса");
	
	Если Параметры.Свойство("ВидОрганизации") Тогда
		ВидОрганизации = Параметры.ВидОрганизации;
	КонецЕсли;
	
	ПараметрыУчетнойПолитики = Новый Структура;
	ПараметрыУчетнойПолитики.Вставить("СистемаНалогообложения", Перечисления.СистемыНалогообложения.ПустаяСсылка());
	ПараметрыУчетнойПолитики.Вставить("ОбъектНалогообложенияУСН", Перечисления.ОбъектыНалогообложенияПоУСН.ПустаяСсылка());
	ПараметрыУчетнойПолитики.Вставить("ПлательщикЕНВД", Ложь);
	ПараметрыУчетнойПолитики.Вставить("ПрименяетсяУСНПатент", Ложь);
	
	Если Параметры.Свойство("СистемаНалогообложения") Тогда
		ПараметрыУчетнойПолитики.Вставить("СистемаНалогообложения", Параметры.СистемаНалогообложения);
	КонецЕсли;
	
	Если Параметры.Свойство("ОбъектНалогообложенияУСН") Тогда
		ПараметрыУчетнойПолитики.Вставить("ОбъектНалогообложенияУСН", Параметры.ОбъектНалогообложенияУСН);
	КонецЕсли;
	
	Если Параметры.Свойство("ПлательщикЕНВД") Тогда
		ПараметрыУчетнойПолитики.Вставить("ПлательщикЕНВД", Параметры.ПлательщикЕНВД);
	КонецЕсли;

	Если Параметры.Свойство("ПрименяетсяУСНПатент") Тогда
		ПараметрыУчетнойПолитики.Вставить("ПрименяетсяУСНПатент", Параметры.ПрименяетсяУСНПатент);
	КонецЕсли;
	
	ДатаНормативныхСведений = ТекущаяДатаСеанса();
	
	ФорматнаяСтрока = ФорматнаяСтрокаПредельныхДоходовДляСпецрежима(ДатаНормативныхСведений);
	
	// Ограничение по доходам
	ТекстОграниченияДоходыУСН = СтрШаблон(НСтр("ru='%1 %2'"),
		Формат(КонтрольПраваПримененияСпецрежима.ГраницаДоходовОграничивающаяПравоПримененияУСН(ДатаНормативныхСведений), ФорматнаяСтрока),
		НСтр("ru='млн руб'"));
	ТекстОграниченияДоходыПСН = СтрШаблон(НСтр("ru='%1 %2'"),
		Формат(КонтрольПраваПримененияСпецрежима.ГраницаДоходовОграничивающаяПравоПримененияПСН(), ФорматнаяСтрока),
		НСтр("ru='млн руб'"));
	
	Элементы.НадписьДоходыУСНИП.Заголовок    = ТекстОграниченияДоходыУСН;
	Элементы.НадписьДоходыУСНЮЛ.Заголовок    = ТекстОграниченияДоходыУСН;
	Элементы.НадписьДоходыПатентИП.Заголовок = ТекстОграниченияДоходыПСН;
	
	// Ограничение по стоимости основных средств
	ТекстОграниченияОС = СтрШаблон(НСтр("ru='%1 %2'"),
		Формат(КонтрольПраваПримененияСпецрежима.ГраницаСтоимостиОсновныхСредствОграничивающаяПравоПримененияУСН(ДатаНормативныхСведений),"ЧС=6"),
		НСтр("ru='млн руб'"));
	Элементы.НадписьОсновныеСредстваУСНЮЛ.Заголовок = ТекстОграниченияОС;
	
	// Ограничение по среднесписочной численности работников
	ТекстОграничениеРаботникиУСН = СтрШаблон(НСтр("ru='%1 %2'"),
		КонтрольПраваПримененияСпецрежима.ГраницаСреднесписочнойЧисленностиРаботниковОграничивающаяПравоПримененияУСН(),
		"человек");
	Элементы.НадписьРаботникиУСНИП.Заголовок = ТекстОграничениеРаботникиУСН;
	Элементы.НадписьРаботникиУСНЮЛ.Заголовок = ТекстОграничениеРаботникиУСН;
	
	ТекстОграничениеРаботникиПатент = СтрШаблон(НСтр("ru='%1 %2'"),
		КонтрольПраваПримененияСпецрежима.ГраницаСреднесписочнойЧисленностиРаботниковОграничивающаяПравоПримененияПатент(),
		"человек");
	Элементы.НадписьРаботникиПатентИП.Заголовок = ТекстОграничениеРаботникиПатент;
	
	ТекстОграничениеРаботникиЕНВД = СтрШаблон(НСтр("ru='%1 %2'"),
		КонтрольПраваПримененияСпецрежима.ГраницаСреднесписочнойЧисленностиРаботниковОграничивающаяПравоПримененияЕНВД(),
		"человек");
	Элементы.НадписьРаботникиЕНВДИП.Заголовок = ТекстОграничениеРаботникиЕНВД;
	
	// Ограничения тарифа
	РазрешенУчетРегулярнойДеятельности = ТарификацияБПВызовСервераПовтИсп.РазрешенУчетРегулярнойДеятельности();
	
	Элементы.НадписьПатент.Видимость                       = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьПатентПояснение.Видимость              = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьПатентЕдиныйНалог.Видимость            = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьСтоимостьПатента.Видимость             = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьУпрощенка6СтоимостьПатента.Видимость   = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьУпрощенка15СтоимостьПатента.Видимость  = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьПатентСтоимостьПатента.Видимость       = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьЕНВДСтоимостьПатента.Видимость         = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьОбщаяСистемаСтоимостьПатента.Видимость = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьПатентЕНВД.Видимость                   = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьПатентНДС.Видимость                    = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьПатентНДФЛ.Видимость                   = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьПатентНалогНаИмущество.Видимость       = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьДоходыПатентИП.Видимость               = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьРаботникиПатентИП.Видимость            = РазрешенУчетРегулярнойДеятельности;
	Элементы.СистемаНалогообложенияПатентнаяИП.Видимость   = РазрешенУчетРегулярнойДеятельности;
	
	Элементы.НадписьЕНВД.Видимость                  = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьЕНВДПояснение.Видимость         = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьЕНВДЕдиныйНалог.Видимость       = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьЕНВДСтрока.Видимость            = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьУпрощенка6ЕНВД.Видимость        = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьУпрощенка15ЕНВД.Видимость       = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьПатентЕНВД.Видимость            = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьОбщаяСистемаЕНВД.Видимость      = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьЕНВДЕНВД.Видимость              = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьЕНВДНДС.Видимость               = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьЕНВДНДФЛ.Видимость              = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьЕНВДНалогНаИмущество.Видимость  = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьДоходыЕНВДИП.Видимость          = РазрешенУчетРегулярнойДеятельности;
	Элементы.НадписьРаботникиЕНВДИП.Видимость       = РазрешенУчетРегулярнойДеятельности;
	Элементы.СистемаНалогообложенияЕНВДИП.Видимость = РазрешенУчетРегулярнойДеятельности;
	
	Элементы.ГиперссылкаСравнениеСистемНалогообложенияИП.Ширина = ?(РазрешенУчетРегулярнойДеятельности, 79, 77);
	Элементы.ДекорацияОграничениеИП.Ширина                      = ?(РазрешенУчетРегулярнойДеятельности, 79, 77);
	
	Элементы.НадписьДоходыУСНИП.Ширина    = ?(РазрешенУчетРегулярнойДеятельности, 31, 51);
	Элементы.НадписьРаботникиУСНИП.Ширина = ?(РазрешенУчетРегулярнойДеятельности, 31, 51);
	
	Элементы.НадписьОбщаяСистемаИП.Ширина                         = ?(РазрешенУчетРегулярнойДеятельности, 15, 25);
	Элементы.НадписьУпрощенка15ИП.Ширина                          = ?(РазрешенУчетРегулярнойДеятельности, 15, 25);
	Элементы.НадписьУпрощенка6ИП.Ширина                           = ?(РазрешенУчетРегулярнойДеятельности, 15, 25);
	Элементы.НадписьУпрощенка6ПояснениеИП.Ширина                  = ?(РазрешенУчетРегулярнойДеятельности, 15, 25);
	Элементы.НадписьУпрощенка15ПосянениеИП.Ширина                 = ?(РазрешенУчетРегулярнойДеятельности, 15, 25);
	Элементы.НадписьОбщаяСистемаПояснениеИП.Ширина                = ?(РазрешенУчетРегулярнойДеятельности, 15, 25);
	Элементы.НадписьУпрощенка6ЕдиныйНалогИП.Ширина                = ?(РазрешенУчетРегулярнойДеятельности, 15, 25);
	Элементы.НадписьУпрощенка15ЕдиныйНалогИП.Ширина               = ?(РазрешенУчетРегулярнойДеятельности, 15, 25);
	Элементы.НадписьОбщаяСистемаЕдиныйНалогИП.Ширина              = ?(РазрешенУчетРегулярнойДеятельности, 15, 25);
	Элементы.НадписьУпрощенка6СтоимостьПатента.Ширина             = ?(РазрешенУчетРегулярнойДеятельности, 15, 25);
	Элементы.НадписьУпрощенка15СтоимостьПатента.Ширина            = ?(РазрешенУчетРегулярнойДеятельности, 15, 25);
	Элементы.НадписьОбщаяСистемаСтоимостьПатента.Ширина           = ?(РазрешенУчетРегулярнойДеятельности, 15, 25);
	Элементы.НадписьУпрощенка6НДСИП.Ширина                        = ?(РазрешенУчетРегулярнойДеятельности, 15, 25);
	Элементы.НадписьУпрощенка15НДСИП.Ширина                       = ?(РазрешенУчетРегулярнойДеятельности, 15, 25);
	Элементы.НадписьОбщаяСистемаНДСИП.Ширина                      = ?(РазрешенУчетРегулярнойДеятельности, 15, 25);
	Элементы.НадписьУпрощенка6НДФЛ.Ширина                         = ?(РазрешенУчетРегулярнойДеятельности, 15, 25);
	Элементы.НадписьУпрощенка15НДФЛ.Ширина                        = ?(РазрешенУчетРегулярнойДеятельности, 15, 25);
	Элементы.НадписьОбщаяСистемаНДФЛ.Ширина                       = ?(РазрешенУчетРегулярнойДеятельности, 15, 25);
	Элементы.НадписьУпрощенка6НалогНаИмуществоИП.Ширина           = ?(РазрешенУчетРегулярнойДеятельности, 15, 25);
	Элементы.НадписьУпрощенка15НалогНаИмуществоИП.Ширина          = ?(РазрешенУчетРегулярнойДеятельности, 15, 25);
	Элементы.НадписьОбщаяСистемаНалогНаИмуществоИП.Ширина         = ?(РазрешенУчетРегулярнойДеятельности, 15, 25);
	Элементы.ДекорацияБезОграниченияИП.Ширина                     = ?(РазрешенУчетРегулярнойДеятельности, 15, 25);
	Элементы.СистемаНалогообложенияУСНДоходыИП.Ширина             = ?(РазрешенУчетРегулярнойДеятельности, 15, 25);
	Элементы.СистемаНалогообложенияУСНДоходыМинусРасходыИП.Ширина = ?(РазрешенУчетРегулярнойДеятельности, 15, 25);
	Элементы.СистемаНалогообложенияОбщаяИП.Ширина                 = ?(РазрешенУчетРегулярнойДеятельности, 15, 25);
	
	Элементы.НазадИП.Ширина                                       = ?(РазрешенУчетРегулярнойДеятельности, 13, 15);
	Элементы.НадписьРаботникиИП.Ширина                            = ?(РазрешенУчетРегулярнойДеятельности, 13, 15);
	Элементы.ДекорацияНадписьДоходыИП.Ширина                      = ?(РазрешенУчетРегулярнойДеятельности, 13, 15);
	Элементы.НадписьНалогНаИмуществоИП.Ширина                     = ?(РазрешенУчетРегулярнойДеятельности, 13, 15);
	Элементы.НадписьНДФЛ.Ширина                                   = ?(РазрешенУчетРегулярнойДеятельности, 13, 15);
	Элементы.НадписьНДСИП.Ширина                                  = ?(РазрешенУчетРегулярнойДеятельности, 13, 15);
	Элементы.НадписьСтоимостьПатента.Ширина                       = ?(РазрешенУчетРегулярнойДеятельности, 13, 15);
	Элементы.НадписьЕдиныйНалогУСНИП.Ширина                       = ?(РазрешенУчетРегулярнойДеятельности, 13, 15);
	Элементы.ДекорацияУплачиваетсяИП.Ширина                       = ?(РазрешенУчетРегулярнойДеятельности, 13, 15);
	Элементы.НадписьСистемаНалогообложенияИП.Ширина               = ?(РазрешенУчетРегулярнойДеятельности, 13, 15);

КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ВидОрганизации <> "ОбособленноеПодразделение" Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ГоловнаяОрганизация");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Заголовок = ПолучитьЗаголовокФормы();
	
	Если РежимПовторногоВыбораВидаОрганизации Тогда
		ИнициализироватьФормуВРежимеПовторногоВыбораВидаОрганизации();
	ИначеЕсли РежимПовторногоВыбораСистемыНалогообложения Тогда
		ИнициализироватьФормуВРежимеПовторногоВыбораСистемыНалогообложения();
	ИначеЕсли РежимПростогоИнтерфейса Тогда
		ИнициализироватьФормуВРежимеПростогоИнтерфейса();
	Иначе
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаВидОрганизации;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОткрытиеФормыНовойОрганизации" 
	   И Открыта() Тогда
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыбратьИП(Команда)
	
	ВидОрганизации = "ИндивидуальныйПредприниматель";
	
	Если РежимПовторногоВыбораВидаОрганизации Тогда
		Закрыть(ВидОрганизации);
	КонецЕсли;
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаСистемаНалогообложенияИП;
	
	Заголовок = ПолучитьЗаголовокФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЮЛ(Команда)
	
	ВидОрганизации = "ЮридическоеЛицо";
	
	Если РежимПовторногоВыбораВидаОрганизации Тогда
		Закрыть(ВидОрганизации);
	КонецЕсли;
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаСистемаНалогообложенияЮЛ;
	
	Заголовок = ПолучитьЗаголовокФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОП(Команда)
	
	ВидОрганизации = "ОбособленноеПодразделение";
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаСистемаНалогообложенияОП;
	
	Заголовок = ПолучитьЗаголовокФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СистемаНалогообложенияОбщая(Команда)
	
	СистемаНалогообложения = "Общая";
	
	ОткрытьФормуОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура СистемаНалогообложенияПатентная(Команда)
	
	СистемаНалогообложения = "Патентная";
	
	ОткрытьФормуОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура СистемаНалогообложенияЕНВД(Команда)
	
	СистемаНалогообложения = "ЕНВД";
	
	ОткрытьФормуОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура СистемаНалогообложенияУСНДоходы(Команда)
	
	СистемаНалогообложения = "УпрощеннаяДоходы";
	
	ОткрытьФормуОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура СистемаНалогообложенияУСНДоходыМинусРасходы(Команда)
	
	СистемаНалогообложения = "УпрощеннаяДоходыМинусРасходы";
	
	ОткрытьФормуОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаВидОрганизации;
	
	Заголовок = ПолучитьЗаголовокФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОрганизацию(Команда)
	
	ОткрытьФормуОрганизации();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ГиперссылкаСравнениеСистемНалогообложенияНажатие(Элемент)

	ЮридическоеФизическоеЛицо = ?(ВидОрганизации = "ИндивидуальныйПредприниматель",
		ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо"),
		ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо"));
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВидОрганизации", ЮридическоеФизическоеЛицо);
	
	ОткрытьФорму("Обработка.СравнениеРежимовНалогообложения.Форма", СтруктураПараметров, ЭтаФорма, ВидОрганизации);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ТекущаяСтраницаПоВидуОрганизации(ВидОрганизации, РежимПовторногоВыбораСистемыНалогообложения)
	
	Если ВидОрганизации = "ЮридическоеЛицо" Тогда
		ТекущаяСтраницаФормы = "СтраницаСистемаНалогообложенияЮЛ";
	ИначеЕсли ВидОрганизации = "ИндивидуальныйПредприниматель" Тогда
		ТекущаяСтраницаФормы = "СтраницаСистемаНалогообложенияИП";
	ИначеЕсли ВидОрганизации = "ОбособленноеПодразделение" Тогда
		Если РежимПовторногоВыбораСистемыНалогообложения Тогда
			ВызватьИсключение "Для обособленного подразделения система налогообложения определяется головной организацией.";
		Иначе
			ТекущаяСтраницаФормы = "СтраницаСистемаНалогообложенияОП";
		КонецЕсли;
	Иначе
		ТекущаяСтраницаФормы = "СтраницаВидОрганизации";
	КонецЕсли;
	Возврат ТекущаяСтраницаФормы;
	
КонецФункции

&НаКлиенте
Функция ПолучитьЗаголовокФормы()
	
	Если РежимПовторногоВыбораСистемыНалогообложения Тогда
		
		ЗаголовокФормы = НСтр("ru='Система налогообложения'");
		
	Иначе
	
		ЗаголовокФормы = НСтр("ru = 'Вид организации'");
		
		Если Элементы.СтраницыФормы.ТекущаяСтраница <> Элементы.СтраницаВидОрганизации Тогда
			Если ВидОрганизации = "ЮридическоеЛицо" Тогда
				ЗаголовокФормы = НСтр("ru = 'Юридическое лицо'");
			ИначеЕсли ВидОрганизации = "ИндивидуальныйПредприниматель" Тогда
				ЗаголовокФормы = НСтр("ru = 'Индивидуальный предприниматель'");
			ИначеЕсли ВидОрганизации = "ОбособленноеПодразделение" Тогда
				ЗаголовокФормы = НСтр("ru = 'Обособленное подразделение'");
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ЗаголовокФормы;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьИННГоловнойОрганизации(Организация)
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "ИНН")	
	
КонецФункции

&НаКлиенте
Процедура ОткрытьФормуОрганизации()
	
	Если НЕ ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураУчетнойПолитики = ПолучитьСтруктуруУчетнойПолитики(ВидОрганизации,
		СистемаНалогообложения,
		ПараметрыУчетнойПолитики.ПлательщикЕНВД,
		ПараметрыУчетнойПолитики.ПрименяетсяУСНПатент);
	
	Модифицированность = Ложь;
	
	Если РежимПовторногоВыбораСистемыНалогообложения Тогда
		
		Закрыть(СтруктураУчетнойПолитики);
		
	Иначе
	
		ЗначенияЗаполнения = Новый Структура;
		Если ВидОрганизации = "ИндивидуальныйПредприниматель" Тогда
			ЗначенияЗаполнения.Вставить("ЮридическоеФизическоеЛицо",
				ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ФизическоеЛицо"));
		Иначе
			ЗначенияЗаполнения.Вставить("ЮридическоеФизическоеЛицо",
				ПредопределенноеЗначение("Перечисление.ЮридическоеФизическоеЛицо.ЮридическоеЛицо"));
		КонецЕсли;
		
		ЗначенияЗаполнения.Вставить("ОбособленноеПодразделение", (ВидОрганизации = "ОбособленноеПодразделение"));
		Если ВидОрганизации = "ОбособленноеПодразделение" Тогда
			ЗначенияЗаполнения.Вставить("ГоловнаяОрганизация", ГоловнаяОрганизация);
			ЗначенияЗаполнения.Вставить("ИНН", ПолучитьИННГоловнойОрганизации(ГоловнаяОрганизация));
		КонецЕсли;
		
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("ЗначенияЗаполнения",       ЗначенияЗаполнения);
		СтруктураПараметров.Вставить("СтруктураУчетнойПолитики", СтруктураУчетнойПолитики);
		
		ОткрытьФорму("Справочник.Организации.Форма.ФормаОрганизации", СтруктураПараметров, ВладелецФормы);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ИнициализироватьФормуВРежимеПовторногоВыбораВидаОрганизации()
		
	Элементы.ГруппаОбособленноеПодразделение.Видимость = Ложь;
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.СтраницаВидОрганизации;
	
	КнопкаПоУмолчанию = Новый Соответствие;
	КнопкаПоУмолчанию["ЮридическоеЛицо"]               = "ВыбратьЮЛ";
	КнопкаПоУмолчанию["ИндивидуальныйПредприниматель"] = "ВыбратьИП";
	
	ЭлементФормыПоУмолчанию = Элементы[КнопкаПоУмолчанию[ВидОрганизации]];
	Если ЭлементФормыПоУмолчанию <> Неопределено Тогда
		ЭлементФормыПоУмолчанию.АктивизироватьПоУмолчанию = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьФормуВРежимеПовторногоВыбораСистемыНалогообложения()

	Если ПараметрыУчетнойПолитики.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.Упрощенная") Тогда
		СистемаНалогообложения = ?(ПараметрыУчетнойПолитики.ОбъектНалогообложенияУСН = ПредопределенноеЗначение("Перечисление.ОбъектыНалогообложенияПоУСН.Доходы"),
			"УпрощеннаяДоходы", "УпрощеннаяДоходыМинусРасходы");
	ИначеЕсли ПараметрыУчетнойПолитики.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.ОсобыйПорядок")
		    И ПараметрыУчетнойПолитики.ПрименяетсяУСНПатент Тогда
		СистемаНалогообложения = "Патентная";
	ИначеЕсли ПараметрыУчетнойПолитики.СистемаНалогообложения = ПредопределенноеЗначение("Перечисление.СистемыНалогообложения.ОсобыйПорядок")
		    И ПараметрыУчетнойПолитики.ПлательщикЕНВД Тогда
		СистемаНалогообложения = "ЕНВД";
	Иначе
		СистемаНалогообложения = "Общая";
	КонецЕсли;
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы[ТекущаяСтраницаПоВидуОрганизации(ВидОрганизации, Истина)];
	Элементы.НазадЮЛ.Видимость = Ложь;
	Элементы.НазадИП.Видимость = Ложь;
	
	КнопкаПоУмолчанию = Новый Соответствие;
	КнопкаПоУмолчанию["ЮридическоеЛицо"]                                               = Новый Соответствие;
	КнопкаПоУмолчанию["ЮридическоеЛицо"]["УпрощеннаяДоходы"]                           = "СистемаНалогообложенияУСНДоходыЮЛ";
	КнопкаПоУмолчанию["ЮридическоеЛицо"]["УпрощеннаяДоходыМинусРасходы"]               = "СистемаНалогообложенияУСНДоходыМинусРасходыЮЛ";
	КнопкаПоУмолчанию["ЮридическоеЛицо"]["Общая"]                                      = "СистемаНалогообложенияОбщаяЮЛ";
	КнопкаПоУмолчанию["ИндивидуальныйПредприниматель"]                                 = Новый Соответствие;
	КнопкаПоУмолчанию["ИндивидуальныйПредприниматель"]["УпрощеннаяДоходы"]             = "СистемаНалогообложенияУСНДоходыИП";
	КнопкаПоУмолчанию["ИндивидуальныйПредприниматель"]["УпрощеннаяДоходыМинусРасходы"] = "СистемаНалогообложенияУСНДоходыМинусРасходыИП";
	КнопкаПоУмолчанию["ИндивидуальныйПредприниматель"]["Патентная"]                    = "СистемаНалогообложенияПатентнаяИП";
	КнопкаПоУмолчанию["ИндивидуальныйПредприниматель"]["ЕНВД"]                         = "СистемаНалогообложенияЕНВДИП";
	КнопкаПоУмолчанию["ИндивидуальныйПредприниматель"]["Общая"]                        = "СистемаНалогообложенияОбщаяИП";
	
	ЭлементФормыПоУмолчанию = Элементы[КнопкаПоУмолчанию[ВидОрганизации][СистемаНалогообложения]];
	Если ЭлементФормыПоУмолчанию <> Неопределено Тогда
		ЭлементФормыПоУмолчанию.АктивизироватьПоУмолчанию = Истина;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьФормуВРежимеПростогоИнтерфейса()
	
	ВидОрганизации = "ИндивидуальныйПредприниматель";
	СистемаНалогообложения = "УпрощеннаяДоходы";
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы[ТекущаяСтраницаПоВидуОрганизации(ВидОрганизации, Истина)];
	Элементы.НазадЮЛ.Видимость = Ложь;
	Элементы.НазадИП.Видимость = Ложь;
	
	ЭлементФормыПоУмолчанию = Элементы.СистемаНалогообложенияУСНДоходыИП;
	ЭлементФормыПоУмолчанию.АктивизироватьПоУмолчанию = Истина;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьСтруктуруУчетнойПолитики(ВидОрганизации, СистемаНалогообложения, ПлательщикЕНВД, ПрименяетсяУСНПатент)
	
	Возврат РегистрыСведений.НастройкиСистемыНалогообложения.СтруктураУчетнойПолитики(ВидОрганизации, СистемаНалогообложения, ПлательщикЕНВД, ПрименяетсяУСНПатент);
	
КонецФункции

&НаСервереБезКонтекста
Функция ФорматнаяСтрокаПредельныхДоходовДляСпецрежима(ДатаФормата)

	ФорматнаяСтрока = "ЧДЦ=; ЧС=6";
	
	Если КонтрольПраваПримененияСпецрежима.ИспользуетсяКоэффициентДефляторУСН(ДатаФормата) Тогда
		ФорматнаяСтрока = "ЧДЦ=2; ЧС=6";
	КонецЕсли;
	
	Возврат ФорматнаяСтрока;

КонецФункции

#КонецОбласти
