
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Отбор	= Новый Структура("ДеятельностьНаПатенте", Ложь);
		
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Отбор", Отбор);
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Записи книги доходов и расходов УСН'"));
	
	ОткрытьФорму("Документ.ЗаписьКУДиР.ФормаСписка",
		ПараметрыФормы,
		ПараметрыВыполненияКоманды.Источник,
		"ФормаСписка_ЗаписьКУДиР",
		ПараметрыВыполненияКоманды.Окно);
		
КонецПроцедуры

