////////////////////////////////////////////////////////////////////////////////
// ОбменСБанкамиКлиентПереопределяемый: механизм обмена электронными документами с банками.
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Разбирает переданный текстовый файл выписки.
//
// Параметры:
//  СообщениеОбмена - ДокументСсылка.СообщенияОбменСБанками - электронный документ.
//  ФайлСсылка - Строка - ссылка на временное хранилище.
//  Организация - ОпределяемыйТип.Организация - организация.
//  МассивСчетов - Массив - содержит ссылки на счета организации.
//  НастройкаОбмена - СправочникСсылка.НастройкиОбменСБанками - текущая настройка обмена с банком.
//
Процедура РазобратьФайлВыписки(СообщениеОбмена, ФайлСсылка, Организация, МассивСчетов, НастройкаОбмена) Экспорт
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РежимПоУмолчанию",        "ГруппаЗагрузка");
	ПараметрыОткрытия.Вставить("Организация",             Организация);
	ПараметрыОткрытия.Вставить("ЭлектроннаяВыпискаБанка", СообщениеОбмена);
	ПараметрыОткрытия.Вставить("СоглашениеПрямогоОбменаСБанками", НастройкаОбмена);
	ПараметрыОткрытия.Вставить("АдресФайлаВыписки", ФайлСсылка);
	Если МассивСчетов.Количество()>0 Тогда
		ПараметрыОткрытия.Вставить("БанковскийСчет", МассивСчетов[0]);
	КонецЕсли;
	
	ОткрытьФорму("Обработка.КлиентБанк.Форма", ПараметрыОткрытия);
	
КонецПроцедуры

#КонецОбласти