#Область ПрограммныйИнтерфейс

// Возвращает Истина, если в режиме сервиса разрешена регулярная деятельность.
//
Функция РазрешенУчетРегулярнойДеятельности() Экспорт
	
	Если Не Константы.УчетРегулярнойДеятельностиОпределяетсяТарифом.Получить() Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Не ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		
		Если ОбщегоНазначенияКлиентСервер.РежимОтладки() Тогда
			Возврат Ложь; // Позволяет вести отладку вне режима сервиса
		Иначе
			Возврат Истина; // Использование локальной версии предполагает учет регулярной деятельности
		КонецЕсли;
		
	Иначе
		
		Возврат Тарификация.ЗарегистрированаЛицензияБезлимитнойУслуги("БухгалтерияПредприятия", "РегулярнаяДеятельность");
		
	КонецЕсли;
	
КонецФункции

#КонецОбласти
