////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обмен Зарплата 3 Бухгалтерия 3"
// Серверные процедуры и функции, обслуживающие подписки на события.
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаписатьНастройкиИспользованияОбменаЗарплата3Бухгалтерия3ПриЗаписи(Источник, Отказ) Экспорт
	
	ИмяПланаОбмена = ОбменДаннымиПовтИсп.ПолучитьИмяПланаОбмена(Источник.Ссылка);
	
	Если ИмяПланаОбмена <> "ОбменЗарплата3Бухгалтерия3" Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник.ДополнительныеСвойства.Свойство("Загрузка") Или Источник.ДополнительныеСвойства.Свойство("ПолучениеСообщенияОбмена") Тогда
		Возврат;
	КонецЕсли;
	
	ИсточникСсылка = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник.Ссылка, "НомерОтправленного, НомерПринятого");
	Если ИсточникСсылка.НомерОтправленного <> Источник.НомерОтправленного Или ИсточникСсылка.НомерПринятого <> Источник.НомерПринятого Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ИспользованиеОбменаЗарплата3Бухгалтерия3ПоОрганизациям.СоздатьНаборЗаписей();
	КонстантаМенеджер = Константы.ИспользоватьОбменЗарплата3Бухгалтерия3ПоВсемОрганизациям;
	
	ОбменДаннымиЗарплатаКадры.ОбновитьНастройкиИспользованияОбменаДанными(ИмяПланаОбмена, КонстантаМенеджер, НаборЗаписей);
	
КонецПроцедуры

Процедура ЗаписатьНастройкиИспользованияОбменаЗарплата3Бухгалтерия3ПередУдалением(Источник, Отказ) Экспорт
	
	ИмяПланаОбмена = ОбменДаннымиПовтИсп.ПолучитьИмяПланаОбмена(Источник.Ссылка);
	
	Если ИмяПланаОбмена <> "ОбменЗарплата3Бухгалтерия3" Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ИспользованиеОбменаЗарплата3Бухгалтерия3ПоОрганизациям.СоздатьНаборЗаписей();
	КонстантаМенеджер = Константы.ИспользоватьОбменЗарплата3Бухгалтерия3ПоВсемОрганизациям;
	
	ОбменДаннымиЗарплатаКадры.ОбновитьНастройкиИспользованияОбменаДанными(ИмяПланаОбмена, КонстантаМенеджер, НаборЗаписей, Источник.Ссылка);
	
КонецПроцедуры

#КонецОбласти
