
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.УСН.Видимость            = Параметры.УплачиваетсяУСН;
	Элементы.ЕНВД.Видимость           = Параметры.УплачиваетсяЕНВД;
	Элементы.НалогНаПрибыль.Видимость = Параметры.УплачиваетсяНалогНаПрибыль;
	
	СписокСвойств = "СтавкаНалогаНаПрибыльРегиональная, СтавкаУСНДоходы, СтавкаУСНДоходыРасходы, СтавкаЕНВД, К2";
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, СписокСвойств);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СсылкаНаРегиональныеОсобенностиУСНОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьРегиональныеОсобенностиНаСайтеФНС(НавигационнаяСсылкаФорматированнойСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНаРегиональныеОсобенностиЕНВДОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьРегиональныеОсобенностиНаСайтеФНС(НавигационнаяСсылкаФорматированнойСтроки);
	
КонецПроцедуры

&НаКлиенте
Процедура СсылкаНарегиональныеОсобенностиОСНООбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПоказатьРегиональныеОсобенностиНаСайтеФНС(НавигационнаяСсылкаФорматированнойСтроки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Ключи = "СтавкаНалогаНаПрибыльРегиональная, СтавкаУСНДоходы, СтавкаУСНДоходыРасходы, СтавкаЕНВД, К2";
	Результат = Новый Структура(Ключи);
	ЗаполнитьЗначенияСвойств(Результат, ЭтотОбъект);
	
	Закрыть(Результат);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПоказатьРегиональныеОсобенностиНаСайтеФНС(НавигационнаяСсылкаФорматированнойСтроки)
	
	СсылкаНаСайтФНС = Новый Массив;
	СсылкаНаСайтФНС.Добавить("https://www.nalog.ru/rn");
	Если НавигационнаяСсылкаФорматированнойСтроки = "СсылкаОСНО" Тогда
		СсылкаНаСайтФНС.Добавить(Параметры.КодРегиона);
		СсылкаНаСайтФНС.Добавить("/taxation/taxes/profitul/#title18");
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "СсылкаУСН" Тогда
		СсылкаНаСайтФНС.Добавить(Параметры.КодРегиона);
		СсылкаНаСайтФНС.Добавить("/taxation/taxes/usn/#title11");
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "СсылкаЕНВД" Тогда
		СсылкаНаСайтФНС.Добавить(Параметры.КодРегиона);
		СсылкаНаСайтФНС.Добавить("/taxation/taxes/envd/#title18");
	КонецЕсли;
	
	Если СсылкаНаСайтФНС.Количество() = 1 Тогда
		Возврат;
	КонецЕсли;
	
	ПерейтиПоНавигационнойСсылке(СтрСоединить(СсылкаНаСайтФНС, ""));
	
КонецПроцедуры

#КонецОбласти
