Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
    СтандартнаяОбработка    = Ложь;
     
    Представление = "Спецификация №"+ Данные.НомерСпецификации +" от " + Данные.Дата;
	
КонецПроцедуры
 
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
    СтандартнаяОбработка    = Ложь;
     
    Поля.Добавить("НомерСпецификации");
	Поля.Добавить("Дата");
    	
КонецПроцедуры

Процедура Печать(ТабДок, Ссылка) Экспорт
	Макет = Документы.СпецификацияКДоговору.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СпецификацияКДоговору.Товары.(
	|		Номенклатура,
	|		Количество,
	|		Цена
	|	),
	|	СпецификацияКДоговору.НомерСпецификации,
	|	СпецификацияКДоговору.СрокОтгрузки,
	|	СпецификацияКДоговору.Дата КАК ДатаСпецификации,
	|	СпецификацияКДоговору.ДоговорКонтрагента.Номер КАК НомерДоговора,
	|	СпецификацияКДоговору.ДоговорКонтрагента.Дата КАК ДатаДоговора,
	|	СпецификацияКДоговору.Организация,
	|	СпецификацияКДоговору.Руководитель,
	|	СпецификацияКДоговору.ДолжностьРуководителя,
	|	СпецификацияКДоговору.РуководительКонтрагента,
	|	СпецификацияКДоговору.ДолжностьРуководителяКонтрагента,
	|	СпецификацияКДоговору.ЗаРуководителяКонтрагентаПоПриказу,
	|	СпецификацияКДоговору.ЗаРуководителяПоПриказу,
	|	СпецификацияКДоговору.ПолРуководителяКонтрагента,
	|	СпецификацияКДоговору.Ссылка,
	|	СпецификацияКДоговору.Контрагент
	|ИЗ
	|	Документ.СпецификацияКДоговору КАК СпецификацияКДоговору
	|ГДЕ
	|	СпецификацияКДоговору.Ссылка В(&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
    ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТоварыШапка = Макет.ПолучитьОбласть("ТоварыШапка");
	ОбластьТовары = Макет.ПолучитьОбласть("Товары");
	ОбластьДанные = Макет.ПолучитьОбласть("Данные");
	ТабДок.Очистить();

	Выборка.Следующий(); 
	
	ДатаДоговора = Формат (Выборка.ДатаДоговора, "ДФ='dd.MM.yyyy ""г.""'");
	СрокОтгрузки = Формат (Выборка.СрокОтгрузки, "ДФ='dd.MM.yyyy ""г.""'");
	
	ОбластьШапка.Параметры.Заполнить(Выборка);
	ОбластьШапка.Параметры.ДатаДоговора = ДатаДоговора;
	
	СведенияОбОрганизации    = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Выборка.Организация, Выборка.ДатаСпецификации);
ПредставлениеОрганизации = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "НаименованиеДляПечатныхФорм,");
ОбластьШапка.Параметры.Организация = ПредставлениеОрганизации;
ОбластьШапка.Параметры.ПодписантОрганизация = СклонениеПредставленийОбъектов.ПросклонятьПредставление(Выборка.ДолжностьРуководителя.Наименование, 2,Выборка.Ссылка);
ОбластьШапка.Параметры.ФИОПодписантаОрганизация = СклонениеПредставленийОбъектов.ПросклонятьФИО(Выборка.Руководитель.ФИО, 2, Выборка.Ссылка, Выборка.Руководитель.Пол);
ОбластьШапка.Параметры.ОснованиеПолномочийОрганизация = ? (ЗначениеЗаполнено(Выборка.ЗаРуководителяПоПриказу),
СклонениеПредставленийОбъектов.ПросклонятьПредставление(Выборка.ЗаРуководителяПоПриказу, 2,Выборка.Ссылка), "Устава"); 
//данные контрагента
СведенияОКонтрагенте = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Выборка.Контрагент, Выборка.ДатаСпецификации);
ПредставлениеКонтрагента = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОКонтрагенте, "НаименованиеДляПечатныхФорм,");
ОбластьШапка.Параметры.Контрагент = ПредставлениеКонтрагента;
ОбластьШапка.Параметры.ПодписантКонтрагент = СклонениеПредставленийОбъектов.ПросклонятьПредставление(Выборка.ДолжностьРуководителяКонтрагента, 2,Выборка.Ссылка);
ОбластьШапка.Параметры.ФИОПодписантаКонтрагент = СклонениеПредставленийОбъектов.ПросклонятьФИО(Выборка.РуководительКонтрагента, 2, Выборка.Ссылка, Выборка.ПолРуководителяКонтрагента);
ОбластьШапка.Параметры.ОснованиеПолномочийКонтрагент = ? (ЗначениеЗаполнено(Выборка.ЗаРуководителяКонтрагентаПоПриказу),
СклонениеПредставленийОбъектов.ПросклонятьПредставление(Выборка.ЗаРуководителяКонтрагентаПоПриказу, 2,Выборка.Ссылка), "Устава"); 

	
		
		ТабДок.Вывести(ОбластьШапка);

		ТабДок.Вывести(ОбластьТоварыШапка);
		ВыборкаТовары = Выборка.Товары.Выбрать();
		Пока ВыборкаТовары.Следующий() Цикл
			ОбластьТовары.Параметры.Заполнить(ВыборкаТовары);
			ТабДок.Вывести(ОбластьТовары, ВыборкаТовары.Уровень());
		КонецЦикла;
		
		ОбластьДанные.Параметры.Заполнить(Выборка);
		ОбластьДанные.Параметры.ДатаДоговора = ДатаДоговора;
		ОбластьДанные.Параметры.СрокОтгрузки = СрокОтгрузки;
		ТабДок.Вывести(ОбластьДанные);
		


КонецПроцедуры
