
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		Грузополучатель = ДанныеЗаполнения.Владелец;
		Контрагент = ДанныеЗаполнения.Владелец;
		ДолжностьРуководителя = ДанныеЗаполнения.ДолжностьРуководителя;
		ДолжностьРуководителяКонтрагента = ДанныеЗаполнения.ДолжностьРуководителяКонтрагента;
		ЗаРуководителяКонтрагентаПоПриказу = ДанныеЗаполнения.ЗаРуководителяКонтрагентаПоПриказу;
		ЗаРуководителяПоПриказу = ДанныеЗаполнения.ЗаРуководителяПоПриказу;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Организация = ДанныеЗаполнения.Организация;
		ПолРуководителяКонтрагента = ДанныеЗаполнения.ПолРуководителяКонтрагента;
		Руководитель = ДанныеЗаполнения.Руководитель;
		РуководительКонтрагента = ДанныеЗаполнения.РуководительКонтрагента;
		ДоговорКонтрагента = ДанныеЗаполнения.Ссылка;
		ТипЦен = ДанныеЗаполнения.ТипЦен;
		СуммаВключаетНДС = Истина;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.СпецификацииДоговоров.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.СпецификацииДоговоров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номеклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
РегистрыСведений.НумерацияСпецификацийДоговоров.УстановитьНомерСпецификации (ЭтотОбъект, Отказ);
	
КонецПроцедуры






