Функция ПолучитьСтатусСпецификации(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СтатусыСпецификаций.Статус
		|ИЗ
		|	РегистрСведений.СтатусыСпецификаций КАК СтатусыСпецификаций
		|ГДЕ
		|	СтатусыСпецификаций.СпецификацияКДоговору = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
	Возврат ВыборкаДетальныеЗаписи.Статус;
	
	Иначе
		
	Возврат Перечисления.СтатусыСпецификаций.НеСогласован;
		
	КонецЕсли;

		
КонецФункции // ПолучитьСтатусСпецификации(Ссылка)()

Процедура УстановитьСтатусСпецификации (Статус, Ссылка) Экспорт

	НаборЗаписей = РегистрыСведений.СтатусыСпецификаций.СоздатьНаборЗаписей();
  	НаборЗаписей.Отбор.СпецификацияКДоговору.Установить(Ссылка);
  	НаборЗаписей.Прочитать();
	Если НаборЗаписей.Количество() = 0 Тогда
	Запись = НаборЗаписей.Добавить();
	Запись.СпецификацияКДоговору = Ссылка;
	Запись.Статус = Статус;
	ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
	Запись = НаборЗаписей[0];
	Запись.Статус = Статус;
	КонецЕсли;
	НаборЗаписей.Записать();

  
КонецПроцедуры

Процедура УдалитьЗапись(СпецификацияСсылка, Отказ)

	НаборЗаписей = РегистрыСведений.СтатусыСпецификаций.СоздатьНаборЗаписей();
  	НаборЗаписей.Отбор.СпецификацияКДоговору.Установить(СпецификацияСсылка);
  	НаборЗаписей.Записать();
	

КонецПроцедуры
