#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура СправкиРасчетыОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;

	ВариантыОтчетовКлиент.ПоказатьПанельОтчетов("ПростойИнтерфейс.Отчеты.СправкиРасчеты",, НСтр("ru = 'Справки-расчеты'"));
	
КонецПроцедуры

&НаКлиенте
Процедура РегистрыУчетаМалыхПредприятийОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВариантыОтчетовКлиент.ПоказатьПанельОтчетов("ПростойИнтерфейс.Отчеты.РегистрыБУСубъектовМалогоПредпринимательства",, 
		НСтр("ru = 'Регистры бухгалтерского учета субъектов малого предпринимательства'"));

КонецПроцедуры

#КонецОбласти