
#Область ПрограммныйИнтерфейс

// Функция возвращает значение ставки НДС.
//
// Параметры:
//  СтавкаНДС - ПеречислениеСсылка.СтавкиНДС;
//  ПрименяютсяСтавки4и2 - Булево - Истина если в регионе действуют ставки НДС 4% и 2%.
//
// Возвращаемое значение:
//  Число - значение ставки.
//
Функция ПолучитьСтавкуНДС(СтавкаНДС, ПрименяютсяСтавки4и2 = Ложь) Экспорт
	
	Возврат УчетНДСПереопределяемый.ПолучитьСтавкуНДС(СтавкаНДС, ПрименяютсяСтавки4и2);
	
КонецФункции // ПолучитьСтавкуНДС()

// Функция возвращает курс ставку НДС
//
// Параметры:
//  Валюта - СправочникСсылка.Валюты, валюта, по которой необходимо получить курс
//  ДатаКурса - Дата, календарная дата, на которую необходимо получить курс валюты
//
// Возвращаемое значение:
//	Курс переданной валюты на переданную дату, 1 в случае отсутствия значения.
//
Функция ПолучитьСтавкуНДСдляККТ(СтавкаНДС, ПрименяютсяРасчетныеСтавки = Ложь, ПрименяютсяСтавки4и2 = Ложь) Экспорт

	Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		Возврат Неопределено;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118 И ПрименяютсяРасчетныеСтавки  Тогда 
		Возврат 118;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110 И ПрименяютсяРасчетныеСтавки Тогда 
		Возврат 110;
	Иначе
		Возврат УчетНДСПереопределяемый.ПолучитьСтавкуНДС(СтавкаНДС, ПрименяютсяСтавки4и2);
	КонецЕсли;

КонецФункции // ПолучитьСтавкуНДС()

// Массив счетов учета товаров, по которым требуется учет по ГТД
//
Функция СчетаУчетаДляГТД() Экспорт
	
	СчетаГруппы = Новый Массив;
	СчетаГруппы.Добавить(ПланыСчетов.Хозрасчетный.Товары);
	СчетаГруппы.Добавить(ПланыСчетов.Хозрасчетный.ТоварыНаСкладе);
	
	СчетаУчета = БухгалтерскийУчет.СформироватьМассивСубсчетов(СчетаГруппы);
	
	ИсключаемыеСчета = Новый Массив;
	ИсключаемыеСчета.Добавить(ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ);
	ИсключаемыеСчета.Добавить(ПланыСчетов.Хозрасчетный.ТараПодТоваромИПорожняя);
	ИсключаемыеСчета.Добавить(ПланыСчетов.Хозрасчетный.КорректировкаТоваровПрошлогоПериода);
	
	Возврат Новый ФиксированныйМассив(ОбщегоНазначенияКлиентСервер.СократитьМассив(СчетаУчета, ИсключаемыеСчета));
	
КонецФункции

#КонецОбласти

