
Процедура ДоговорОбработкаПроверкиЗаполненияОбработкаПроверкиЗаполнения(Источник, Отказ, ПроверяемыеРеквизиты) Экспорт
	
ПроверяемыеРеквизиты.Добавить ("СрокДействия");

КонецПроцедуры

Процедура ДокументыРеализацииПриПроведенииОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Движения = Источник.Движения;
	
	Движения.СпецификацииДоговоров.Записывать = Истина;
	
	Если ТипЗнч(Источник) = Тип ("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		
	Для Каждого ТекСтрокаТовары Из Источник.Товары Цикл
		
		Движение = Движения.СпецификацииДоговоров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Источник.Дата;
		Движение.Номеклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Количество = ТекСтрокаТовары.Количество;
		
	КонецЦикла;
	
	КонецЕсли;

	
КонецПроцедуры
