#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// Обработчики выгрузки конвертации 1С:Бухгалтерия предприятия 3.0 --> 1С-КАМИН:Зарплата 5.0 {ccebbe16-848b-11e5-8b86-c86000ef80ff}                                                                  
// 
// Данный модуль содержит экспортные процедуры обработчиков событий конвертации 
// и предназначен для отладки правил обмена. После отладки рекомендуется
// скопировать текст модуля в буфер обмена и импортировать его в базу
// "Конвертация данных".
//
////////////////////////////////////////////////////////////////////////////////
// ИСПОЛЬЗУЕМЫЕ СОКРАЩЕНИЯ ИМЕН ПЕРЕМЕННЫХ (АББРЕВИАТУРЫ)
//
//  ПКО  - правило конвертации объектов
//  ПКС  - правило конвертации свойств объектов
//  ПКГС - правило конвертации группы свойств объектов
//  ПВД  - правило выгрузки данных
//  ПОД  - правило очистки данных

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБРАБОТКИ
// Данный раздел изменять запрещено.

Перем Параметры;
Перем Алгоритмы;
Перем Запросы;
Перем УзелДляОбмена;
Перем ОбщиеПроцедурыФункции;

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОНВЕРТАЦИИ (ГЛОБАЛЬНЫЕ)
// В данном разделе разрешено изменять реализацию процедур.

Процедура Конвертация_ПослеЗагрузкиПравилОбмена() Экспорт

	

КонецПроцедуры

Процедура Конвертация_ПередВыгрузкойДанных(ФайлОбмена, Отказ) Экспорт

	

КонецПроцедуры

Процедура Конвертация_ПередПолучениемИзмененныхОбъектов(Получатель, УзелДляФоновогоОбмена) Экспорт

	

КонецПроцедуры

Процедура Конвертация_ПослеВыгрузкиДанных(ФайлОбмена) Экспорт

	

КонецПроцедуры

Процедура Конвертация_ПередВыгрузкойОбъекта(ФайлОбмена, Отказ, ИмяПКО, Правило, ВходящиеДанные, ИсходящиеДанные, Объект) Экспорт

	

КонецПроцедуры

Процедура Конвертация_ПослеВыгрузкиОбъекта(ФайлОбмена, Объект, ИмяПКО, ВходящиеДанные, ИсходящиеДанные, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура Конвертация_ПередКонвертациейОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены,ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура Конвертация_ПередОтправкойИнформацииОбУдалении(Ссылка, Отказ) Экспорт

	

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОНВЕРТАЦИИ ОБЪЕКТОВ
// В данном разделе разрешено изменять реализацию процедур.

Процедура ПКО_ВидыДеятельности_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_ВидыДеятельности_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ВидыДеятельности_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ВидыДеятельности_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ВидыДокументовФизическихЛиц_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_ВидыДокументовФизическихЛиц_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ВидыДокументовФизическихЛиц_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ВидыДокументовФизическихЛиц_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ВидыКонтактнойИнформации_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_ВидыКонтактнойИнформации_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ВидыКонтактнойИнформации_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ВидыКонтактнойИнформации_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ГражданствоСотрудников_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_ГражданствоСотрудников_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ГражданствоСотрудников_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ГражданствоСотрудников_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ДокументыФизическихЛиц_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_ДокументыФизическихЛиц_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ДокументыФизическихЛиц_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ДокументыФизическихЛиц_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_Должности_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_Должности_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_Должности_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_Должности_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_Организации_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_Организации_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_Организации_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_Организации_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ПолФизическогоЛица_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_ПолФизическогоЛица_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ПолФизическогоЛица_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ПолФизическогоЛица_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_СпособыОтраженияЗарплатыВБухгалтерскомУчете_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_СпособыОтраженияЗарплатыВБухгалтерскомУчете_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_СпособыОтраженияЗарплатыВБухгалтерскомУчете_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_СпособыОтраженияЗарплатыВБухгалтерскомУчете_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_СтраныМира_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_СтраныМира_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_СтраныМира_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_СтраныМира_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ТерриториальныйОрганПФР_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_ТерриториальныйОрганПФР_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ТерриториальныйОрганПФР_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ТерриториальныйОрганПФР_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ТерриториальныйОрганФСС_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_ТерриториальныйОрганФСС_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ТерриториальныйОрганФСС_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ТерриториальныйОрганФСС_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ТипыКонтактнойИнформации_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_ТипыКонтактнойИнформации_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ТипыКонтактнойИнформации_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ТипыКонтактнойИнформации_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ФизическиеЛица_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_ФизическиеЛица_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ФизическиеЛица_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ФизическиеЛица_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ФИОСотрудников_ПередВыгрузкойОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Отказ, КлючВыгружаемыхДанных, ЗапоминатьВыгруженные,
	НеЗамещатьОбъектПриЗагрузке, ВсеОбъектыВыгружены, ТолькоПолучитьУзелСсылки,
	Приемник, РежимЗаписи, РежимПроведения, НеСоздаватьЕслиНеНайден) Экспорт

	

КонецПроцедуры

Процедура ПКО_ФИОСотрудников_ПриВыгрузкеОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, СтандартнаяОбработка,
	Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ФИОСотрудников_ПослеВыгрузкиОбъекта(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, КлючВыгружаемыхДанных, Отказ, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПКО_ФИОСотрудников_ПослеВыгрузкиОбъектаВФайлОбмена(ФайлОбмена, Источник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО, ПКО,
	ВыгруженныеОбъекты, Приемник, УзелСсылки) Экспорт

	

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОНВЕРТАЦИИ СВОЙСТВ ОБЪЕКТОВ
// В данном разделе разрешено изменять реализацию процедур.

Процедура ПКС_ВидыДеятельности_Наименование_ПередВыгрузкойСвойства_2_16(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = Лев(Источник, 100);

КонецПроцедуры

Процедура ПКС_ВидыДеятельности_Наименование_ПриВыгрузкеСвойства_2_16(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыДеятельности_Наименование_ПослеВыгрузкиСвойства_2_16(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыДокументовФизическихЛиц_Наименование_ПередВыгрузкойСвойства_1_27(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыДокументовФизическихЛиц_Наименование_ПриВыгрузкеСвойства_1_27(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыДокументовФизическихЛиц_Наименование_ПослеВыгрузкиСвойства_1_27(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыДокументовФизическихЛиц_ПометкаУдаления_ПередВыгрузкойСвойства_2_27(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыДокументовФизическихЛиц_ПометкаУдаления_ПриВыгрузкеСвойства_2_27(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыДокументовФизическихЛиц_ПометкаУдаления_ПослеВыгрузкиСвойства_2_27(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыДокументовФизическихЛиц_КодПФР_ПередВыгрузкойСвойства_3_27(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыДокументовФизическихЛиц_КодПФР_ПриВыгрузкеСвойства_3_27(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыДокументовФизическихЛиц_КодПФР_ПослеВыгрузкиСвойства_3_27(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыДокументовФизическихЛиц_КодМВД_ПередВыгрузкойСвойства_4_27(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыДокументовФизическихЛиц_КодМВД_ПриВыгрузкеСвойства_4_27(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыДокументовФизическихЛиц_КодМВД_ПослеВыгрузкиСвойства_4_27(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыКонтактнойИнформации_Наименование_ПередВыгрузкойСвойства_1_24(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Если Источник.ссылка = Справочники.ВидыКонтактнойИнформации.АдресДляИнформированияФизическиеЛица Тогда
		Значение = "Адрес для информирования ПФ";
	ИначеЕсли Источник.ссылка = Справочники.ВидыКонтактнойИнформации.АдресЗаПределамиРФФизическиеЛица Тогда
		Значение = "Адрес в стране проживания (вне РФ)";
	ИначеЕсли Источник.ссылка = Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента Тогда
		Значение = "Адрес";
	ИначеЕсли Источник.ссылка = Справочники.ВидыКонтактнойИнформации.АдресМестаПроживанияФизическиеЛица Тогда
		Значение = "Адрес места жительства";
	ИначеЕсли Источник.ссылка = Справочники.ВидыКонтактнойИнформации.АдресПоПропискеФизическиеЛица Тогда
		Значение = "Адрес регистрации";
	ИначеЕсли Источник.ссылка = Справочники.ВидыКонтактнойИнформации.СправочникФизическиеЛица Тогда
		Значение = "Контактная информация справочника ""Сотрудники""";
	КонецЕсли;

КонецПроцедуры

Процедура ПКС_ВидыКонтактнойИнформации_Наименование_ПриВыгрузкеСвойства_1_24(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыКонтактнойИнформации_Наименование_ПослеВыгрузкиСвойства_1_24(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыКонтактнойИнформации_Родитель_ПередВыгрузкойСвойства_2_24(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыКонтактнойИнформации_Родитель_ПриВыгрузкеСвойства_2_24(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыКонтактнойИнформации_Родитель_ПослеВыгрузкиСвойства_2_24(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыКонтактнойИнформации_ЭтоГруппа_ПередВыгрузкойСвойства_3_24(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыКонтактнойИнформации_ЭтоГруппа_ПриВыгрузкеСвойства_3_24(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыКонтактнойИнформации_ЭтоГруппа_ПослеВыгрузкиСвойства_3_24(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыКонтактнойИнформации_АдресТолькоРоссийский_ПередВыгрузкойСвойства_4_24(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыКонтактнойИнформации_АдресТолькоРоссийский_ПриВыгрузкеСвойства_4_24(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыКонтактнойИнформации_АдресТолькоРоссийский_ПослеВыгрузкиСвойства_4_24(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыКонтактнойИнформации_МожноИзменятьСпособРедактирования_ПередВыгрузкойСвойства_5_24(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыКонтактнойИнформации_МожноИзменятьСпособРедактирования_ПриВыгрузкеСвойства_5_24(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыКонтактнойИнформации_МожноИзменятьСпособРедактирования_ПослеВыгрузкиСвойства_5_24(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыКонтактнойИнформации_ПометкаУдаления_ПередВыгрузкойСвойства_6_24(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыКонтактнойИнформации_ПометкаУдаления_ПриВыгрузкеСвойства_6_24(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыКонтактнойИнформации_ПометкаУдаления_ПослеВыгрузкиСвойства_6_24(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыКонтактнойИнформации_РедактированиеТолькоВДиалоге_ПередВыгрузкойСвойства_7_24(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыКонтактнойИнформации_РедактированиеТолькоВДиалоге_ПриВыгрузкеСвойства_7_24(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыКонтактнойИнформации_РедактированиеТолькоВДиалоге_ПослеВыгрузкиСвойства_7_24(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыКонтактнойИнформации_РеквизитДопУпорядочивания_ПередВыгрузкойСвойства_8_24(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыКонтактнойИнформации_РеквизитДопУпорядочивания_ПриВыгрузкеСвойства_8_24(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыКонтактнойИнформации_РеквизитДопУпорядочивания_ПослеВыгрузкиСвойства_8_24(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыКонтактнойИнформации_Тип_ПередВыгрузкойСвойства_9_24(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыКонтактнойИнформации_Тип_ПриВыгрузкеСвойства_9_24(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ВидыКонтактнойИнформации_Тип_ПослеВыгрузкиСвойства_9_24(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ГражданствоСотрудников_ФизическоеЛицо_ПередВыгрузкойСвойства_1_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ГражданствоСотрудников_ФизическоеЛицо_ПриВыгрузкеСвойства_1_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ГражданствоСотрудников_ФизическоеЛицо_ПослеВыгрузкиСвойства_1_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ГражданствоСотрудников_Страна_ПередВыгрузкойСвойства_2_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ГражданствоСотрудников_Страна_ПриВыгрузкеСвойства_2_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ГражданствоСотрудников_Страна_ПослеВыгрузкиСвойства_2_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ГражданствоСотрудников_Активность_ПередВыгрузкойСвойства_3_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ГражданствоСотрудников_Активность_ПриВыгрузкеСвойства_3_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ГражданствоСотрудников_Активность_ПослеВыгрузкиСвойства_3_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ГражданствоСотрудников_Период_ПередВыгрузкойСвойства_4_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ГражданствоСотрудников_Период_ПриВыгрузкеСвойства_4_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ГражданствоСотрудников_Период_ПослеВыгрузкиСвойства_4_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДокументыФизическихЛиц_Физлицо_ПередВыгрузкойСвойства_3_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДокументыФизическихЛиц_Физлицо_ПриВыгрузкеСвойства_3_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДокументыФизическихЛиц_Физлицо_ПослеВыгрузкиСвойства_3_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДокументыФизическихЛиц_ВидДокумента_ПередВыгрузкойСвойства_4_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДокументыФизическихЛиц_ВидДокумента_ПриВыгрузкеСвойства_4_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДокументыФизическихЛиц_ВидДокумента_ПослеВыгрузкиСвойства_4_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДокументыФизическихЛиц_ДатаВыдачи_ПередВыгрузкойСвойства_5_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДокументыФизическихЛиц_ДатаВыдачи_ПриВыгрузкеСвойства_5_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДокументыФизическихЛиц_ДатаВыдачи_ПослеВыгрузкиСвойства_5_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДокументыФизическихЛиц_КемВыдан_ПередВыгрузкойСвойства_6_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДокументыФизическихЛиц_КемВыдан_ПриВыгрузкеСвойства_6_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДокументыФизическихЛиц_КемВыдан_ПослеВыгрузкиСвойства_6_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДокументыФизическихЛиц_КодПодразделения_ПередВыгрузкойСвойства_7_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДокументыФизическихЛиц_КодПодразделения_ПриВыгрузкеСвойства_7_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДокументыФизическихЛиц_КодПодразделения_ПослеВыгрузкиСвойства_7_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДокументыФизическихЛиц_Номер_ПередВыгрузкойСвойства_8_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДокументыФизическихЛиц_Номер_ПриВыгрузкеСвойства_8_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДокументыФизическихЛиц_Номер_ПослеВыгрузкиСвойства_8_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДокументыФизическихЛиц_Представление_ПередВыгрузкойСвойства_9_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДокументыФизическихЛиц_Представление_ПриВыгрузкеСвойства_9_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДокументыФизическихЛиц_Представление_ПослеВыгрузкиСвойства_9_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДокументыФизическихЛиц_Серия_ПередВыгрузкойСвойства_10_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДокументыФизическихЛиц_Серия_ПриВыгрузкеСвойства_10_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ДокументыФизическихЛиц_Серия_ПослеВыгрузкиСвойства_10_22(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Должности_Наименование_ПередВыгрузкойСвойства_2_9(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Должности_Наименование_ПриВыгрузкеСвойства_2_9(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Должности_Наименование_ПослеВыгрузкиСвойства_2_9(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Должности_ПометкаУдаления_ПередВыгрузкойСвойства_3_9(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Должности_ПометкаУдаления_ПриВыгрузкеСвойства_3_9(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Должности_ПометкаУдаления_ПослеВыгрузкиСвойства_3_9(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ДополнительныйКодФСС_ПередВыгрузкойСвойства_1_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ДополнительныйКодФСС_ПриВыгрузкеСвойства_1_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ДополнительныйКодФСС_ПослеВыгрузкиСвойства_1_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ИНН_ПередВыгрузкойСвойства_2_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ИНН_ПриВыгрузкеСвойства_2_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ИНН_ПослеВыгрузкиСвойства_2_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КПП_ПередВыгрузкойСвойства_4_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КПП_ПриВыгрузкеСвойства_4_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КПП_ПослеВыгрузкиСвойства_4_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_Наименование_ПередВыгрузкойСвойства_5_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_Наименование_ПриВыгрузкеСвойства_5_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_Наименование_ПослеВыгрузкиСвойства_5_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ОГРН_ПередВыгрузкойСвойства_6_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ОГРН_ПриВыгрузкеСвойства_6_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ОГРН_ПослеВыгрузкиСвойства_6_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ПометкаУдаления_ПередВыгрузкойСвойства_7_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ПометкаУдаления_ПриВыгрузкеСвойства_7_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ПометкаУдаления_ПослеВыгрузкиСвойства_7_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_Префикс_ПередВыгрузкойСвойства_8_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_Префикс_ПриВыгрузкеСвойства_8_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_Префикс_ПослеВыгрузкиСвойства_8_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_РайонныйКоэффициент_ПередВыгрузкойСвойства_9_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_РайонныйКоэффициент_ПриВыгрузкеСвойства_9_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_РайонныйКоэффициент_ПослеВыгрузкиСвойства_9_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_АдресЭП_ПередВыгрузкойСвойства_11_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_АдресЭП_ПриВыгрузкеСвойства_11_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_АдресЭП_ПослеВыгрузкиСвойства_11_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_Вид_ПередВыгрузкойСвойства_12_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_Вид_ПриВыгрузкеСвойства_12_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_Вид_ПослеВыгрузкиСвойства_12_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_Город_ПередВыгрузкойСвойства_13_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_Город_ПриВыгрузкеСвойства_13_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_Город_ПослеВыгрузкиСвойства_13_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_ДоменноеИмяСервера_ПередВыгрузкойСвойства_14_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_ДоменноеИмяСервера_ПриВыгрузкеСвойства_14_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_ДоменноеИмяСервера_ПослеВыгрузкиСвойства_14_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_ЗначенияПолей_ПередВыгрузкойСвойства_15_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_ЗначенияПолей_ПриВыгрузкеСвойства_15_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	Значение = УправлениеКонтактнойИнформацией.ПредыдущийФорматКонтактнойИнформацииXML(Значение, Истина);

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_ЗначенияПолей_ПослеВыгрузкиСвойства_15_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_НомерТелефона_ПередВыгрузкойСвойства_16_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_НомерТелефона_ПриВыгрузкеСвойства_16_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_НомерТелефона_ПослеВыгрузкиСвойства_16_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_НомерТелефонаБезКодов_ПередВыгрузкойСвойства_17_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_НомерТелефонаБезКодов_ПриВыгрузкеСвойства_17_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_НомерТелефонаБезКодов_ПослеВыгрузкиСвойства_17_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_Представление_ПередВыгрузкойСвойства_18_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_Представление_ПриВыгрузкеСвойства_18_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_Представление_ПослеВыгрузкиСвойства_18_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_Регион_ПередВыгрузкойСвойства_19_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_Регион_ПриВыгрузкеСвойства_19_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_Регион_ПослеВыгрузкиСвойства_19_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_Страна_ПередВыгрузкойСвойства_20_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_Страна_ПриВыгрузкеСвойства_20_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_Страна_ПослеВыгрузкиСвойства_20_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_Тип_ПередВыгрузкойСвойства_21_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_Тип_ПриВыгрузкеСвойства_21_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КонтактнаяИнформация_Тип_ПослеВыгрузкиСвойства_21_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодОрганаПФР_ПередВыгрузкойСвойства_22_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодОрганаПФР_ПриВыгрузкеСвойства_22_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодОрганаПФР_ПослеВыгрузкиСвойства_22_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_РегистрационныйНомерТФОМС_ПередВыгрузкойСвойства_23_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_РегистрационныйНомерТФОМС_ПриВыгрузкеСвойства_23_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_РегистрационныйНомерТФОМС_ПослеВыгрузкиСвойства_23_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_РегистрационныйНомерФСС_ПередВыгрузкойСвойства_24_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_РегистрационныйНомерФСС_ПриВыгрузкеСвойства_24_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_РегистрационныйНомерФСС_ПослеВыгрузкиСвойства_24_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодНалоговогоОргана_ПередВыгрузкойСвойства_25_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодНалоговогоОргана_ПриВыгрузкеСвойства_25_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодНалоговогоОргана_ПослеВыгрузкиСвойства_25_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодОКОНХ_ПередВыгрузкойСвойства_27_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодОКОНХ_ПриВыгрузкеСвойства_27_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодОКОНХ_ПослеВыгрузкиСвойства_27_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодОКОПФ_ПередВыгрузкойСвойства_28_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодОКОПФ_ПриВыгрузкеСвойства_28_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодОКОПФ_ПослеВыгрузкиСвойства_28_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодОКФС_ПередВыгрузкойСвойства_29_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодОКФС_ПриВыгрузкеСвойства_29_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодОКФС_ПослеВыгрузкиСвойства_29_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодПоОКПО_ПередВыгрузкойСвойства_30_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодПоОКПО_ПриВыгрузкеСвойства_30_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодПоОКПО_ПослеВыгрузкиСвойства_30_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодОКВЭД_ПередВыгрузкойСвойства_31_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодОКВЭД_ПриВыгрузкеСвойства_31_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодОКВЭД_ПослеВыгрузкиСвойства_31_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ЮЛ_ПередВыгрузкойСвойства_32_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = Источник.ЮридическоеФизическоеЛицо = Перечисления.ЮридическоеФизическоеЛицо.ЮридическоеЛицо;

КонецПроцедуры

Процедура ПКС_Организации_ЮЛ_ПриВыгрузкеСвойства_32_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ЮЛ_ПослеВыгрузкиСвойства_32_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодНалоговогоОрганаПолучателя_ПередВыгрузкойСвойства_33_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодНалоговогоОрганаПолучателя_ПриВыгрузкеСвойства_33_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодНалоговогоОрганаПолучателя_ПослеВыгрузкиСвойства_33_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодОрганаФСГС_ПередВыгрузкойСвойства_34_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодОрганаФСГС_ПриВыгрузкеСвойства_34_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодОрганаФСГС_ПослеВыгрузкиСвойства_34_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеНалоговогоОргана_ПередВыгрузкойСвойства_35_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеНалоговогоОргана_ПриВыгрузкеСвойства_35_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеНалоговогоОргана_ПослеВыгрузкиСвойства_35_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеОКФС_ПередВыгрузкойСвойства_36_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеОКФС_ПриВыгрузкеСвойства_36_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеОКФС_ПослеВыгрузкиСвойства_36_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеПолное_ПередВыгрузкойСвойства_37_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеПолное_ПриВыгрузкеСвойства_37_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеПолное_ПослеВыгрузкиСвойства_37_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеСокращенное_ПередВыгрузкойСвойства_38_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеСокращенное_ПриВыгрузкеСвойства_38_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеСокращенное_ПослеВыгрузкиСвойства_38_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеТерриториальногоОрганаПФР_ПередВыгрузкойСвойства_39_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеТерриториальногоОрганаПФР_ПриВыгрузкеСвойства_39_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеТерриториальногоОрганаПФР_ПослеВыгрузкиСвойства_39_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеТерриториальногоОрганаФСС_ПередВыгрузкойСвойства_40_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеТерриториальногоОрганаФСС_ПриВыгрузкеСвойства_40_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеТерриториальногоОрганаФСС_ПослеВыгрузкиСвойства_40_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_РегистрационныйНомерПФР_ПередВыгрузкойСвойства_41_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_РегистрационныйНомерПФР_ПриВыгрузкеСвойства_41_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_РегистрационныйНомерПФР_ПослеВыгрузкиСвойства_41_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодПодчиненностиФСС_ПередВыгрузкойСвойства_42_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодПодчиненностиФСС_ПриВыгрузкеСвойства_42_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодПодчиненностиФСС_ПослеВыгрузкиСвойства_42_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеОКВЭД_ПередВыгрузкойСвойства_43_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеОКВЭД_ПриВыгрузкеСвойства_43_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеОКВЭД_ПослеВыгрузкиСвойства_43_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеОКОПФ_ПередВыгрузкойСвойства_44_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеОКОПФ_ПриВыгрузкеСвойства_44_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_НаименованиеОКОПФ_ПослеВыгрузкиСвойства_44_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ГоловнаяОрганизация_ПередВыгрузкойСвойства_45_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ГоловнаяОрганизация_ПриВыгрузкеСвойства_45_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ГоловнаяОрганизация_ПослеВыгрузкиСвойства_45_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ОбособленноеПодразделение_ПередВыгрузкойСвойства_46_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ОбособленноеПодразделение_ПриВыгрузкеСвойства_46_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ОбособленноеПодразделение_ПослеВыгрузкиСвойства_46_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ПрименятьРайонныйКоэффициент_ПередВыгрузкойСвойства_48_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ПрименятьРайонныйКоэффициент_ПриВыгрузкеСвойства_48_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ПрименятьРайонныйКоэффициент_ПослеВыгрузкиСвойства_48_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ПрименятьСевернуюНадбавку_ПередВыгрузкойСвойства_49_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ПрименятьСевернуюНадбавку_ПриВыгрузкеСвойства_49_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_ПрименятьСевернуюНадбавку_ПослеВыгрузкиСвойства_49_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодОКВЭД2_ПередВыгрузкойСвойства_50_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодОКВЭД2_ПриВыгрузкеСвойства_50_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_Организации_КодОКВЭД2_ПослеВыгрузкиСвойства_50_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_СпособыОтраженияЗарплатыВБухгалтерскомУчете_Наименование_ПередВыгрузкойСвойства_2_43(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_СпособыОтраженияЗарплатыВБухгалтерскомУчете_Наименование_ПриВыгрузкеСвойства_2_43(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_СпособыОтраженияЗарплатыВБухгалтерскомУчете_Наименование_ПослеВыгрузкиСвойства_2_43(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_СпособыОтраженияЗарплатыВБухгалтерскомУчете_ПометкаУдаления_ПередВыгрузкойСвойства_3_43(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_СпособыОтраженияЗарплатыВБухгалтерскомУчете_ПометкаУдаления_ПриВыгрузкеСвойства_3_43(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_СпособыОтраженияЗарплатыВБухгалтерскомУчете_ПометкаУдаления_ПослеВыгрузкиСвойства_3_43(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_СтраныМира_Код_ПередВыгрузкойСвойства_1_10(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_СтраныМира_Код_ПриВыгрузкеСвойства_1_10(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_СтраныМира_Код_ПослеВыгрузкиСвойства_1_10(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_СтраныМира_КодАльфа2_ПередВыгрузкойСвойства_2_10(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_СтраныМира_КодАльфа2_ПриВыгрузкеСвойства_2_10(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_СтраныМира_КодАльфа2_ПослеВыгрузкиСвойства_2_10(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_СтраныМира_НаименованиеПолное_ПередВыгрузкойСвойства_3_10(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_СтраныМира_НаименованиеПолное_ПриВыгрузкеСвойства_3_10(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_СтраныМира_НаименованиеПолное_ПослеВыгрузкиСвойства_3_10(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_СтраныМира_Наименование_ПередВыгрузкойСвойства_4_10(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_СтраныМира_Наименование_ПриВыгрузкеСвойства_4_10(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_СтраныМира_Наименование_ПослеВыгрузкиСвойства_4_10(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_СтраныМира_ПометкаУдаления_ПередВыгрузкойСвойства_5_10(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_СтраныМира_ПометкаУдаления_ПриВыгрузкеСвойства_5_10(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_СтраныМира_ПометкаУдаления_ПослеВыгрузкиСвойства_5_10(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_СтраныМира_КодАльфа3_ПередВыгрузкойСвойства_6_10(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_СтраныМира_КодАльфа3_ПриВыгрузкеСвойства_6_10(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_СтраныМира_КодАльфа3_ПослеВыгрузкиСвойства_6_10(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ТерриториальныйОрганПФР_Наименование_ПередВыгрузкойСвойства_1_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = Лев(Источник, 150);

КонецПроцедуры

Процедура ПКС_ТерриториальныйОрганПФР_Наименование_ПриВыгрузкеСвойства_1_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ТерриториальныйОрганПФР_Наименование_ПослеВыгрузкиСвойства_1_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ТерриториальныйОрганФСС_Наименование_ПередВыгрузкойСвойства_1_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Значение = Источник;

КонецПроцедуры

Процедура ПКС_ТерриториальныйОрганФСС_Наименование_ПриВыгрузкеСвойства_1_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ТерриториальныйОрганФСС_Наименование_ПослеВыгрузкиСвойства_1_23(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_ДатаРождения_ПередВыгрузкойСвойства_1_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_ДатаРождения_ПриВыгрузкеСвойства_1_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_ДатаРождения_ПослеВыгрузкиСвойства_1_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_ИНН_ПередВыгрузкойСвойства_2_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_ИНН_ПриВыгрузкеСвойства_2_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_ИНН_ПослеВыгрузкиСвойства_2_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_Наименование_ПередВыгрузкойСвойства_4_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	СрезФИО = РегистрыСведений.ФИОФизическихЛиц.СрезПоследних(ТекущаяДатаСеанса(),Новый Структура("ФизическоеЛицо",Источник.Ссылка));
	Если СрезФИО.Количество() > 0 Тогда
		Значение = СокрЛП(СрезФИО[0].Фамилия) + " "
			+ ВРег(Лев(СокрЛП(СрезФИО[0].Имя),1)) + "."
			+ ВРег(Лев(СокрЛП(СрезФИО[0].Отчество),1)) + ".";
	КонецЕсли;

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_Наименование_ПриВыгрузкеСвойства_4_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_Наименование_ПослеВыгрузкиСвойства_4_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_Пол_ПередВыгрузкойСвойства_5_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_Пол_ПриВыгрузкеСвойства_5_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_Пол_ПослеВыгрузкиСвойства_5_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_ПометкаУдаления_ПередВыгрузкойСвойства_6_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_ПометкаУдаления_ПриВыгрузкеСвойства_6_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_ПометкаУдаления_ПослеВыгрузкиСвойства_6_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_АдресЭП_ПередВыгрузкойСвойства_10_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_АдресЭП_ПриВыгрузкеСвойства_10_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_АдресЭП_ПослеВыгрузкиСвойства_10_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_Вид_ПередВыгрузкойСвойства_11_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_Вид_ПриВыгрузкеСвойства_11_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_Вид_ПослеВыгрузкиСвойства_11_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_Город_ПередВыгрузкойСвойства_12_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_Город_ПриВыгрузкеСвойства_12_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_Город_ПослеВыгрузкиСвойства_12_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_ДоменноеИмяСервера_ПередВыгрузкойСвойства_13_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_ДоменноеИмяСервера_ПриВыгрузкеСвойства_13_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_ДоменноеИмяСервера_ПослеВыгрузкиСвойства_13_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_ЗначенияПолей_ПередВыгрузкойСвойства_14_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_ЗначенияПолей_ПриВыгрузкеСвойства_14_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	Значение = УправлениеКонтактнойИнформацией.ПредыдущийФорматКонтактнойИнформацииXML(Значение);

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_ЗначенияПолей_ПослеВыгрузкиСвойства_14_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_НомерТелефона_ПередВыгрузкойСвойства_15_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_НомерТелефона_ПриВыгрузкеСвойства_15_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_НомерТелефона_ПослеВыгрузкиСвойства_15_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_НомерТелефонаБезКодов_ПередВыгрузкойСвойства_16_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_НомерТелефонаБезКодов_ПриВыгрузкеСвойства_16_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_НомерТелефонаБезКодов_ПослеВыгрузкиСвойства_16_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_Представление_ПередВыгрузкойСвойства_17_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_Представление_ПриВыгрузкеСвойства_17_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_Представление_ПослеВыгрузкиСвойства_17_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_Регион_ПередВыгрузкойСвойства_18_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_Регион_ПриВыгрузкеСвойства_18_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_Регион_ПослеВыгрузкиСвойства_18_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_Страна_ПередВыгрузкойСвойства_19_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_Страна_ПриВыгрузкеСвойства_19_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_Страна_ПослеВыгрузкиСвойства_19_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_Тип_ПередВыгрузкойСвойства_20_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_Тип_ПриВыгрузкеСвойства_20_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_КонтактнаяИнформация_Тип_ПослеВыгрузкиСвойства_20_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_СтраховойНомерПФР_ПередВыгрузкойСвойства_22_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_СтраховойНомерПФР_ПриВыгрузкеСвойства_22_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_СтраховойНомерПФР_ПослеВыгрузкиСвойства_22_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_Документ_ПередВыгрузкойСвойства_23_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	Отказ = Не ЗначениеЗаполнено(ВходящиеДанные.Документ.ВидДокумента);

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_Документ_ПриВыгрузкеСвойства_23_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФизическиеЛица_Документ_ПослеВыгрузкиСвойства_23_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФИОСотрудников_Активность_ПередВыгрузкойСвойства_1_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФИОСотрудников_Активность_ПриВыгрузкеСвойства_1_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФИОСотрудников_Активность_ПослеВыгрузкиСвойства_1_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФИОСотрудников_Имя_ПередВыгрузкойСвойства_2_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФИОСотрудников_Имя_ПриВыгрузкеСвойства_2_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФИОСотрудников_Имя_ПослеВыгрузкиСвойства_2_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФИОСотрудников_Отчество_ПередВыгрузкойСвойства_3_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФИОСотрудников_Отчество_ПриВыгрузкеСвойства_3_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФИОСотрудников_Отчество_ПослеВыгрузкиСвойства_3_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФИОСотрудников_Период_ПередВыгрузкойСвойства_4_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФИОСотрудников_Период_ПриВыгрузкеСвойства_4_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФИОСотрудников_Период_ПослеВыгрузкиСвойства_4_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФИОСотрудников_Фамилия_ПередВыгрузкойСвойства_5_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФИОСотрудников_Фамилия_ПриВыгрузкеСвойства_5_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФИОСотрудников_Фамилия_ПослеВыгрузкиСвойства_5_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФИОСотрудников_ФизическоеЛицо_ПередВыгрузкойСвойства_6_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, ТипПриемника, ИмяПКО,
	ИмяПКОВидСубконто, Пусто, Выражение, УзелКоллекцииСвойств, НеЗамещать,
	ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФИОСотрудников_ФизическоеЛицо_ПриВыгрузкеСвойства_6_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, Пусто, ИмяПКО, ПКОСвойств,УзелСвойства, УзелКоллекцииСвойств,
	ИмяПКОВидСубконто, ВыгрузитьОбъект) Экспорт

	

КонецПроцедуры

Процедура ПКС_ФИОСотрудников_ФизическоеЛицо_ПослеВыгрузкиСвойства_6_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКС, ПКО, ОбъектКоллекции, Отказ, Значение, КлючИЗначение, ВидСубконто,
	Субконто, ИмяПКО, ИмяПКОВидСубконто, ПКОСвойств, УзелСвойства,
	УзелСсылки, УзелКоллекцииСвойств, УзелСубконто) Экспорт

	

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОНВЕРТАЦИИ ГРУПП СВОЙСТВ ОБЪЕКТОВ
// В данном разделе разрешено изменять реализацию процедур.

Процедура ПКГС_Организации_КонтактнаяИнформация_ПередОбработкойВыгрузки_10_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ПКО,
	ПКГС, Отказ, КоллекцияОбъектов, НеЗамещать, УзелКоллекцииСвойств, НеОчищать) Экспорт

	Если Источник.ЭтоГруппа Тогда
		Отказ = 1;
	КонецЕсли;

КонецПроцедуры

Процедура ПКГС_Организации_КонтактнаяИнформация_ПередВыгрузкойСвойства_10_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ПКО,
	ПКГС, Отказ, ОбъектКоллекции, УзелКоллекцииСвойств, УзелКоллекцииОбъектов) Экспорт

	

КонецПроцедуры

Процедура ПКГС_Организации_КонтактнаяИнформация_ПриВыгрузкеСвойства_10_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ПКО,
	ПКГС, ОбъектКоллекции, УзелКоллекцииОбъектов, УзелОбъектаКоллекции,
	УзелКоллекцииСвойств, СтандартнаяОбработка) Экспорт

	

КонецПроцедуры

Процедура ПКГС_Организации_КонтактнаяИнформация_ПослеВыгрузкиСвойства_10_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ПКО,
	ПКГС, Отказ, ОбъектКоллекции, УзелКоллекцииОбъектов, УзелКоллекцииСвойств,
	УзелОбъектаКоллекции) Экспорт

	

КонецПроцедуры

Процедура ПКГС_Организации_КонтактнаяИнформация_ПослеОбработкиВыгрузки_10_11(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКО, ПКГС, Отказ, УзелКоллекцииСвойств, УзелКоллекцииОбъектов) Экспорт

	

КонецПроцедуры

Процедура ПКГС_ФизическиеЛица_КонтактнаяИнформация_ПередОбработкойВыгрузки_9_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ПКО,
	ПКГС, Отказ, КоллекцияОбъектов, НеЗамещать, УзелКоллекцииСвойств, НеОчищать) Экспорт

	Если Источник.ЭтоГруппа Тогда
		Отказ = 1;
	КонецЕсли;

КонецПроцедуры

Процедура ПКГС_ФизическиеЛица_КонтактнаяИнформация_ПередВыгрузкойСвойства_9_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ПКО,
	ПКГС, Отказ, ОбъектКоллекции, УзелКоллекцииСвойств, УзелКоллекцииОбъектов) Экспорт

	

КонецПроцедуры

Процедура ПКГС_ФизическиеЛица_КонтактнаяИнформация_ПриВыгрузкеСвойства_9_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ПКО,
	ПКГС, ОбъектКоллекции, УзелКоллекцииОбъектов, УзелОбъектаКоллекции,
	УзелКоллекцииСвойств, СтандартнаяОбработка) Экспорт

	

КонецПроцедуры

Процедура ПКГС_ФизическиеЛица_КонтактнаяИнформация_ПослеВыгрузкиСвойства_9_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ПКО,
	ПКГС, Отказ, ОбъектКоллекции, УзелКоллекцииОбъектов, УзелКоллекцииСвойств,
	УзелОбъектаКоллекции) Экспорт

	

КонецПроцедуры

Процедура ПКГС_ФизическиеЛица_КонтактнаяИнформация_ПослеОбработкиВыгрузки_9_14(ФайлОбмена, Источник, Приемник, ВходящиеДанные, ИсходящиеДанные,
	ПКО, ПКГС, Отказ, УзелКоллекцииСвойств, УзелКоллекцииОбъектов) Экспорт

	

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ВЫГРУЗКИ ДАННЫХ
// В данном разделе разрешено изменять реализацию процедур.

Процедура ПВД_ВидыДокументовФизическихЛиц_ПередОбработкойПравила(Отказ, ИмяПКО, Правило, ИсходящиеДанные, ВыборкаДанных) Экспорт

	

КонецПроцедуры

Процедура ПВД_ВидыДокументовФизическихЛиц_ПослеОбработкиПравила(ИмяПКО, Правило, ИсходящиеДанные) Экспорт

	

КонецПроцедуры

Процедура ПВД_ВидыДокументовФизическихЛиц_ПередВыгрузкойОбъекта(ФайлОбмена, Отказ, ИмяПКО, Правило, ВходящиеДанные, ИсходящиеДанные, Объект) Экспорт

	

КонецПроцедуры

Процедура ПВД_ВидыДокументовФизическихЛиц_ПослеВыгрузкиОбъекта(ФайлОбмена, Объект, ИмяПКО, ВходящиеДанные, ИсходящиеДанные, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПВД_ВидыКонтактнойИнформации_ПередОбработкойПравила(Отказ, ИмяПКО, Правило, ИсходящиеДанные, ВыборкаДанных) Экспорт

	

КонецПроцедуры

Процедура ПВД_ВидыКонтактнойИнформации_ПослеОбработкиПравила(ИмяПКО, Правило, ИсходящиеДанные) Экспорт

	

КонецПроцедуры

Процедура ПВД_ВидыКонтактнойИнформации_ПередВыгрузкойОбъекта(ФайлОбмена, Отказ, ИмяПКО, Правило, ВходящиеДанные, ИсходящиеДанные, Объект) Экспорт

	

КонецПроцедуры

Процедура ПВД_ВидыКонтактнойИнформации_ПослеВыгрузкиОбъекта(ФайлОбмена, Объект, ИмяПКО, ВходящиеДанные, ИсходящиеДанные, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПВД_ГражданствоФизическихЛиц_ПередОбработкойПравила(Отказ, ИмяПКО, Правило, ИсходящиеДанные, ВыборкаДанных) Экспорт

	

КонецПроцедуры

Процедура ПВД_ГражданствоФизическихЛиц_ПослеОбработкиПравила(ИмяПКО, Правило, ИсходящиеДанные) Экспорт

	

КонецПроцедуры

Процедура ПВД_ГражданствоФизическихЛиц_ПередВыгрузкойОбъекта(ФайлОбмена, Отказ, ИмяПКО, Правило, ВходящиеДанные, ИсходящиеДанные, Объект) Экспорт

	

КонецПроцедуры

Процедура ПВД_ГражданствоФизическихЛиц_ПослеВыгрузкиОбъекта(ФайлОбмена, Объект, ИмяПКО, ВходящиеДанные, ИсходящиеДанные, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПВД_ДокументыФизическихЛиц_ПередОбработкойПравила(Отказ, ИмяПКО, Правило, ИсходящиеДанные, ВыборкаДанных) Экспорт

	

КонецПроцедуры

Процедура ПВД_ДокументыФизическихЛиц_ПослеОбработкиПравила(ИмяПКО, Правило, ИсходящиеДанные) Экспорт

	

КонецПроцедуры

Процедура ПВД_ДокументыФизическихЛиц_ПередВыгрузкойОбъекта(ФайлОбмена, Отказ, ИмяПКО, Правило, ВходящиеДанные, ИсходящиеДанные, Объект) Экспорт

	Таблица = Объект.Выгрузить();
	
	Для Каждого Строка Из Таблица Цикл
		
		Значение = Новый Структура();
		Значение.Вставить("ФизЛицо");
		Значение.Вставить("ВидДокумента");
		Значение.Вставить("ДатаВыдачи");
		Значение.Вставить("КемВыдан");
		Значение.Вставить("КодПодразделения");
		Значение.Вставить("Номер");
		Значение.Вставить("Представление");
		Значение.Вставить("Серия");
		ЗаполнитьЗначенияСвойств(Значение, Строка);
		
		ВыгрузитьПоПравилу(Значение,,,, "ДокументыФизическихЛиц");
		
	КонецЦикла;
	
	Отказ = Истина;

КонецПроцедуры

Процедура ПВД_ДокументыФизическихЛиц_ПослеВыгрузкиОбъекта(ФайлОбмена, Объект, ИмяПКО, ВходящиеДанные, ИсходящиеДанные, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПВД_Должности_ПередОбработкойПравила(Отказ, ИмяПКО, Правило, ИсходящиеДанные, ВыборкаДанных) Экспорт

	

КонецПроцедуры

Процедура ПВД_Должности_ПослеОбработкиПравила(ИмяПКО, Правило, ИсходящиеДанные) Экспорт

	

КонецПроцедуры

Процедура ПВД_Должности_ПередВыгрузкойОбъекта(ФайлОбмена, Отказ, ИмяПКО, Правило, ВходящиеДанные, ИсходящиеДанные, Объект) Экспорт

	

КонецПроцедуры

Процедура ПВД_Должности_ПослеВыгрузкиОбъекта(ФайлОбмена, Объект, ИмяПКО, ВходящиеДанные, ИсходящиеДанные, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПВД_Организации_ПередОбработкойПравила(Отказ, ИмяПКО, Правило, ИсходящиеДанные, ВыборкаДанных) Экспорт

	

КонецПроцедуры

Процедура ПВД_Организации_ПослеОбработкиПравила(ИмяПКО, Правило, ИсходящиеДанные) Экспорт

	

КонецПроцедуры

Процедура ПВД_Организации_ПередВыгрузкойОбъекта(ФайлОбмена, Отказ, ИмяПКО, Правило, ВходящиеДанные, ИсходящиеДанные, Объект) Экспорт

	

КонецПроцедуры

Процедура ПВД_Организации_ПослеВыгрузкиОбъекта(ФайлОбмена, Объект, ИмяПКО, ВходящиеДанные, ИсходящиеДанные, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПВД_СпособыОтраженияЗарплатыВБухУчете_ПередОбработкойПравила(Отказ, ИмяПКО, Правило, ИсходящиеДанные, ВыборкаДанных) Экспорт

	

КонецПроцедуры

Процедура ПВД_СпособыОтраженияЗарплатыВБухУчете_ПослеОбработкиПравила(ИмяПКО, Правило, ИсходящиеДанные) Экспорт

	

КонецПроцедуры

Процедура ПВД_СпособыОтраженияЗарплатыВБухУчете_ПередВыгрузкойОбъекта(ФайлОбмена, Отказ, ИмяПКО, Правило, ВходящиеДанные, ИсходящиеДанные, Объект) Экспорт

	

КонецПроцедуры

Процедура ПВД_СпособыОтраженияЗарплатыВБухУчете_ПослеВыгрузкиОбъекта(ФайлОбмена, Объект, ИмяПКО, ВходящиеДанные, ИсходящиеДанные, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПВД_СтраныМира_ПередОбработкойПравила(Отказ, ИмяПКО, Правило, ИсходящиеДанные, ВыборкаДанных) Экспорт

	

КонецПроцедуры

Процедура ПВД_СтраныМира_ПослеОбработкиПравила(ИмяПКО, Правило, ИсходящиеДанные) Экспорт

	

КонецПроцедуры

Процедура ПВД_СтраныМира_ПередВыгрузкойОбъекта(ФайлОбмена, Отказ, ИмяПКО, Правило, ВходящиеДанные, ИсходящиеДанные, Объект) Экспорт

	

КонецПроцедуры

Процедура ПВД_СтраныМира_ПослеВыгрузкиОбъекта(ФайлОбмена, Объект, ИмяПКО, ВходящиеДанные, ИсходящиеДанные, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПВД_ФизическиеЛица_ПередОбработкойПравила(Отказ, ИмяПКО, Правило, ИсходящиеДанные, ВыборкаДанных) Экспорт

	

КонецПроцедуры

Процедура ПВД_ФизическиеЛица_ПослеОбработкиПравила(ИмяПКО, Правило, ИсходящиеДанные) Экспорт

	

КонецПроцедуры

Процедура ПВД_ФизическиеЛица_ПередВыгрузкойОбъекта(ФайлОбмена, Отказ, ИмяПКО, Правило, ВходящиеДанные, ИсходящиеДанные, Объект) Экспорт

	
	МенеджерЗаписи = СотрудникиФормыБазовый.МенеджерПоследнейЗаписиДокументовФизическихЛиц(Объект.Ссылка);
	
	Значение = Новый Структура();
	Значение.Вставить("ФизЛицо");
	Значение.Вставить("ВидДокумента");
	Значение.Вставить("ДатаВыдачи");
	Значение.Вставить("КемВыдан");
	Значение.Вставить("КодПодразделения");
	Значение.Вставить("Номер");
	Значение.Вставить("Представление");
	Значение.Вставить("Серия");
	ЗаполнитьЗначенияСвойств(Значение, МенеджерЗаписи);
	
	ВходящиеДанные = Новый Структура("Документ", Значение);

КонецПроцедуры

Процедура ПВД_ФизическиеЛица_ПослеВыгрузкиОбъекта(ФайлОбмена, Объект, ИмяПКО, ВходящиеДанные, ИсходящиеДанные, УзелСсылки) Экспорт

	

КонецПроцедуры

Процедура ПВД_ФИОФизическихЛиц_ПередОбработкойПравила(Отказ, ИмяПКО, Правило, ИсходящиеДанные, ВыборкаДанных) Экспорт

	

КонецПроцедуры

Процедура ПВД_ФИОФизическихЛиц_ПослеОбработкиПравила(ИмяПКО, Правило, ИсходящиеДанные) Экспорт

	

КонецПроцедуры

Процедура ПВД_ФИОФизическихЛиц_ПередВыгрузкойОбъекта(ФайлОбмена, Отказ, ИмяПКО, Правило, ВходящиеДанные, ИсходящиеДанные, Объект) Экспорт

	

КонецПроцедуры

Процедура ПВД_ФИОФизическихЛиц_ПослеВыгрузкиОбъекта(ФайлОбмена, Объект, ИмяПКО, ВходящиеДанные, ИсходящиеДанные, УзелСсылки) Экспорт

	

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОЧИСТКИ ДАННЫХ
// В данном разделе разрешено изменять реализацию процедур.

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ПАРАМЕТРОВ
// В данном разделе разрешено изменять реализацию процедур.

////////////////////////////////////////////////////////////////////////////////
// АЛГОРИТМЫ
// Данный раздел разрешено изменять.
// Также допустимо размещать процедуры с алгоритмами в любом из разделов выше.

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
// Данный раздел изменять запрещено.

// Устанавливает значение параметра "Загрузка" для свойства объекта "ОбменДанными".
//
// Параметры:
//  Объект   - объект, для которого устанавливается свойство
//  Значение - значение устанавливаемого свойства "Загрузка"
// 
Процедура УстановитьОбменДаннымиЗагрузка(Объект, Значение = Истина, Знач ОтправкаНазад = Ложь)

	ОбщиеПроцедурыФункции.УстановитьОбменДаннымиЗагрузка(Объект, Значение, ОтправкаНазад);
	
КонецПроцедуры

// Записывает объект в информационную базу.
//
// Параметры:
//	Объект - Записываемый объект.
//	Тип - Строка - Тип объекта строкой.
// 
Процедура ЗаписатьОбъектВИБ(Объект, Тип, ЗаписатьОбъект = Ложь, Знач ОтправкаНазад = Ложь)

	ОбщиеПроцедурыФункции.ЗаписатьОбъектВИБ(Объект, Тип, ЗаписатьОбъект, ОтправкаНазад);
	
КонецПроцедуры

// Отменяет проведение объекта в информационной базе.
//
// Параметры:
//	Объект - Объект для отмены проведения.
//	Тип - Строка - Тип объекта строкой.
//
Процедура ОтменитьПроведениеОбъектаВИБ(Объект, Тип, ЗаписатьОбъект = Ложь)

	ОбщиеПроцедурыФункции.ОтменитьПроведениеОбъектаВИБ(Объект, Тип, ЗаписатьОбъект);
	
КонецПроцедуры

// Выгружает регистр по отбору.
// 
// Парметры:
//	НаборЗаписейДляВыгрузки - Структура или НаборЗаписей - Отбор
//
Процедура ВыгрузитьРегистр(НаборЗаписейДляВыгрузки, 
							Правило = Неопределено, 
							ВходящиеДанные = Неопределено, 
							НеВыгружатьОбъектыПоСсылкам = Ложь, 
							ИмяПКО = "",
							ПравилоВыгрузкиДанных = Неопределено)
							
	ОбщиеПроцедурыФункции.ВыгрузитьРегистр(НаборЗаписейДляВыгрузки, Правило, ВходящиеДанные, НеВыгружатьОбъектыПоСсылкам, ИмяПКО, ПравилоВыгрузкиДанных);

КонецПроцедуры

// Устанавливает пометку удаления.
//
// Параметры:
//	Объект - Объект для установки пометки.
//	ПометкаУдаления - Булево - Флаг пометки удаления.
//	ИмяТипаОбъекта - Строка - Тип объекта строкой.
//
Процедура УстановитьПометкуУдаленияУОбъекта(Объект, ПометкаУдаления, ИмяТипаОбъекта)
	
	ОбщиеПроцедурыФункции.УстановитьПометкуУдаленияУОбъекта(Объект, ПометкаУдаления, ИмяТипаОбъекта);
	
КонецПроцедуры

// Создает в файле обмена запись об удалении объекта.
//
// Параметры:
//	Ссылка - Ссылка на удаляемый объект.
//	ТипПриемника - Строка - Содрежит строковое представление типа приемника.
//	ТипИсточника - Строка - Содрежит строковое представление типа источника.
// 
Процедура ЗаписатьВФайлУдалениеОбъекта(Ссылка, Знач ТипПриемника, Знач ТипИсточника)
	
	ОбщиеПроцедурыФункции.ЗаписатьВФайлУдалениеОбъекта(Ссылка, ТипПриемника, ТипИсточника);
	
КонецПроцедуры

// Добавляет в xml файл информацию о типах значения
//
// Параметры:
//	Приемник - xml-узел объекта приемника
//	Тип - Строка - выгружаемый тип
//		- Массив - содержит список выгружаемых строковых типов
//	СписокАтрибутов - Структура - Ключ содержит имя атрибута
//
Процедура ВыгрузитьИнформациюОТипах(Приемник, Тип, СписокАтрибутов = Неопределено) Экспорт
	
	ОбщиеПроцедурыФункции.ВыгрузитьИнформациюОТипах(Приемник, Тип, СписокАтрибутов);
	
КонецПроцедуры

// Регистрирует объект, созданный при выгрузке.
//
// Параметры:
//	Ссылка - Ссылка на регистрируемый объект.
// 
Процедура ЗарегистрироватьОбъектСозданныйПриВыгрузке(Ссылка)
	
	ОбщиеПроцедурыФункции.ЗарегистрироватьОбъектСозданныйПриВыгрузке(Ссылка);
	
КонецПроцедуры

// Регистрирует предупреждение в журнале регистрации.
// Если в процессе обмена данными было обращение к этой процедуре, то обмен данными остановлен не будет.
// После завершения обмена статус выполнения обмена в мониторе для пользователя будет иметь значение "Предупреждение", если не было ошибок.
//
// Параметры:
//  Предупреждение - Строка. Текст предупреждения, который надо зарегистрировать.
// Информация, предупреждения и ошибки, возникающие в процессе обмена данными регистрируются в журнале регистрации.
// 
Процедура ЗарегистрироватьПредупреждение(Предупреждение)
	
	ОбщиеПроцедурыФункции.ЗарегистрироватьПредупреждение(Предупреждение);
	
КонецПроцедуры

// Служебная. Инициализирует переменные, необходимые для отладки
//
// Параметры:
//  Владелец - Обработка КонвертацияОбъектовИнформационныхБаз
//
Процедура ПодключитьОбработкуДляОтладки(Владелец) Экспорт

	Параметры            	 = Владелец.Параметры;
	ОбщиеПроцедурыФункции	 = Владелец;
	Запросы              	 = Владелец.Запросы;
	УзелДляОбмена		 	 = Владелец.УзелДляОбмена;

КонецПроцедуры

// Производит выгрузку объекта в соответствии с указанным правилом конвертации
//
// Параметры:
//  Источник				 - произвольный источник данных
//  Приемник				 - xml-узел объекта приемника
//  ВходящиеДанные			 - произвольные вспомогательные данные, передаваемые правилу
//                             для выполнения конвертации
//  ИсходящиеДанные			 - произвольные вспомогательные данные, передаваемые правилам
//                             конвертации свойств
//  ИмяПКО					 - имя правила конвертации, согласно которому осуществляется выгрузка
//
// Возвращаемое значение:
//  xml-узел ссылки или значение приемника
//
Функция ВыгрузитьПоПравилу(Источник					= Неопределено,
						   Приемник					= Неопределено,
						   ВходящиеДанные			= Неопределено,
						   ИсходящиеДанные			= Неопределено,
						   ИмяПКО					= "")
						   
	Возврат ОбщиеПроцедурыФункции.ВыгрузитьПоПравилу(Источник, Приемник, ВходящиеДанные, ИсходящиеДанные, ИмяПКО);

КонецФункции

// Признак того, что это загрузка в информационную базу.
// 
// Возвращаемое значение:
//	Булево - Признак режима загрузки данных
// 
Функция РежимЗагрузкиДанныхВИнформационнуюБазу()
	
	Возврат ОбщиеПроцедурыФункции.РежимЗагрузкиДанныхВИнформационнуюБазу();
	
КонецФункции

#КонецЕсли
