
#Область ПрограммныйИнтерфейс

#Область СПАРК

Функция ЦветаСПАРК() Экспорт
	
	ЦветаСПАРК = Новый Структура;
	ЦветаСПАРК.Вставить("ВысокийРиск",			ЦветаСтиля.ЦветГрадацияСПАРКВысокийРиск);
	ЦветаСПАРК.Вставить("СреднийРиск",			ЦветаСтиля.ЦветГрадацияСПАРКСреднийРиск);
	ЦветаСПАРК.Вставить("НизкийРиск",			ЦветаСтиля.ЦветГрадацияСПАРКНизкийРиск);
	ЦветаСПАРК.Вставить("ПросроченныеДанные",	ЦветаСтиля.ПросроченныеДанныеЦвет);
	ЦветаСПАРК.Вставить("ОсобыйТекст",			ЦветаСтиля.ЦветОсобогоТекста);
	
	Возврат ЦветаСПАРК;
	
КонецФункции

Функция СобытияМониторинга() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	КонтрагентыНаМониторингеСПАРКРиски.Контрагент КАК Контрагент,
	|	СвойстваКонтрагентовСПАРКРиски.СвояОрганизация КАК СвояОрганизация
	|ПОМЕСТИТЬ КонтрагентыДляМониторинга
	|ИЗ
	|	РегистрСведений.КонтрагентыНаМониторингеСПАРКРиски КАК КонтрагентыНаМониторингеСПАРКРиски
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СвойстваКонтрагентовСПАРКРиски КАК СвойстваКонтрагентовСПАРКРиски
	|		ПО КонтрагентыНаМониторингеСПАРКРиски.Контрагент = СвойстваКонтрагентовСПАРКРиски.Контрагент
	|ГДЕ
	|	СвойстваКонтрагентовСПАРКРиски.ИННКорректный
	|	И НЕ КонтрагентыНаМониторингеСПАРКРиски.Контрагент.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Контрагент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СобытияМониторингаСПАРКРиски.ДатаМониторинга КАК ДатаМониторинга,
	|	СобытияМониторингаСПАРКРиски.Контрагент,
	|	ТипыСобытийСПАРКРиски.Ссылка КАК Событие,
	|	СобытияМониторингаСПАРКРиски.НовоеЗначение КАК НовоеЗначение,
	|	СобытияМониторингаСПАРКРиски.СтароеЗначение КАК СтароеЗначение,
	|	КонтрагентыДляМониторинга.СвояОрганизация КАК СвояОрганизация,
	|	"""" КАК ИНН,
	|	ТипыСобытийСПАРКРиски.Критичное КАК КритичноеСобытие,
	|	ТипыСобытийСПАРКРиски.Название КАК НазваниеСобытия
	|ИЗ
	|	РегистрСведений.СобытияМониторингаСПАРКРиски КАК СобытияМониторингаСПАРКРиски
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТипыСобытийСПАРКРиски КАК ТипыСобытийСПАРКРиски
	|		ПО СобытияМониторингаСПАРКРиски.ТипСобытияИдентификатор = ТипыСобытийСПАРКРиски.Идентификатор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ КонтрагентыДляМониторинга КАК КонтрагентыДляМониторинга
	|		ПО СобытияМониторингаСПАРКРиски.Контрагент = КонтрагентыДляМониторинга.Контрагент";
	
	ТаблицаДанных = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаДанных;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработкаНовостей

// Возвращает значение варианта отбора по ленте новостей
// Подробнее в описании метода Справочник.Новости.ПолучитьСписокНовостей()
//
Функция ВариантОтбораПоЛентеНовостей() Экспорт
	
	Возврат 1;
	
КонецФункции

Функция КоличествоКонтекстныхНовостей() Экспорт
	
	Возврат 50;
	
КонецФункции

// Функция - возвращает ссылку на элемент справочника "Ленты новостей"
// 
// Возвращаемое значение:
//  СправочникСсылка.ЛентыНовостей - ссылка на справочник
//
Функция ЛентаНовостейЧтоНового() Экспорт
	
	Возврат ОбработкаНовостейПовтИсп.ПолучитьЛентуНовостейПоКоду("WhatIsNew");
	
КонецФункции

// Функция - Порядок контекстных новостей
// 
// Возвращаемое значение:
//  Строка - перечисление через запятую порядка сортировки новостей
//
Функция ПорядокКонтекстныхНовостей() Экспорт
	
	Возврат  "Прочтена Возр, ДатаПубликации Убыв, Важность Убыв";
	
КонецФункции

// Процедура - Снятие выделения элементов дерева
//
// Параметры:
//  СтрокаДерева - СтрокаДереваЗначений - строка дерева значений, с которого нужно снять пометку "Прочитано"
//
Процедура СнятиеВыделенияЭлементовДерева(СтрокаДерева) Экспорт
	
	СписокЭлементовДерева = СтрокаДерева.ПолучитьЭлементы();
	Для Каждого ЭлементДерева Из СписокЭлементовДерева Цикл
		
		ЭлементДерева.ВыделеннаяСтрока = Ложь;
		СнятиеВыделенияЭлементовДерева(ЭлементДерева);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти